[
  {
    "title": "Beavis and Butt-head Do America Script",
    "writers": "Written by Mike Judge,Joe Stillman",
    "a_url": "https://imsdb.com/genre/Comedy/Movie Scripts/Beavis and Butt-head Do America Script.html",
    "screenplay_text": [
      "Beavis and Butt-Head Do America - by Mike Judge and Joe Stillman",
      "\"BEAVIS AND BUTT-HEAD DO AMERICA\"",
      "by",
      "Mike Judge and Joe Stillman",
      "The movie begins with scenes of people screaming in horror \r\n\tand running down the streets of a big city. The ground shakes from \r\n\twhat seems like giant footsteps. There are pieces of building \r\n\tdebris falling everywhere, people getting crushed, power lines \r\n\tcoming down, etc. - complete pandemonium. It all looks very much \r\n\tlike a Japanese animated King-Kong or Godzilla movie. We hear the \r\n\tfootsteps getting closer and the ground shaking becomes more \r\n\tintense - more debris falling. Then we see a HUGE BLACK TENNIS \r\n\tSHOE come into frame and smash a National Guard truck. As we pan \r\n\tup, we see the white socks, then the red shorts, the AC/DC T-\r\n\tshirt, then we hear the familiar, \"Huh huh huh.\" - only it's a \r\n\thuge sound...this is a THREE-HUNDRED FOOT TALL BUTT-HEAD. \"Butt-\r\n\tKong\" continues his path of destruction - stomping on cars and \r\n\tbuildings and saying, \"This is cool. Huh huh huh.\"\r\n\t\tAirplanes and tanks start firing at Butt-Head (Butt-Kong). \r\n\tHe looks irritated and says, \"Cut it out butt-munch!\" Butt-Head \r\n\tswats at the planes, sending them crashing to the ground and \r\n\tstomps on the tanks. Then, something catches his eye. Butt-Head \r\n\treaches into a skyscraper and picks up a nice looking woman - a \r\n\tlot like the one from the King Kong movie. He looks down at her in \r\n\this hand and goes wide-eyed, \"Whoa! Huh huh huh.\" The woman \r\n\tscreams in terror as Butt-Head looks down at her and tries a few \r\n\tlame pick up lines. \"Uuuuh...Hey baby. I'm like, pretty tall. Huh \r\n\thuh huh.\" He swats down a helicopter that is circling his head, \r\n\t\"Dammit, I'm trying to score!\" The helicopter goes down in flames. \r\n\tWe CUT TO some guys sitting on a tank firing at him. They notice \r\n\tgiant footsteps coming from the other direction and turn the tank \r\n\taround. Through their binoculars we see a THREE-HUNDRED FOOT \r\n\tBEAVIS coming from the horizon. The giant Beavis is even more \r\n\tdestructive than Butt-Kong (maybe he could be breathing fire). \r\n\tBeavis starts trying to pick up on Butt-Head's woman. Butt-Head \r\n\tputs the woman down and he and Beavis begin to go at it, leveling \r\n\tthe city with one of their stupid juvenile smack-fights.\r\n\t\tWe CROSS-DISSOLVE from three-hundred foot Beavis shaking \r\n\tButt-Kong to Butt-Head asleep on the couch with Beavis shaking \r\n\thim.",
      "INT.  B&B'S HOME - DAY",
      "BEAVIS (O.C.)",
      "Butt-Head! Butt-Head! Hey, Butt-Head!",
      "Butt-Head is dead asleep on the couch. Beavis shakes him.",
      "BEAVIS",
      "Butt-Head, wake up, wake up!",
      "Butt-Head comes around.",
      "BUTT-HEAD",
      "Dammit, Beavis, I was about to score.\r\n\t\t\tHuh huh.",
      "BEAVIS",
      "Yeah, but check it out. It's gone!",
      "BUTT-HEAD",
      "What's gone?",
      "BEAVIS",
      "The TV.",
      "Beavis is making STRANGE NOISES, in a state of shock.",
      "Butt-Head rubs his eyes and looks at the empty space where the TV \r\n\twas.",
      "BUTT-HEAD",
      "Uuuuuuh, huh huh. Uuh,...",
      "Out the window, we see two YOUNG MEN carrying B&B's TV into their \r\n\tvan.",
      "Still on the couch, Butt-Head looks over at the broken window. We \r\n\tsee a CROWBAR lying on the floor, and the front door left open.",
      "Butt-Head looks at the BROKEN WINDOW, at the CROWBAR, the OPEN \r\n\tDOOR, then back at the EMPTY SPACE where the TV was. He does this \r\n\ta couple of times - piecing it all together.",
      "BUTT-HEAD (CONT.)",
      "Whoa! I think I just figured something\r\n\t\t\tout Beavis.",
      "BEAVIS",
      "What?",
      "BUTT-HEAD",
      "This sucks.",
      "BEAVIS",
      "Yeah, heh heh.",
      "Beavis is still in shock. They both stare at the empty space where \r\n\tthe TV was for a beat, not quite sure what to do.",
      "Beavis is SHAKING AND MAKING WEIRD NOISES. He presses buttons on \r\n\tthe remote a few times, as if it might help somehow.",
      "BUTT-HEAD",
      "This sucks more than anything that\r\n\t\t\thas ever sucked before. We must find\r\n\t\t\tthis butt-hole that took the TV.",
      "EXT.  CITY STREET - NIGHT",
      "Bad neighborhood. 70's music blares.",
      "A fast driving car drives right at us and stops. Punks run in \r\n\tfear. Beavis hops out of the driver's seat, wearing bell-bottoms, \r\n\tchain jewelry and a 70's afro. Into a dramatic CLOSE-UP, he takes \r\n\toff his glasses.",
      "FREEZE ON BEAVIS",
      "ANNOUNCER",
      "Beavis!",
      "FRAME UNFREEZES. Beavis whips out a huge gun.",
      "BEAVIS",
      "Freeze, butt-wipe!",
      "An attacker comes from one side. Beavis uses Judo. Another tosses \r\n\ta knife. Beavis ducks, then shoots with two hands, police style.",
      "INT.  BEDROOM - NIGHT",
      "Swinger's pad. Totally 70's. A group of bikini'd girls on a \r\n\twaterbed. Butt-Head approaches them. He wears a leisure suit, \r\n\tcollar way open. He plops down in the bed.",
      "FREEZE ON BUTT-HEAD",
      "ANNOUNCER",
      "Butt-Head!",
      "FRAME UNFREEZES. The girls wrap their arms around him.",
      "BUTT-HEAD",
      "Huh huh huh. Come to Butt-Head, baby.",
      "ANNOUNCER",
      "Star in...",
      "MAIN TITLE - FULL FRAME",
      "EXT.  CITY STREETS - DAY/NIGHT",
      "ACTION MONTAGE BEGINS. Styled like a 70's cop show opening.",
      "OPENING CREDITS to the movie appear just as cop show credits \r\n\twould.",
      "Beavis does a Starsky and Hutch-style roll with a gun.",
      "Butt-Head slaps a pimp.",
      "Beavis drives, chasing a car.",
      "Butt-Head is slapped by a girl.",
      "BUTT-HEAD",
      "Huh huh huh. That was cool.",
      "Beavis and Butt-Head are in a warehouse shoot-out.",
      "A black police chief rises from a desk to yell at B&B.",
      "B&B dive for cover just before a building explodes.",
      "In CLOSE-UP, Beavis smiles for an ID shot.",
      "Butt-Head does the same.",
      "Beavis, in a rooftop fight, kicks his opponent over the edge.",
      "A beautiful woman, back to us, takes off her dress for Butt-Head. \r\n\tFINAL OPENING CREDIT APPEARS. Butt-Head and the woman fall into \r\n\tbed. Suddenly...",
      "INT.  SCHOOL HALLWAY/DOOR TO A.V. ROOM - DAY",
      "From inside, SOUND of equipment crashing.",
      "B&B come out wheeling a TV on one of those carts. There are cables \r\n\tattached to it still leading back into the A.V. room. As they push \r\n\tthe cart we hear more equipment falling.",
      "BUTT-HEAD",
      "Dammit, it's stuck.",
      "They give it one big push and it finally breaks free. We see that \r\n\tthe cables are tangled with cables from other TVs and VCRs, which \r\n\tall come crashing to the ground.",
      "BUTT-HEAD (CONT.)",
      "Huh huh huh. That was cool.",
      "BEAVIS",
      "Yeah, heh heh. Let's just wheel this\r\n\t\t\tthing back to the house.",
      "INT.  SCHOOL/ANOTHER HALLWAY - DAY",
      "MR. VAN DRIESSEN stops B&B.",
      "VAN DRIESSEN",
      "Ah, excuse me boys. What's going on\r\n\t\t\there?",
      "BUTT-HEAD",
      "Uh, someone stole our TV.",
      "BEAVIS",
      "Yeah. We're just gonna use this one.\r\n\t\t\tGet outta the way. Heh heh.",
      "VAN DRIESSEN",
      "I'm afraid that TV belongs to the school.\r\n\t\t\tMmmkay? You know, this could be a positive\r\n\t\t\texperience for you guys. There's a\r\n\t\t\twonderful world out there when we discover\r\n\t\t\twe don't need TV to entertain us.",
      "BUTT-HEAD",
      "Huh huh huh. He said \"anus.\"",
      "BEAVIS",
      "(to himself)\r\n\t\t\tEntert-ain...us...an-us...Oh yeah! Heh \r\n\t\t\theh. Anus. Heh heh.",
      "VAN DRIESSEN",
      "(frustrated)\r\n\t\t\tHave you guys heard a word I've said?",
      "BUTT-HEAD",
      "Yeah, \"anus.\" Huh huh huh huh.",
      "VAN DRIESSEN",
      "Look, guys, just take the TV back to the\r\n\t\t\tA.V. room right now. And try to be a little\r\n\t\t\tmore open-minded. Mmkay?",
      "Van Driessen leaves. B&B continue to wheel the cart home.",
      "BUTT-HEAD",
      "What a dork. Huh huh.",
      "BEAVIS",
      "Yeah, heh heh. He's a anus. Heh heh.",
      "EXT.  SCHOOL/STAIRWAY - DAY",
      "B&B arrive with the cart at the top of a stairway. They lamely \r\n\tattempt to let it slowly down the steps. The cart is too top-heavy \r\n\tand goes tumbling to the bottom of the stairs, shattering the TV.",
      "BUTT-HEAD",
      "Huh huh huh. That was cool.",
      "BEAVIS",
      "No it wasn't!",
      "BUTT-HEAD",
      "Uh,...Oh yeah.",
      "B&B stand at the top of the stairs looking down at the wrreckage. \r\n\tPRINCIPAL McVICKER shows up by the TV.",
      "McVICKER\r\n\t\t\tWhy.... You... You bastards... Ge...\r\n\t\t\tget out! You're suspended. One more\r\n\t\t\tscrew up... and you're expelled.",
      "B&B walk off laughing.",
      "EXT.  THE ANDERSON'S DRIVEWAY - DUSK",
      "B&B walk up. There's a camper in the driveway.",
      "BUTT-HEAD",
      "Whoa, check it out Beavis. I didn't\r\n\t\t\tknow Anderson had a Camper.",
      "BEAVIS",
      "Yeah, heh heh. Maybe it has a TV.\r\n\t\t\tHeh heh. TV.",
      "B&B walk up to the camper and start to open the door just as MARCY \r\n\tANDERSON opens it. (As usual, she doesn't recognize them.)",
      "MARCY",
      "Oh, hello. Are you guys here to look\r\n\t\t\tat the refrigerator?",
      "BUTT-HEAD",
      "Uh, no.",
      "BEAVIS",
      "We're here to look at the TV. Heh heh.",
      "MARCY",
      "Oh, I didn't realize it was broken.\r\n\t\t\tCome on in.",
      "BUTT-HEAD",
      "Cool. Huh huh huh.",
      "B&B walk into the camper. Marcy stays outside.",
      "EXT.  ANDERSON'S CAMPER - SAME TIME",
      "Tom is adjusting the trailer-hitch. Marcy watches.",
      "TOM",
      "Well that oughtta hold her. Ya know,\r\n\t\t\tthe most important thing you can have\r\n\t\t\ton a camper is a good propane regulator,\r\n\t\t\tand this here's the best one they make.",
      "MARCY",
      "I sure hope we can get the 'fridge fixed\r\n\t\t\tbefore we leave.",
      "TOM",
      "Now Marcy, we've been savin' for this trip\r\n\t\t\tour whole lives and we're gonna go come\r\n\t\t\tHell or high water...",
      "Through the camper walls, we hear the faint sound of B&B",
      "AIR/MOUTH-GUITARING \"IRON MAN.\"",
      "TOM (CONT.)",
      "What the hell is that noise?",
      "INT.  ANDERSON'S CAMPER - DUSK",
      "B&B watch a \"Cops\"-type show. Beavis gets up, goes to the \r\n\trefrigerator and grabs a soda. The refrigerator is under the \r\n\tcounter on which the TV is sitting.",
      "Beavis takes a sip and then does a SPIT TAKE, SPRAYING SODA ALL",
      "OVER THE TOP OF THE TV.",
      "BEAVIS",
      "AAAAAAGH!!! This crap is warm!",
      "ANGLE ON TV: The soda Beavis spit out drips into the inside of the \r\n\tTV. We see smoke and hear SIZZLING AND SHORT CIRCUIT SFX. The TV \r\n\tgoes dead.",
      "BUTT-HEAD",
      "Beavis, you butt-hole! You broke it.",
      "EXT.  ANDERSON'S CAMPER - DUSK",
      "B&B come out. Tom notices them.",
      "TOM",
      "Hey, what's goin' on here?",
      "MARCY",
      "They're here to fix the TV, Tom.",
      "TOM",
      "The TV ain't broken.",
      "BUTT-HEAD",
      "Yeah it is. Huh huh huh.",
      "Tom adjusts his glasses as he looks at B&B.",
      "TOM'S BLURRY P.O.V.: We see B&B out of focus.",
      "TOM",
      "Hey wait a minute. You two look kinda\r\n\t\t\tfamiliar. Ain't you them kids that've\r\n\t\t\tbeen whackin' off in my tool shed?",
      "BEAVIS & BUTT-HEAD",
      "Huh huh huh huh huh.",
      "ANGLE ON BEAVIS: looking particularly guilty, eyes shifting back \r\n\tand forth.",
      "B&B walk off, leaving Tom wondering.",
      "EXT.  STREET IN A SEEDY PART OF TOWN - JUST BEFORE DAWN",
      "B&B are having TV withdrawal. Butt-Head is bug-eyed. Beavis has \r\n\tthe shakes bad, arms folded like Dustin Hoffman in \"Midnight \r\n\tCowboy.\"",
      "BEAVIS",
      "Nnnnooo. Oooooh nooooo.",
      "BUTT-HEAD",
      "What's your problem Beavis?",
      "BEAVIS",
      "I need TV now! Now! NNNNDAMMIT!!!",
      "Butt-Head stops short. He looks up. His face is bathed in a \r\n\tgolden, throbbing light.",
      "BUTT-HEAD'S P.O.V.: We see a flashing neon sign that says, \"TV\". \r\n\tPull back to show B&B are standing outside the Elite Motel Lodge, \r\n\tfeaturing \"Color TV\" and \"Air-Cooled Rooms\", with \"Special Nap \r\n\tRates.\"",
      "B&B stare up, as if at a god.",
      "BEAVIS",
      "(crazed)\r\n\t\t\tHeh heh. TV. Heh Teee Veee.",
      "EXT.  MOTEL COURT - CONTINUOUS",
      "Butt-Head tries the first door. It's locked. He tries the second \r\n\tdoor. It's locked. He tries the third door. It opens.",
      "B&B's eyes bulge. Inside, PRINCIPAL McVICKER is lying across the \r\n\tlegs of an obvious prostitute, his pants pulled down. She SPANKS \r\n\thim.",
      "McVICKER\r\n\t\t\tPlease mmm... may I have another?!",
      "B&B LAUGH. McVicker hears and looks up.",
      "McVICKER (CONT.)\r\n\t\t\tBeavis and Butt-Head! Y...y...you\r\n\t\t\tbastards.",
      "BEAVIS",
      "Can we watch your TV?",
      "McVICKER\r\n\t\t\tY... Y... You're expelled! Get out!",
      "Butt-Head closes the door, laughing, and starts to walk towards \r\n\tthe next door. The muffled sound of a SPANK can be heard followed \r\n\tby McVicker asking for another.",
      "BUTT-HEAD",
      "Huh huh huh. That was cool.",
      "BEAVIS",
      "Dammit! I need a TV now! We're missing\r\n\t\t\teverything!",
      "INT.  MOTEL ROOM - CONTINUOUS",
      "The only light in the room is a flickering TV. Sitting on the bed, \r\n\ttalking on the phone is MUDDY. He's a tough, mean looking red-neck \r\n\t- a Jack Ruby type.",
      "On the nightstand next to him is a three-quarter drunk bottle of \r\n\tbourbon and a manila envelope. On his lap is a big gun.",
      "MUDDY",
      "...Are you sure these guys can pull this\r\n\t\t\toff? It's gotta look like an accident...",
      "We hear a knock on the door and muffled B&B laughs.",
      "MUDDY (CONT.)",
      "Hold on a minute. That must be them now.\r\n\t\t\tI'll call you back. (Hangs up phone)...\r\n\t\t\tCome in!",
      "B&B walk in. Muddy turns on the light.",
      "BEAVIS",
      "(sounding suddenly sedated)\r\n\t\t\tAaaah. TeeeVeeeee, heh heh.",
      "MUDDY",
      "Yer late.",
      "BUTT-HEAD",
      "Why? Did we miss American Gladiators?",
      "MUDDY'S P.O.V.: B&B are a drunken blur.",
      "MUDDY",
      "Well, Earl said you guys were young, but\r\n\t\t\tjeez... Oh well, as long as you can get\r\n\t\t\tthe job done. So what are your names?",
      "BUTT-HEAD",
      "Uh, Butt-Head.",
      "BEAVIS",
      "Beavis.",
      "MUDDY",
      "That's alright. I'd rather not know your\r\n\t\t\treal names anyways. I'm Muddy. Look, I'm\r\n\t\t\tgonna get right to the point. I'll pay you\r\n\t\t\tten grand plus expenses, all payable after\r\n\t\t\tyou do her...",
      "BUTT-HEAD",
      "(full of innuendo)\r\n\t\t\tDo her? Huh huh.",
      "MUDDY",
      "That's right. I'm offering you ten grand\r\n\t\t\tplus expenses to do my wife. We gotta deal?",
      "Butt-Head stares in shock.",
      "BEAVIS",
      "Actually, we just wanna watch TV...",
      "BUTT-HEAD",
      "Shut up Beavis! Uh, yeah. We'll do your\r\n\t\t\twife.",
      "BEAVIS",
      "(trembling)\r\n\t\t\tNnnnaah...We need to watch TV DAMMIT!!!",
      "Butt-Head SMACKS Beavis and pulls him aside.",
      "BUTT-HEAD",
      "Beavis, you butt-munch, this guy wants us\r\n\t\t\tto score with his wife. And he's gonna pay\r\n\t\t\tus. We can buy a new TV.",
      "BEAVIS",
      "Oh, heh heh really? Cool. Heh heh.",
      "BUTT-HEAD",
      "(to Muddy)\r\n\t\t\tUh, huh huh... We'll do it, sir.",
      "MUDDY",
      "Okay, then let's get down to business.",
      "ANGLE ON THE BED. Muddy slaps down a picture of DALLAS, his wife. \r\n\tLeather clad, biker, beautiful.",
      "MUDDY (CONT.)",
      "Here she is. Her name's Dallas. She ain't\r\n\t\t\tas sweet as she looks. She stole everything\r\n\t\t\tfrom me. Ya gotta watch out, 'cause she'll\r\n\t\t\tdo you twice as fast as you'd do her.",
      "BUTT-HEAD",
      "Whoa, huh huh. Cool.",
      "Muddy plunks down PLANE TICKETS.",
      "MUDDY",
      "She's holed up in a hotel room in Las\r\n\t\t\tVeags. Your flight leaves in a couple of\r\n\t\t\thours. Now c'mon, I'll drive you to the\r\n\t\t\tairport.",
      "BUTT-HEAD",
      "Holed up. Huh huh huh. Holed.",
      "BEAVIS",
      "Can we watch some TV first?",
      "Muddy picks up the gun and SHOOTS the TV.",
      "MUDDY",
      "No.",
      "EXT.  CITY STREETS - MORNING",
      "Muddy driving his loud four-by-four like a maniac, drunk with \r\n\tbloodshot eyes. B&B are in the back seat. He eyes them through the \r\n\trearview. Meanwhile, a cat bounces off the windshield with a",
      "SHRIEK.",
      "MUDDY",
      "One more thing. Mah wife's got this\r\n\t\t\tleather satchel. It's black, about this\r\n\t\t\tbig. I need ya to bring it back. It's\r\n\t\t\treal important. Sentimental value... Any\r\n\t\t\tquestions so far?",
      "BUTT-HEAD",
      "Uh, yeah. Does she have big hooters?",
      "MUDDY",
      "She sure does.",
      "BUTT-HEAD",
      "This is gonna be cool! Huh huh huh.",
      "BEAVIS",
      "Yeah, heh heh. Boooooiiiing!!!",
      "MUDDY",
      "Just make sure it looks like an \r\n\t\t\taccident...",
      "BEAVIS",
      "(spastic)\r\n\t\t\tYeah, heh heh. I think I just had an\r\n\t\t\taccident. Heh heh hmm heh hmm heh.",
      "MUDDY",
      "Huh huh. You guys are funny. Let's have\r\n\t\t\ta drink on it.",
      "Muddy swigs the last swallow from his bottle of bourbon.",
      "EXT.  AIRPORT - EARLY MORNING",
      "In an overhead view, the four-by-four screeches up to the gate, \r\n\tfishtails to a stop, throwing B&B onto the sidewalk, and peels \r\n\taway.",
      "BUTT-HEAD",
      "We're gonna get paid to score.",
      "BEAVIS",
      "Yeah, heh heh, and then we're gonna\r\n\t\t\tget a big-screen TV! Heh heh.",
      "BUTT-HEAD",
      "Beavis, this is the greatest day of\r\n\t\t\tour lives. Huh huh huh.",
      "INT.  AIRPLANE - DAY",
      "B&B enter the plane. They sit down in the first two seats on the \r\n\tright - in First Class. A flight attendant, DOLORIS approaches \r\n\tthem.",
      "DOLORIS",
      "Hi. Can I help you find your seats?",
      "BUTT-HEAD",
      "Uuh, nah. These seats are OK.",
      "DOLORIS",
      "I think your tickets have you seated\r\n\t\t\tin row fourteen, coach. So why don't\r\n\t\t\tyou just go ahead and move back, OK?",
      "BUTT-HEAD",
      "That's OK. Someone else can have those.",
      "BEAVIS",
      "Yeah, it's not that important to me,\r\n\t\t\treally. Those seats are too small anyways.",
      "Doloris yanks them out of their seats and leads them down the \r\n\taisle.",
      "ANGLE DOWN AISLE in coach. Doloris stops by a row where an elderly \r\n\twoman, MARTHA, sits by the window. Next to her: Two empty seats.",
      "DOLORIS",
      "Here you are.",
      "She gestures to the seats and leaves. Beavis climbs in the middle, \r\n\tButt-Head in the aisle - still watching Doloris.",
      "BUTT-HEAD",
      "Hey Beavis. When she was leading us down\r\n\t\t\there, huh huh, she touched my butt. Huh\r\n\t\t\thuh huh.",
      "Martha, her senses a bit dimmed from age, turns to B&B.",
      "MARTHA",
      "Hello there. Are you two heading for Las\r\n\t\t\tVegas?",
      "BEAVIS",
      "Yeah, we're gonna score.",
      "MARTHA",
      "I hope to score big there myself. I'm\r\n\t\t\tmostly going to be doing the slots.",
      "BEAVIS",
      "Yeah, I'm hoping to do some sluts too. \r\n\t\t\tHeh heh. Do they have lots of sluts in\r\n\t\t\tLas Vegas?",
      "MARTHA",
      "Oh, there are so many slots you won't\r\n\t\t\tknow where to begin.",
      "BEAVIS",
      "Whoa! heh heh. Hey Butt-Head, this chick\r\n\t\t\tis pretty cool. She says there's gonna be\r\n\t\t\ttons of sluts in Las Vegas! Heh heh heh.",
      "BUTT-HEAD",
      "Cool. Huh huh huh.",
      "MARTHA",
      "It's so nice to meet young men who are so\r\n\t\t\twell mannered.",
      "BEAVIS",
      "Yeah, heh heh. I'm gonna have money, and a\r\n\t\t\tbig-screen TV and sluts everywhere!",
      "MARTHA",
      "Oh, that's nice.",
      "CAPTAIN'S VOICE (V.O.)",
      "(through P.A.)\r\n\t\t\tGood morning. This is your captain\r\n\t\t\tspeaking. Welcome aboard flight 151\r\n\t\t\tnon-stop to Las Vegas. We ask that you\r\n\t\t\tturn your attention to the front of the\r\n\t\t\tcabin for pre-flight safety instructions.",
      "B&B see Doloris, stepping nearby to demonstrate the seat belt.",
      "ATTENDANT'S VOICE",
      "To fasten your seat belt, insert the free\r\n\t\t\tend into the coupling.",
      "BUTT-HEAD",
      "Insert. Huh huh huh.",
      "Doloris demonstrates. B&B are dumbfounded. It's too complicated.",
      "BUTT-HEAD (CONT.)",
      "Uh...",
      "They struggle to make their seat belts fit, getting each other's \r\n\tparts.",
      "TAMMY (O.C.)",
      "Hi, I'm Tammy? Can I help you with that?",
      "Butt-Head looks up.",
      "From his P.O.V. we see a beautiful woman, TAMMY, smiling, her \r\n\thands reaching down. FALLING IN LOVE/HARP MUSIC STING plays.",
      "CLOSE on Butt-Head's lap as two female hands reach down and pull \r\n\tone strap from between Butt-Head's legs.",
      "Butt-Head looks down at his lap as Tammy leans over him. A loud \r\n\tCLICKING can be heard. Butt-Head stares blankly.",
      "TAMMY (CONT.)",
      "There you go. You're all set.",
      "BUTT-HEAD",
      "(stunned)\r\n\t\t\tI love you.",
      "Suddenly Martha buckles Beavis' belt. Tammy goes.",
      "BEAVIS",
      "Wait, I wanted her to do it.",
      "BUTT-HEAD",
      "Huh huh. Soon, she will be mine.",
      "CAPTAIN'S VOICE",
      "Flight attendants, please prepare for\r\n\t\t\ttake-off.",
      "The engines start to hum. The plane is rolling.",
      "Butt-Head struggles to get his seat belt off. He does everything \r\n\tbut pull the handle. Beavis goes white with fear.",
      "The plane starts to shake. The engines rumble. Beavis starts to \r\n\tfreak.",
      "BEAVIS",
      "Hey wait a minute. What's going on?!",
      "Butt-Head bangs away at his seat belt. Beavis looks out the window \r\n\tand realizes they're in the air.",
      "BEAVIS (CONT.)",
      "(screams)\r\n\t\t\tAaaagh! We're gonna die!!!!!",
      "ANGLE ON COUPLE IN FRONT OF B&B:",
      "MAN",
      "D'ya hear that? Something must be wrong!",
      "WOMAN",
      "Oh my God!!!!!!!",
      "ANGLE ON CABIN, people start screaming. The plane quakes, lifting \r\n\tup.",
      "ON BUTT-HEAD, furiously pulling:",
      "BUTT-HEAD",
      "Dammit! Huh huh. That chick wants me.",
      "BEAVIS",
      "Aggghg! We're gonna die! We're all\r\n\t\t\tgonna die!",
      "The plane arcs upward. Butt-Head finally gets the belt off as the \r\n\tplane is in full thrust. He rises and goes tumbling backward down \r\n\tthe aisle.",
      "ON PEOPLE seeing Butt-Head flying, screaming in panic.",
      "In free fall:",
      "Butt-Head grabs the door to the hangable luggage. It all comes \r\n\ttearing out.",
      "Butt-Head flies up, hitting several overhead luggage racks, which \r\n\topen and spill their contents.",
      "Butt-Head lands in the galley, causing food to go flying and \r\n\tcoffee to pour freely.",
      "ON THE CABIN as the plane starts to level out. People stop their \r\n\tscreaming.",
      "ON BUTT-HEAD, underneath the rubble, poking his head out. He's \r\n\tdirectly across from the flight attendant station where Tammy is \r\n\tstrapped in.",
      "BUTT-HEAD",
      "Uh, huh huh... could you, like, do that\r\n\t\t\tthing with my belt again?",
      "INT.  PLANE - LATER",
      "All's in order. Flight attendants roll the beverage cart up the \r\n\taisle. People read, relaxed.",
      "ON BEAVIS AND MARTHA. Martha is showing pictures of her \r\n\tgrandchildren. Beavis is showing the picture of Dallas that Muddy \r\n\tgave him.",
      "BEAVIS",
      "I'm probably going to make out with her\r\n\t\t\tfirst before we, you know, get down...",
      "MARTHA",
      "You'll have to speak up son. I have this\r\n\t\t\tringing in my ears. My doctor says it\r\n\t\t\tcould be related to my heart\r\n\t\t\tpalpitations. I've had two operations on\r\n\t\t\tmy heart.",
      "BEAVIS",
      "Really? I poop too much.",
      "MARTHA",
      "Oh, maybe you're lactose intolerant.",
      "BEAVIS",
      "Uh... No, (louder) I poop too much. Then\r\n\t\t\tI get tired.",
      "MARTHA",
      "Well, if you find yourself getting tired,\r\n\t\t\ttake a couple of these.",
      "She hands him a box of NoDrowz.",
      "MARTHA (CONT.)",
      "They perk me right up.",
      "BEAVIS",
      "Heh heh, thanks.",
      "He pours the contents into his hand and chews them like candy. \r\n\tThen his eyes open wide.",
      "BEAVIS (CONT.)",
      "(strange)\r\n\t\t\tUh, tastes like crap. Heh heh. Mmmmm.",
      "Beavis starts wolfing them down.",
      "INT.  PLANE - A BIT LATER",
      "Tammy passes out meals from a rolling cart. She works with \r\n\tDoloris. Butt-head stands behind Tammy, attempting to hit on her.",
      "BUTT-HEAD",
      "(to Tammy)\r\n\t\t\tSo, uh huh huh, are you going to Las\r\n\t\t\tVegas? Huh huh huh.",
      "Tammy ignores him and moves on, leaving Butt-Head there.",
      "ANGLE ON BUTT-HEAD, looking down at something.",
      "PAN DOWN to reveal he's looking at a BEER on a fat guy's tray. The \r\n\tguy's asleep.",
      "Butt-head picks up the beer.",
      "ANGLE ON BEAVIS, nearby. The NoDrowz is starting to take effect. \r\n\tBeavis starts shaking, babbling, staring cross-eyed at his fist, \r\n\tetc. (pre-Cornholio stuff)",
      "Tammy reaches her next passenger.",
      "TAMMY",
      "Hi, we're serving dinner. Our selections\r\n\t\t\ttonight are chicken piccata or seafood\r\n\t\t\tgumbo...",
      "BEAVIS (O.S.)",
      "Piccata? Piccata! Picattatta tatta!",
      "Tammy moves forward, leaving Butt-Head standing there. In the \r\n\tbackground, we see Beavis starting to quake, on the verge of \r\n\tCornholio mode.",
      "PASSENGER",
      "Does the gumbo have corn in it?",
      "ANGLE ON BEAVIS: Turned, facing the cabin, T-shirt pulled over his \r\n\thead in full Cornholio mode.",
      "BEAVIS",
      "I am Cornholio! I need picatta for\r\n\t\t\tmy bunghole!",
      "TAMMY",
      "You'll have to wait your turn sir.",
      "BEAVIS",
      "Are you threatening me? My bunghole\r\n\t\t\twill not wait!",
      "Beavis starts to wander down the aisle.",
      "ANGLE ON CURTAIN TO FIRST CLASS CABIN. Beavis enters. From the \r\n\tother side, SOUND of screams. We hear several CALL BUTTONS being \r\n\tpressed.",
      "ON BUTT-HEAD. He approaches Tammy from behind. She ignores him.",
      "BUTT-HEAD",
      "Uh, I got a beer. Want some? Huh huh.",
      "ANGLE INSIDE THE COCKPIT.",
      "The PILOTS are relaxed and settled in when the door to the cockpit \r\n\tslams open. Beavis is in the doorway SCREAMING.",
      "BEAVIS",
      "Bargarajjjaaaahhh!!! I am Cornholio!!",
      "The pilots SCREAM. The copilot jumps up so fast he causes coffee \r\n\tto spill everywhere, including on the captain's lap. The captain \r\n\tthen jumps up, hitting the controls and SENDING THE PLANE INTO A",
      "NOSE-DIVE.",
      "ON BUTT-HEAD",
      "In the back of the plane standing next to Tammy. He starts to take \r\n\ta sip of beer. The nose-dive of the plane causes Butt-Head to go",
      "FLYING TOWARDS THE FRONT OF THE PLANE.",
      "BUTT-HEAD",
      "AAAAAHHH!!! Huh huh. AAAAHHH!!!",
      "Butt-Head bounces all overthe plane and then gets tangled up in \r\n\tthe curtain that separates first class and coach. It tears off, \r\n\tand he continues to fly forward.",
      "COCKPIT",
      "The captain is desperately trying to regain control of the plane.",
      "Butt-Head slams into the cockpit, landing on the control panel \r\n\tfacing the captain.",
      "CAPTAIN",
      "Get the hell out of the cockpit!",
      "BUTT-HEAD",
      "Huh huh, you said...",
      "CAPTAIN",
      "NOW!!!",
      "The captain throws Butt-Head back behind him and pulls the plane \r\n\tout of the dive.",
      "EXT.  LAS VEGAS AIRPORT - EARLY EVENING",
      "The plane lands.",
      "INT.  COCKPIT DOOR - EARLY EVENING",
      "The flight attendants, shaken, smile at a line of people \r\n\tdeplaning. The people are white with fear, some covered with \r\n\tflecks of spilled food and other matter.",
      "ATTENDANTS",
      "Bye-bye. Bye-bye. Bye-bye.",
      "They grow silent and still as B&B pass by. Beavis takes the T-\r\n\tshirt off his head, coming down from Cornholio.",
      "BUTT-HEAD",
      "Huh huh huh. That was cool.",
      "INT.  TERMINAL/ARRIVAL GATE - DAY",
      "Arriving passengers are greeted. A family is reunited. Two \r\n\tbusinessmen walk up to limo drivers holding cards with their \r\n\tnames. A reunited couple hugs.",
      "B&B look around in confusion.",
      "BUTT-HEAD",
      "Uh, huh huh, this is Las Vegas?",
      "BEAVIS",
      "Yeah, heh heh. I thought there'd be\r\n\t\t\tcasinos and lights and stuff.",
      "People greet and walk away. The place starts to clear out.",
      "One limo driver is left standing. He wears sunglasses and holds a \r\n\tsign that reads: Beavis and Butt-Head.",
      "B&B look around. Except for the driver, they're alone.",
      "BEAVIS (CONT.)",
      "Hey Butt-Head, why's that guy holding\r\n\t\t\ta sign?",
      "BUTT-HEAD",
      "Uh... maybe he's blind... Huh huh, check\r\n\t\t\tthis out.",
      "B&B go up to him. Butt-Head turns around, drops his pants and \r\n\thangs a \"B.A.\" at the guy.",
      "B&B",
      "Huh huh huh huh huh huh huh.",
      "DRIVER",
      "Ah, excuse me. You wouldn't know where\r\n\t\t\tI can find these guys, would ya?",
      "He indicates the sign. Butt-Head turns around and pulls up his \r\n\tpants. They look and try to read:",
      "BUTT-HEAD",
      "(reads)\r\n\t\t\tUh, B...A...U... No, uh, V...",
      "BEAVIS",
      "(reads)\r\n\t\t\tUh... Buuuuut. Boot. Someone named boot.",
      "BUTT-HEAD",
      "(realizes)\r\n\t\t\tHuh huh. This says Beavis.",
      "BEAVIS",
      "And Boot-Head.",
      "BUTT-HEAD",
      "That's Butt-Head. Don't you get it,\r\n\t\t\tBeavis. These dudes have the same name as\r\n\t\t\tus.",
      "BEAVIS",
      "Yeah, we should party.",
      "The limo driver rolls his eyes and walks away.",
      "DRIVER",
      "This way, sirs.",
      "B&B follow the driver away. Beavis looks around.",
      "BEAVIS",
      "So where's those guys?",
      "EXT.  MUDDY'S MOTEL ROOM - DAY",
      "HARLAN and ROSS, the two dumb-looking rough-necks that stole B&B's \r\n\tTV are standing outside Muddy's motel room. Harlan knocks on the \r\n\tdoor.",
      "ROSS",
      "Where the hell is he?",
      "HARLAN",
      "You sure this is the right place?",
      "Harlan looks through the window and sees the shattered TV. No \r\n\tone's there.",
      "Muddy's four-by-four SQUEALS into the lot and skids to a stop next \r\n\tto Harlan and Ross' van. Muddy gets out, looking really drunk now.",
      "HARLAN (CONT.)",
      "You Muddy?",
      "MUDDY",
      "(slurring)\r\n\t\t\tYou the cops?",
      "ROSS",
      "Uh, no. Earl sent us. You know, to take\r\n\t\t\tcare of your wife...",
      "Muddy grabs Ross by the collar.",
      "MUDDY",
      "What the hell?!... What about those other...",
      "ROSS",
      "Huh?",
      "Muddy tosses Ross to the sidewalk and starts back to they four-by-\r\n\tfour.",
      "MUDDY",
      "Dammit!!! She did it to me again!!!",
      "HARLAN",
      "Hey, I noticed your TV was broken. You\r\n\t\t\twanna buy a new one?",
      "Muddy gets in the four-by-four and starts it.",
      "MUDDY",
      "I'm gonna go to Vegas and kill all\r\n\t\t\tthree a' them!",
      "Harlan and Ross seem momentarily confused.",
      "Muddy revs the engine, peels out backwards HITTING THE FRONT OF \r\n\tTHE VAN. This causes B&B's TV and some other loot to spill out the \r\n\tback onto the sidewalk.",
      "Ross starts to pick it up.",
      "HARLAN",
      "Just leave it. Worthless piece o' crap.",
      "ROSS",
      "Yeah, really. We gotta start stealin'\r\n\t\t\tfrom rich people.",
      "EXT.  LAS VEGAS - DAY",
      "MONTAGE SONG BEGINS.",
      "Note: I would like this to be a well-known band (Red Hot \r\n\t\tChili Peppers) doing their best imitation of a modern Las \r\n\t\tVegas lounge act. I think a song like \"What Am I Gonna Do \r\n\t\tWith You\" by Barry White or something obnoxious like \r\n\t\t\"Bicostal\" by Peter Allan would be cool. Or maybe Sinatra's \r\n\t\t\"You Make Me Feel So Young\" would be best.",
      "The car passes by major hotels and tourist sights, finally pulling \r\n\tup to a big luxurious hotel and casino.",
      "INT.  HOTEL/CASINO - DAY",
      "Establishing shots. Excitement. Gambling tables going on forever.",
      "ON THE LOUNGE BAND playing the song we've been hearing. They \r\n\tshould vaguely resemble the actual band doing the song.",
      "PAN DOWN rows of slot machines.",
      "PAN ACROSS DEALERS handling cards and chips.",
      "DOLLY RIGHT UP TO B&B, staring in utter awe.",
      "REVERSE ANGLE REVEALS: They're staring at a huge Roman statue of a \r\n\tbare-chested woman.",
      "Their faces are blank. They're seeing God. Finally:",
      "BUTT-HEAD",
      "Beavis. This is what it's all about.",
      "BEAVIS",
      "(speechless)\r\n\t\t\tHeh heh. Yeah.",
      "EXT.  VEGAS - DUSK",
      "Lights are popping on.",
      "Billboards and signs are lighting up.",
      "The whole strip is coming alive. Pure excitement.",
      "INT.  HOTEL/CASINO - DUSK",
      "ON B&B, still staring at the statue.",
      "B&B",
      "(in awe)\r\n\t\t\tHuh huh huh huh huh.",
      "A security guard comes and drags B&B away.",
      "ON THE LOUNGE BAND, continuing the song we've been hearing.",
      "INT.  B&B'S HOTEL ROOM - NIGHT",
      "The door is opened by a bellboy.",
      "BELLBOY",
      "I'm so sorry about that little\r\n\t\t\tmisunderstanding. We didn't know you\r\n\t\t\twere registered guests. Here's some\r\n\t\t\tplaying chips compliments of...",
      "Beavis rushes in and grabs the remote which is attached to the \r\n\tnight table. He tries to pull it up and can't.",
      "BEAVIS",
      "This remote's too heavy!",
      "BELLBOY",
      "Sir, it's attached to the...",
      "BUTT-HEAD",
      "Here, dumbass! Let me try!",
      "They both struggle to pull it up. Finally, they fall over \r\n\tbackwards.",
      "Annoyed, the bellboy leaves.",
      "INT.  ELEVATOR BANK/9TH FLOOR - NIGHT",
      "The elevator arrives. B&B get on. There's several sophisticated \r\n\tpeople. From inside, a computerized FEMALE ELEVATOR VOICE:",
      "ELEVATOR VOICE",
      "Ninth floor, going down.",
      "B&B",
      "Huh huh huh huh huh huh.",
      "BUTT-HEAD",
      "Going down. Huh huh huh.",
      "The sophisticated people look repulsed. The doors close.",
      "INT.  HOTEL/CASINO - NIGHT",
      "MUSIC DIPS DOWN FOR DIALOGUE. B&B step off the elevator and walk \r\n\tamong the gambling tables.",
      "Beavis pulls one of the playing chips out of his pocket and bites \r\n\tinto it.",
      "BEAVIS",
      "Ow! These chips suck.",
      "BUTT-HEAD",
      "What a rip-off. Come on. We gotta find\r\n\t\t\tthat chick.",
      "Beavis tosses the chip on a roulette table.",
      "ANGLE ON THE WHEEL. The ball lands on 13.",
      "At the table, the DEALER...",
      "DEALER",
      "13. We have a winner. (to Beavis) Sir,\r\n\t\t\tyour chips?",
      "BEAVIS",
      "I don't want 'em! Keep 'em.",
      "DEALER",
      "Let it ride!",
      "BUTT-HEAD",
      "(to dealer)\r\n\t\t\tUh... could you help us find a chick?",
      "DEALER",
      "(uneasy)\r\n\t\t\tSir, the casino does not partake in that\r\n\t\t\tkind of activity.",
      "The wheel stops.",
      "DEALER (CONT.)",
      "(amazed)\r\n\t\t\t13! Winner!",
      "People oooh and aaah. More gather to watch.",
      "Through the gathering throng comes CHERYL, a hooker.",
      "CHERYL",
      "Excuse me, boys. Did I hear you say \r\n\t\t\tyou're looking for a date?",
      "B&B freeze, shocked.",
      "CHERYL (CONT.)",
      "I'm Cheryl, and I can show you a real\r\n\t\t\tfine time.",
      "B&B don't move. The dealer rolls again.",
      "CHERYL (CONT.)",
      "A time you'll remember for the rest of\r\n\t\t\tyour lives, if you know what I mean.",
      "DEALER",
      "(to Beavis)\r\n\t\t\tSir, do you want your chips?",
      "BEAVIS",
      "No, Dammit! I don't want any chips!",
      "DEALER",
      "Let it ride.",
      "Cheryl puts her hands on their thighs.",
      "CHERYL",
      "What say we three go up to your room, \r\n\t\t\ttake off our clothes and just see what\r\n\t\t\tcomes up.",
      "B&B's eyes open wide.",
      "BUTT-HEAD",
      "Huh huh huh huh huh huh.",
      "BEAVIS",
      "Uh... Uh...",
      "The wheel stops.",
      "DEALER",
      "14. No winners.",
      "CHERYL",
      "Hmmmm. Oh well.",
      "She leaves. People scatter. B&B are left alone. Staring.",
      "BUTT-HEAD",
      "Huh huh huh. That chick was talking\r\n\t\t\tabout doing it.",
      "BEAVIS",
      "Heh heh. This is the best night of our\r\n\t\t\tlives.",
      "WIDE SHOT. B&B just stand, laughing.",
      "MUSIC FADES BACK UP...",
      "INT.  HOTEL LOUNGE - NIGHT",
      "ANGLE ON THE BAND, continuing the song.",
      "Tourists watch from tables - decidedly not rocking out.",
      "B&B dance alone near the stage, doing the \"butt-knocker.\"",
      "INT.  HOTEL OFFICE - NIGHT",
      "A WOMAN ATTENDANT answers the phone.",
      "WOMAN ATTENDANT",
      "Good evening. Room service. How may\r\n\t\t\tI help you?",
      "From the phone...",
      "B&B",
      "(on phone)\r\n\t\t\tHuh huh huh huh huh.",
      "The woman's disturbed.",
      "WOMAN ATTENDANT",
      "Hello... Hello...",
      "INT.  HOTEL/CASINO - NIGHT",
      "B&B try to climb up and grab the gigantic boobs of the statue. \r\n\tButt-Head falls, knocks Beavis off and they both hit the floor \r\n\thard.",
      "INT.  B&B'S HOTEL ROOM - NIGHT",
      "Beavis is on the phone in the main room. Butt-Head sits on the \r\n\ttoilet and speaks from the phone in the bathroom.",
      "BUTT-HEAD",
      "Uh, huh huh, I'd like to be serviced...\r\n\t\t\tin my room.",
      "B&B",
      "Huh huh huh huh huh huh.",
      "INT.  HOTEL LOUNGE - NIGHT",
      "B&B keep dancing as the famous BAND plays the MONTAGE SONG which",
      "ENDS.",
      "EXT.  VEGAS - DAWN",
      "Sunrise.",
      "The song rings out.",
      "INT.  B&B'S ROOM - MORNING",
      "BEavis is picking up the night table by the remote attached to it \r\n\tand moving the whole thing.",
      "Butt-Head approaches a door next to the bed.",
      "BUTT-HEAD",
      "Uh, I wonder where this door goes to.",
      "Beavis comes over to check it out. Butt-Head opens the door. It's \r\n\tone of those double doors to the next room.",
      "Butt-Head tries to open the second door, jiggling it.",
      "Suddenly, the door opens. Someone reaches out and pulls B&B \r\n\tinside. It's DALLAS, the girl Muddy sent them after.",
      "INT.  DALLAS' SUITE/MAIN ROOM - CONTINUOUS",
      "She has them pinned against the wall. DALLAS is hot, clad in tight \r\n\tleather, tattooed, pierced, sexy.",
      "BEAVIS",
      "(excited)\r\n\t\t\tHey, Butt-Head, it's her! Heh heh.",
      "DALLAS",
      "All right, who are ya? C.I.A? F.B.I.?",
      "A.T.F.?",
      "BUTT-HEAD",
      "Uh... Hey baby. Are we like, doing it?",
      "BEAVIS",
      "Me first?",
      "DALLAS",
      "You got two seconds!",
      "BUTT-HEAD",
      "Uh, huh huh. Is that gonna be enough time?",
      "Dallas grabs Butt-Head by the shirt.",
      "DALLAS",
      "Who sent ya?",
      "BUTT-HEAD",
      "Uh, huh huh, this fat dude. He said we\r\n\t\t\tcould do you. And he was gonna pay us.",
      "DALLAS",
      "Muddy! Sonofabitch! Hold it. What's he\r\n\t\t\tpayin' ya?",
      "BUTT-HEAD",
      "Uh, ten uh...",
      "DALLAS",
      "Ten grand? That cheap-ass... I got a\r\n\t\t\tbetter deal for ya. I'll double it. I'll\r\n\t\t\tpay ya twenty if you go back there and do\r\n\t\t\tmah husband.",
      "BUTT-HEAD",
      "Uh, you want us to do a guy? Huh huh. No\r\n\t\t\tway.",
      "BEAVIS",
      "(considering it)\r\n\t\t\tUmm,... I don't know Butt-Head. That is\r\n\t\t\ta lot of money... Maybe if we close our\r\n\t\t\teyes and pretend he's a chick...",
      "Butt-Head SMACKS Beavis, bringing him to his senses.",
      "From outside, SOUND of a police siren. Dallas goes to the window. \r\n\tThe place is being surrounded by police and plain black cars.",
      "DALLAS",
      "(panics)\r\n\t\t\tDamn! You boys, you wait right there.",
      "Dallas goes into the next room and closes the door.",
      "B&B look at each other. They start to take their pants off.",
      "BUTT-HEAD",
      "Huh huh huh. I'm ready for love.",
      "BEAVIS",
      "Me first! Me first!",
      "INT.  DALLAS' SUITE/OTHER ROOM - DAY",
      "Dallas gets binoculars from her bag and scouts outside.",
      "Her P.O.V. REVEALS dozens of police and A.T.F. cars. The hotel's \r\n\tsurrounded.",
      "As Dallas looks around, she spots a tour bus across the street. On \r\n\tthe side: \"Dream America Tours.\" Dallas quickly dials the phone.",
      "DALLAS",
      "(to phone)\r\n\t\t\tGimme the number for Dream America Tours.\r\n\t\t\t(pause) Right.",
      "Dallas dials again, crossing to the door to peek out at B&B - both \r\n\tstanding in their underwear, waiting. Beavis picks his nose. \r\n\tDallas closes the door again.",
      "DALLAS (CONT.)",
      "(to phone)\r\n\t\t\tYeah, you got a bus leaving today? (pause)\r\n\t\t\tFive minutes? Where's it goin'? (listens)\r\n\t\t\tWashington, D.C.? (mulls it over) Perfect.\r\n\t\t\t(a look back to the other room) Gimme two\r\n\t\t\ttickets.",
      "INT.  DALLAS' SUITE/MAIN ROOM - DAY",
      "B&B are in their underwear. Butt-Head sits at the edge of the bed. \r\n\tBeavis tries to pull the remote off the table.",
      "Dallas enters, sees this sight, and shuts off the TV. She looms \r\n\tover Butt-Head.",
      "BUTT-HEAD",
      "So, uh, huh huh. Are we gonna score now?",
      "BEAVIS",
      "Me first!",
      "BUTT-HEAD",
      "Forget it, bunghole!",
      "B&B start to wrestle. Dallas sees Beavis' pants.",
      "DALLAS",
      "(realizing)\r\n\t\t\tScore? You boys wanna...?",
      "Butt-Head grabs Beavis' neck.",
      "BEAVIS",
      "Ow, let go, Butt-Head!",
      "BUTT-HEAD",
      "Huh huh huh.",
      "She picks up the pants, getting an idea.",
      "DALLAS",
      "You wait here.",
      "She takes the pants into the next room. B&B keep wrestling.",
      "BEAVIS",
      "Me first.",
      "BUTT-HEAD",
      "Huh huh. No way, dude.",
      "INT.  DALLAS' SUITE/OTHER ROOM - DAY",
      "TIGHT ON her black satchel. From it she lifts a delicate \r\n\telectronic device, the X-5 unit, about the size of a credit card. \r\n\tAn LED light blinks.",
      "Using her switchbalde, she cuts a hole in the back seam of Beavis' \r\n\tpants, creating a natural pocket. She carefully slides the unit \r\n\tin.",
      "INT.  DALLAS' SUITE/MAIN ROOM - DAY",
      "B&B's fight escalates. Butt-Head picks up a LAMP and throws it at \r\n\tBeavis. It hits the wall and SHATTERS. Beavis charges Butt-Head.",
      "INT.  DALLAS' SUITE/OTHER ROOM - DAY",
      "Dallas is licking a piece of thread. She quickly and expertly \r\n\tthreads a needle and then starts to sew the electronic device into \r\n\tthe inside back of Beavis' pants. She suddenly wrinkles her nose \r\n\tas if she has smelled something.",
      "She holds the pants up to the light. Inside, the shadow of the \r\n\tunit.",
      "INT.  DALLAS' SUITE/MAIN ROOM - DAY",
      "B&B fight wildly. Dallas enters and clears her throat. B&B freeze.",
      "FULL ON DALLAS, posed sexily, seductive.",
      "DALLAS",
      "Don't wear yourselves out, boys. Save\r\n\t\t\tsome energy for me.",
      "B&B",
      "Huh huh huh huh huh huh.",
      "BUTT-HEAD",
      "This is it, Beavis. Huh huh. We're \r\n\t\t\tfinally gonna score.",
      "BEAVIS",
      "Heh heh. Thank God.",
      "DALLAS",
      "I'm gonna do it with both of ya.",
      "B&B",
      "(uncontrollable)\r\n\t\t\tHuh huh huh huh huh huh huh huh huh huh\r\n\t\t\thuh huh huh huh huh.",
      "Dallas clears her throat to get their attention. And again.",
      "DALLAS",
      "(sexy) Boys... (shouts) Boys!!!",
      "Silence.",
      "DALLAS (CONT.)",
      "But first, you hafta do a little job for\r\n\t\t\tme. (touches seductively) Would you like\r\n\t\t\tto do a job for me?",
      "Silence. They're in shock.",
      "DALLAS (CONT.)",
      "Here's what it is. I want ya to take a bus\r\n\t\t\tta Washington, D.C. That's all. And when\r\n\t\t\tya get there, I'll be waitin'. You're\r\n\t\t\tgonna make a whole lotta money. (In their\r\n\t\t\tfaces) And I'm gonaa give you everything!",
      "B&B",
      "(near comatose)\r\n\t\t\tHuh huh huh huh huh huh huh.",
      "DALLAS",
      "Until then... (tosses Beavis' pants in his\r\n\t\t\tface) Keep your pants on.",
      "She looks back to the window, now all business.",
      "DALLAS (CONT.)",
      "OK guys, time to move out.",
      "INT.  HOTEL LOBBY/FRONT DOOR - DAY",
      "A.T.F. agents enter and spread out. We see several agents go up \r\n\tthe stairs.",
      "INT.  DALLAS' ROOM/DOORWAY - DAY",
      "DALLAS",
      "Remember, Washington, D.C. You'll get\r\n\t\t\tmore money than you ever dreamed of. And\r\n\t\t\tyou'll get me.",
      "She kisses them both seductively.",
      "DALLAS (CONT.)",
      "(urgent)\r\n\t\t\tYour bus is downstairs. Get going.",
      "She shuts the door, leaving B&B outside. Nearby, a maid with her \r\n\tcart passes by.",
      "B&B stare, frozen for a beat, then go running for the elevator.",
      "ANGLE AROUND THE CORNER, out of B&B's view. Just as the elevator \r\n\tdoors shut, dozens of federal agents with guns rush in and kick \r\n\topen Dallas' door.",
      "EXT.  HOTEL/CASINO - DAY",
      "More Feds and police enter.",
      "ANGLE ON B&B, walking past, oblivious to all else. As he walks \r\n\taway, Beavis rubs his butt.",
      "B&B",
      "Huh huh huh huh huh.",
      "BUTT-HEAD",
      "This is gonna be cool. Huh huh.",
      "They walk to the tour bus across the street.",
      "INT.  TOUR BUS - DAY",
      "B&B walk down the aisle, Beavis rubbing his butt. Most seats are \r\n\ttaken by senior citizens.",
      "Up ahead, two vacant seats. B&B fight to get in first.",
      "BUTT-HEAD",
      "No way butt-hole! I want the window.",
      "BEAVIS",
      "Cut it out butt-hole!",
      "A VOICE",
      "Why don't you take turns?",
      "They turn. It's Martha, the woman from the plane, sitting across \r\n\tthe aisle.",
      "BEAVIS",
      "Hey, Butt-Head, it's that slut from the\r\n\t\t\tplane!",
      "MARTHA",
      "Why it's you two. How'd ya do in Vegas?",
      "BEAVIS",
      "Uh, we didn't score yet.",
      "MARTHA",
      "Sorry to hear that. Me, I took a beating.",
      "BUTT-HEAD",
      "Cool, huh huh huh.",
      "MARTHA",
      "That's why I'm bussing it across America.\r\n\t\t\tI'm so glad you're here. (to man in next\r\n\t\t\tseat) Jim, I want you to meet two nice\r\n\t\t\tboys.",
      "JIM, an old guy, wakes up and looks over.",
      "MARTHA (CONT.)",
      "This is Travis and Bob... What's your\r\n\t\t\tlast name, dear?",
      "BUTT-HEAD",
      "Uh... Head? huh huh. My first name's\r\n\t\t\tButt. Huh huh huh.",
      "JIM",
      "Pleased to meet ya, Mr. Head.",
      "All the seniors turn around to meet them.",
      "MARTHA",
      "Meet Sylvia. And Elloise and Sam. And Ed.\r\n\t\t\tAnd Doreen.",
      "BUTT-HEAD",
      "Are you guys sluts too? Huh huh huh.",
      "EXT.  TOUR BUS - DAY",
      "It takes off.",
      "We PAN back to the hotel as Muddy arrives in a cab.",
      "INT.  HALLWAY OUTSIDE DALLAS' ROOM - DAY",
      "DRAMATIC REVEAL of AGENT RYAN FLEMMING entering the hallway. He's \r\n\tan A.T.F. honcho, powerful, hard-ass. Looks like an Oliver North-\r\n\ttype. Sounds something like Fred Thompson. He walks with his \r\n\tassistant, AGENT BORK and another agent.",
      "They find Dallas' room and enter.",
      "INT.  DALLAS' HOTEL ROOM - DAY",
      "Dallas sits calmly, confident, as agents tear apart the room.",
      "FLEMMING",
      "So, are you going to tell us where it is\r\n\t\t\tor am I going to have to have Agent Hurley\r\n\t\t\tover there give you another cavity search?",
      "ANGLE ON AGENT HURLEY, a tough, stocky woman.",
      "DALLAS",
      "Ooh is that a promise?",
      "FLEMMING",
      "Look Mrs. Scum, we know who you are. Tell\r\n\t\t\ther Bork.",
      "BORK",
      "Dallas Grimes. Married to Muddy Grimes.\r\n\t\t\tYou run a mom and pop arms smuggling ring.",
      "He tosses her some photos of her and Muddy.",
      "DALLAS",
      "Oh, you got my bad side.",
      "Bork hands Flemming another file. Flemming checks it.",
      "FLEMMING",
      "Three days ago you pulled a job at the\r\n\t\t\tArmy Research Facility in Hadley, Nevada -\r\n\t\t\twhere you stole... (reads) The X-5 unit.\r\n\t\t\tNow we happen to know you had the unit\r\n\t\t\twith you when you checked in here, so why\r\n\t\t\tdon't you be a good girl and tell us where\r\n\t\t\tit is.",
      "DALLAS",
      "You gonna charge me with anything? (pause)\r\n\t\t\tI didn't think so. You wanna let me go now\r\n\t\t\tor wait 'till my lawyer files a wrongful\r\n\t\t\tarrest.",
      "BORK",
      "(aside to Flemming)\r\n\t\t\tWe got nothing, Chief. We tore the place\r\n\t\t\tapart. We can only legally hold her for\r\n\t\t\tanother couple of hours.",
      "FLEMMING",
      "(aside to Bork)\r\n\t\t\tDammit! (slams fist down) Where's that\r\n\t\t\tdamn unit??!!",
      "EXT.  HOOVER DAM - DAY",
      "The bus parks.",
      "INT.  TOUR BUS - DAY",
      "B&B are excited.",
      "BEAVIS",
      "Heh heh. We're in Washington!",
      "BUTT-HEAD",
      "Huh huh. We're gonna score now.",
      "MARTHA",
      "Actually, we're at the Hoover Dam.",
      "Martha walks on down the aisle.",
      "BUTT-HEAD",
      "Damn, huh huh.",
      "BEAVIS",
      "Yeah, heh heh. Damn right!",
      "They follow the seniors out of the bus. Beavis rubs his butt.",
      "EXT.  THE ROAD - DAY",
      "Dallas drives by in a slick car.",
      "INT.  DALLAS' CAR - DAY",
      "She adjusts her rearview mirror to observe a Fed car following \r\n\ther. She smiles.",
      "INT.  HOOVER DAM - DAY",
      "B&B and the seniors are on a tour through the giant basement. B&B \r\n\ttalk and approach the HOOVER GUIDE, speaking nearby.",
      "BEAVIS",
      "So, like, where is she?",
      "BUTT-HEAD",
      "(looks around)\r\n\t\t\tYeah, really.",
      "HOOVER GUIDE",
      "Over 40 thousand cubic tons of concrete\r\n\t\t\twere used in the construction of the\r\n\t\t\tHoover Dam.",
      "B&B",
      "Huh huh huh huh huh huh.",
      "HOOVER GUIDE",
      "From top to bottom, this dam is 51\r\n\t\t\tstories.",
      "BEAVIS",
      "Uh, huh huh, excuse me. Is this a God\r\n\t\t\tDamn?",
      "B&B",
      "Huh huh huh huh huh.",
      "They follow the tour into the next room.",
      "INT.  HOOVER DAM/OBSERVATION ROOM - DUSK",
      "A glass wall separates this from the master control room. There, \r\n\ttwo technicians are on watch. Banks of monitors show the water and \r\n\tpipes from various angles.",
      "B&B are the last in. Beavis rubs his aching butt. The guide is \r\n\talready speaking.",
      "HOOVER GUIDE",
      "... Generates over 6000 gigawatts of\r\n\t\t\telectricity, all passing through this\r\n\t\t\tcontrol room. This way.",
      "The tour moves on.",
      "BUTT-HEAD",
      "This is dumb, let's find that chick.",
      "BEAVIS",
      "Yeah, heh heh, enough'a this crap.",
      "They walk back from where they came.",
      "Through the glass wall, we see the two control room technicians \r\n\theading out.",
      "BEAVIS (CONT.)",
      "Check it out Butt-Head, TV!",
      "BUTT-HEAD",
      "Cool! Huh huh huh.",
      "INT.  HOOVER DAM/HALL OUTSIDE CONTROL ROOM DOOR - DUSK",
      "SOUND of air compression as this secure door opens. The two \r\n\ttechnicians walk out.",
      "They walk away, not seeing that behind them, B&B approach the \r\n\tcontrol room door. They enter just before the door closes. SOUND \r\n\tof air compression locks.",
      "INT.  A.T.F. HEADQUARTERS/FLEMMING'S OFFICE - DUSK",
      "Agent Bork knocks and enters.",
      "FLEMMING",
      "Talk ta me, Bork.",
      "BORK",
      "Chief, we found a witness that says he saw\r\n\t\t\ttwo teenagers leaving Dallas' room shortly\r\n\t\t\tbefore we arrived.",
      "FLEMMING",
      "Did you give him a full cavity search?",
      "BORK",
      "(confused)\r\n\t\t\tAh, the witness?",
      "FLEMMING",
      "Yes. You can never be too careful Bork.",
      "BORK",
      "Well sir, I didn't really think it was\r\n\t\t\tnecessary. You see we have a picture of\r\n\t\t\tthem from the elevator security cam. Here,\r\n\t\t\thave a look.",
      "TIGHT ON PICTURE. A still of B&B laughing on the elevator.",
      "BORK (CONT.)",
      "They look like a couple of kids chief.",
      "FLEMMING",
      "Bork, don't you realize what kids today\r\n\t\t\tare capable of? Don't you read the papers?",
      "Suddenly the lights blink on and off. All three men look up.",
      "INT.  HOOVER DAM/CONTROL ROOM - DUSK",
      "We see a bank of TV monitors, video of water, turbines, etc. \r\n\tBeavis is rubbing his butt against a switch on the console, \r\n\tcausing the lights to blink on and off.",
      "BUTT-HEAD",
      "Beavis, huh huh, what'er you doing?",
      "BEAVIS",
      "My butt's bothering me!",
      "BUTT-HEAD",
      "You should kick your butt's ass. Huh huh\r\n\t\t\thuh.",
      "Butt-Head looks at the bank of monitors - all showing water.",
      "BUTT-HEAD (CONT.)",
      "Dammit, all they have is shows about\r\n\t\t\twater.",
      "BEAVIS",
      "That sucks. Heh heh. They need some shows\r\n\t\t\tabout fire! Change the channel.",
      "BUTT-HEAD",
      "Uh...",
      "Butt-Head starts randomly hitting controls everywhere while Beavis \r\n\trubs his butt against a computer keypad.",
      "TIGHT ON CONTROL:  \"Main Water Release Valve\". Butt-Head turns it. \r\n\tAn alarm sounds.",
      "BEAVIS",
      "Yeah, turn it up! Louder! Heh heh.",
      "INT.  DAM DOORS - DUSK",
      "An alarm sounds. Giant doors open, causing water to start to flood \r\n\tthrough the gates.",
      "INT.  HOOVER DAM/CONTROL ROOM - DUSK",
      "Butt-Head presses more buttons. His hand is near the biggest \r\n\tswitch for: \"Master Station Control\".",
      "BUTT-HEAD",
      "(reads sign)\r\n\t\t\tUh... Mas... Ter... Huh huh. Masturbation,\r\n\t\t\thuh huh.",
      "Butt-Head throws the switch. Lights go out. SOUND of generators \r\n\tgrinding to a halt.",
      "INT.  HOOVER DAM/MACHINE ROOM - DUSK",
      "Machinery stops suddenly and large support beams break. A \r\n\tdisaster.",
      "INT.  HOOVER DAM/CONTROL ROOM - DUSK",
      "SOUND of twisted, grinding metal, loud alarms.",
      "BUTT-HEAD",
      "Uh...",
      "ON ONE OF THE MONITORS, we see a small electrical fire.",
      "BEAVIS",
      "Yeah, fire! Fire! FIRE!!!",
      "EXT.  HOOVER DAM - DUSK",
      "The lights go out.",
      "EXT.  VEGAS STRIP - DUSK",
      "In succession, one set of lights after another goes out. The \r\n\tfamous strip goes dark.",
      "INT.  A.T.F. HEADQUARTERS/FLEMMING'S OFFICE - DUSK",
      "The lights go dead.",
      "FLEMMING",
      "The hell's going on?",
      "INT.  HOSPITAL OPERATING ROOM/VEGAS - DUSK",
      "A surgeon just makes an incision as the lights go out.",
      "SURGEON",
      "Whoooooops.",
      "EXT.  CAMPGROUND - DUSK",
      "Marcy Anderson hammers the last peg in for their tent. Tom checks \r\n\tthe stew on the fire and looks around.",
      "TOM",
      "I'll tell ya, it doesn't get any better\r\n\t\t\tthan this. This here is God's country.\r\n\t\t\tUnspoiled and...",
      "A rumbling interrupts him. He and Marcy turn to see:",
      "A wall of water, heading for them.",
      "TOM (CONT.)",
      "Aaaaghhh!!!...",
      "They're smashed by the flood.",
      "EXT.  HOOVER DAM - DUSK",
      "Mass chaos. Traffic jams. Honking horns. People shouting.",
      "ANGLE ON B&B AND THE SENIORS, about to get on the bus.",
      "BUTT-HEAD",
      "That was boring. Huh huh.",
      "BEAVIS",
      "Yeah, it's just the same thing over and\r\n\t\t\tover again.",
      "BUTT-HEAD",
      "Uh... We can't leave Washington 'till we\r\n\t\t\tfind that chick.",
      "MARTHA",
      "Oh, we're a long ways from Washington Bob.\r\n\t\t\tThis is the Hoover Dam.",
      "Martha gets on the bus. HOLD ON B&B.",
      "BEAVIS",
      "Damn! Heh heh hmm heh.",
      "They get on the bus.",
      "INT.  VEGAS HOTEL/CASINO - DUSK",
      "Mayhem. People scream in the dark. Some steal chips and run.",
      "ANGLE TO SIDE, where Muddy has the Concierge by the neck.",
      "CONCIERGE",
      "I swear, that's all I know! They got on\r\n\t\t\tthat tour bus. It was probably heading \r\n\t\t\twest. Please...",
      "Muddy slams him against the wall and walks away.",
      "MUDDY",
      "I'm gonna kill 'em!",
      "EXT.  HOOVER DAM - DUSK",
      "The doors close on the tour bus. It pulls out and drives away.",
      "EXT.  SIDE OF ROAD - DUSK",
      "At her car, Dallas watches the bus from a distance, then lays down \r\n\ther binoculars, satisfied.",
      "DALLAS",
      "You boys better show up.",
      "With a look at the Fed car behind her, she gets in her car and \r\n\tdrives down a different road.",
      "EXT.  ROAD - DUSK",
      "The bus heads off into the desert.",
      "DISSOLVE TO:",
      "EXT.  HOOVER DAM - MORNING",
      "Police cars everywhere. Fire engines. Reporters. News helicopters. \r\n\tDisaster.",
      "Several A.T.F. cars pull up. Flemming and several of his agents \r\n\tget out and head immediately for the dam.",
      "INT.  HOOVER DAM/CONFERENCE ROOM - MORNING",
      "TIGHT ON A TV MONITOR. It shows B&B at the Hoover Dam controls the \r\n\teve before, shot on surveillance camera. Frame freezes. B&B \r\n\tlooking particularly stupid.",
      "REVEAL Flemming's there with his agents. Flemming leans forward.",
      "FLEMMING",
      "You see what I see, Bork?",
      "BORK",
      "I see it. I don't get it.",
      "FLEMMING",
      "You got half the state looking for ya -\r\n\t\t\thow do you get away?",
      "BORK",
      "(realizes)\r\n\t\t\tCut the power!",
      "FLEMMING",
      "Damn right. Bork, we're dealing with real\r\n\t\t\tpros here. My opinion, terrorists...\r\n\t\t\tWhat's the scoop on that stolen unit?",
      "BORK",
      "Well, sir it's not good. (to an assistant)\r\n\t\t\tRoll the tape... The X-5 unit is a new\r\n\t\t\ttop-secret biological weapon, a manmade\r\n\t\t\tvirus...",
      "ON MONITOR. The device that was put in back of Beavis' pants.",
      "BORK (CONT.)",
      "The deadliest known to man. It could wipe\r\n\t\t\tout five states in five days. It can be\r\n\t\t\tactivated by simply entering the right\r\n\t\t\tcode. Here's what happened when it was\r\n\t\t\ttested on a group of Army recruits...",
      "ON THE MONITOR. Army recruits coughing up black gunk, rolling \r\n\taround in pain on stretchers, dying. Grotesque (but funny).",
      "FLEMMING",
      "Jesus Jumped-Up Christ! If this were to\r\n\t\t\tfall into the wrong hands...",
      "BORK",
      "It gets worse. The unit wasn't finished.\r\n\t\t\tIt has a flaw - the casing. If hit hard\r\n\t\t\tenough, it could break open, releasing the\r\n\t\t\tvirus.",
      "A murmuring through the room. Flemming rises and holds up a \r\n\tpicture of B&B.",
      "FLEMMING",
      "Okay People, as of right now these are the\r\n\t\t\tmost dangerous men in America. I want\r\n\t\t\tthese faces in front of every Fed and two-\r\n\t\t\tbit sheriff within a thousand miles. The\r\n\t\t\torders are dead or alive. Let's just pray\r\n\t\t\tthat nothing hits that unit.",
      "INT.  TOUR BUS - DAY",
      "TIGHT ON Beavis' butt, as Butt-head KICKS IT REPEATEDLY.",
      "BEAVIS",
      "Ow! Cut it out Butt-Head.",
      "BUTT-HEAD",
      "Huh huh. Get out of the way, Beavis, I\r\n\t\t\twanna sit by the window. Huh huh.",
      "BEAVIS",
      "Ow! I'll kick your butt!",
      "BUTT-HEAD",
      "Huh huh. You mean like this?",
      "Butt-Head keeps kicking.",
      "ANGLE ON THE DRIVER UP FRONT.",
      "DRIVER",
      "Okay, people, next stop, Grand Canyon.",
      "He guns it.",
      "EXT.  TOUR BUS - DAY",
      "It takes off down the road.",
      "MONTAGE SONG BEGINS. (Maybe White Zombie doing something like, \r\n\t\"Born to Be Wild\")",
      "INSERT: A RED LINE snakes across a map to Grand Canyon.",
      "EXT.  GRAND CANYON - DAY",
      "Gorgeous. Our seniors and others take pictures and stare in awe. \r\n\tSome hold hands. One crosses herself.",
      "ANGLE ON B&B, nearby, also staring in awe. REVEAL they're watching \r\n\ta jackass take a dump.",
      "B&B",
      "Huh huh huh huh huh.",
      "BEAVIS",
      "The poop's coming out of the ass of the\r\n\t\t\tass. Heh heh heh.",
      "BUTT-HEAD",
      "Huh huh. It's coming out of the ass, but\r\n\t\t\tit's also coming out of the ass of the\r\n\t\t\tass.",
      "INT.  A.T.F. HEADQUARTERS - DAY",
      "TIGHT ON PHOTO OF B&B, going out on the wire.",
      "INT.  A POLICE STATION - DAY",
      "TIGHT ON COP getting the photo off a machine.",
      "INT.  A POST OFFICE - DAY",
      "TIGHT ON B&B's PHOTO as it's pinned to the wall.",
      "INT.  DRIVING TOUR BUS - DAY",
      "PAN across seniors showing off pictures of their grandchildren.",
      "Pan stops on B&B showing off the picture of Dallas to a senior. \r\n\tButt-Head does the \"finger-in-hole\" fornication gesture as they \r\n\tLAUGH suggestively.",
      "EXT.  SIDE OF ROAD - DAY",
      "Flemming reads a map strewn on his hood. He turns to Bork to give \r\n\torders. Bork repeats them into his radio. Several cars pull out.",
      "INSERT: A RED LINE snakes across a map to Utah.",
      "EXT.  SALT LAKE CITY - DAY",
      "Martha and the seniors pose in front of a classic Salt Lake City \r\n\tview. A sign nearby reads \"Welcome to Salt Lake City.\"",
      "REVERSE ANGLE shows B&B, taking their picture.",
      "P.O.V. OF CAMERA shows Butt-Head's hand covering half the lens. \r\n\tFraming is crooked and way off. Click and FREEZE.",
      "EXT.  SIDE OF HIGHWAY - DAY",
      "Middle of nowhere. Confused, Martha is taking a picture.",
      "REVERSE ANGLE shows B&B, posing by the road sign: Baggs, Wyoming.",
      "B&B",
      "Huh huh huh huh huh huh.",
      "P.O.V. OF CAMERA, showing B&B laughing.",
      "INSERT: A RED LINE snakes across the map to Wyoming.",
      "CROSS-DISSOLVE BETWEEN THE BUS AND THE SIGHTS IT PASSES:",
      "EXT.  FLAMING GORGE, WYOMING - DAY",
      "A classic view of a powerful gorge.",
      "REVERSE SHOWS THE TOUR BUS driving by. Martha and the seniors rush \r\n\tto the windows to stare in awe.",
      "EXT.  GRAND TETON, WYOMING - DAY",
      "A classic view of the huge peaks.",
      "REVERSE SHOWS THE TOUR BUS driving by. More seniors rush to the \r\n\twindows to see.",
      "EXT.  YELLOWSTONE PARK, WYOMING - DAY",
      "A spectacular view of Yellowstone Lake and the Rockies.",
      "REVERSE SHOWS THE TOUR BUS. Seniors staring in awe.",
      "PAN over to another window. B&B press their BARE ASSES against the \r\n\twindow.",
      "EXT.  YELLOWSTONE/OLD FAITHFUL - DAY",
      "MONTAGE SONG ENDS.",
      "A RANGER/GUIDE stands in front of the seniors talking about the \r\n\tgeyser. B&B are towards the front, off to one side.",
      "RANGER",
      "(a la Carl Sagan)\r\n\t\t\tThere are over two hundred active geysers\r\n\t\t\tin Yellowstone Park alone. Old Faithful\r\n\t\t\there is one of the largest. During an \r\n\t\t\teruption the water can reach as high as\r\n\t\t\ttwo hundred feet!...",
      "BUTT-HEAD",
      "So?",
      "RANGER",
      "(ignoring Butt-Head)\r\n\t\t\tIt shoots out over twelve thousand gallons\r\n\t\t\tof water in a single eruption...",
      "BEAVIS",
      "That's not that much.",
      "BUTT-HEAD",
      "Yeah really. Let's get outta here Beavis.\r\n\t\t\tHuh huh huh. This sucks.",
      "B&B walk off as the flustered ranger leads the seniors to some \r\n\tbenches where they wait for the geyser to erupt.",
      "EXT.  YELLOWSTONE/OLD FAITHFUL - LATER",
      "The geyser erupts. The seniors watch in sheer awe.",
      "MARTHA",
      "It's...incredible...!",
      "INT.  VISITOR CENTER/MEN'S BATHROOM - DAY",
      "B&B stare ahead in similar awe.",
      "BUTT-HEAD",
      "It's incredible!... Huh huh huh.",
      "REVEAL they're standing before the urinals. Butt-Head moves to the \r\n\tside, tripping a motion detector which makes the urinal",
      "AUTOMATICALLY FLUSH.",
      "BEAVIS",
      "Whoa! That's amazing! Heh heh heh.",
      "They start moving from urinal to urinal, causing all to flush.",
      "EXT.  OLD FAITHFUL/PARKING AREA - DAY",
      "The bus idles. The last senior climbs aboard.",
      "The driver looks around impatiently. He checks his watch.",
      "DRIVER",
      "I can't wait forever.",
      "INT.  OLD FAITHFUL/RANGER'S OFFICE - DAY",
      "The ranger/guide enters and checks off a chart on a bulletin board \r\n\tnear B&B's \"wanted\" photo.",
      "Suddenly the guide sees B&B's photo, then, out the window, the bus \r\n\tclosing its door and pulling away.",
      "RANGER",
      "Oh my God!",
      "The guide picks up the phone.",
      "INT.  VISITOR CENTER/MEN'S ROOM - DAY",
      "B&B go back and forth, \"playing\" the urinals, passing hands, \r\n\theads, whole bodies in front of the motion detectors.",
      "B&B",
      "Huh huh huh huh.",
      "Finally, Butt-Head pauses.",
      "BUTT-HEAD",
      "This is the coolest thing I have ever\r\n\t\t\tseen.",
      "EXT.  SIDE OF A ROAD - DAY",
      "Flemming is on the radio. Bork runs up.",
      "BORK",
      "Chief, we got 'em! They're on a senior\r\n\t\t\tcitizens tour bus going east on I-40.",
      "EXT.  OLD FAITHFUL/PARKING LOT - DAY",
      "B&B get on a bus that looks completely different than the tour \r\n\tbus.",
      "INT.  DIFFERENT BUS - DAY",
      "TIGHT ON B&B. Butt-Head looks around.",
      "BUTT-HEAD",
      "Uh... Is this the right bus?",
      "BEAVIS",
      "You mean there's mre than one?",
      "A WIDER SHOT REVEALS it's a bus full of nuns. B&B look around and \r\n\tsee this.",
      "BUTT-HEAD",
      "Huh huh huh. Hey Beavis. We're on a bus\r\n\t\t\twith chicks.",
      "BEAVIS",
      "Heh hmm heh heh.",
      "Butt-Head turns to the nun next to him.",
      "BUTT-HEAD",
      "Hey, baby.",
      "The nun looks disturbed as the bus takes off.",
      "EXT.  I-40/SIDE OF THE ROAD - DAY",
      "The tour bus is stopped. Like P.O.W.'s, the seniors stand with \r\n\thands on heads. Agents search the bus.",
      "ANGLE ON LINE OF SENIORS. Flemming walks nearby and is told:",
      "BORK",
      "They're not on the bus.",
      "Flemming looks the seniors over.",
      "FLEMMING",
      "(re: seniors)\r\n\t\t\tThese people know something. I want full\r\n\t\t\tcavity searches. Everyone. Go deep on 'em.",
      "Hurley and two agents grab the nearest senior and drag him away.",
      "FLEMMING (CONT.)",
      "I tell you Bork, these guys are smart.\r\n\t\t\tDamn smart. They're probably a hundred\r\n\t\t\tmiles away by now.",
      "Behind Flemming, an agent waves on traffic including B&B's new \r\n\tbus. As it pulls past, B&B hang B.A.'s. Flemming doesn't see.",
      "MONTAGE SONG BEGINS:",
      "INSERT: A RED LINE snakes through a map, pretty much retracing the \r\n\troute B&B took north. Down into Utah.",
      "INT.  BUS - DAY",
      "A nun strums a guitar and sings. Butt-head head-bangs. The nuns \r\n\taround look uneasy.",
      "Nearby another nun reads the Bible to Beavis.",
      "BEAVIS",
      "Hey, Butt-Head, this book kicks ass!\r\n\t\t\tThere's this talking snake and a naked\r\n\t\t\tchick and then this dude puts a leaf\r\n\t\t\ton his schlong! Heh heh heh.",
      "The nun next to Beavis is disgusted.",
      "INSERT: A RED LINE snakes down through Colorado.",
      "One of the nuns is trying to teach B&B the sign of the cross.",
      "Butt-head moves his hand down, up, left and then swings his hand \r\n\tto the far right SMACKING Beavis.",
      "INT.  ROADSIDE RESTAURANT - DAY",
      "Sitting before a long table, the nuns close their eyes and pray, \r\n\thands clasped together.",
      "PAN THE ROW to B&B who's hands are clasped together and \r\n\tinterlocked as they do the incredibly juvenile 'peek at the \r\n\tvagina' trick.",
      "B&B",
      "Huh huh huh huh huh huh.",
      "INSERT: A RED LINE snakes through a map to Rancho Taos, New \r\n\tMexico.",
      "EXT.  MISSION OF ST. FRANCIS OF ASSISI CHURCH - DAY",
      "A beautiful old adobe-style church. Nuns exit the bus, excited, \r\n\tfollowed by B&B who look around.",
      "The nuns walk into a visitor center. B&B walk right into the \r\n\tchurch.",
      "INT.  CHURCH - DAY",
      "In a WIDE SHOT we see B&B walk in, look around and head for the",
      "CONFESSION BOOTHS.",
      "BEAVIS",
      "Check it out Butt-Head, porta-potties.",
      "BUTT-HEAD",
      "Cool, huh huh.",
      "B&B each enter a confession booth on the priest's side.",
      "INT.  ST. FRANCIS CHURCH - LATER",
      "WIDE EST. SHOT shows that a confessional service has begun.",
      "INT.  ST. FRANCIS CHURCH/CONFESSION BOOTH - DAY",
      "We see a man nervously confessing. This seems difficult for him.",
      "MAN",
      "(about to cry)\r\n\t\t\tForgive me Father for I have sinned.\r\n\t\t\tI,...I...I slept with a woman, and...",
      "From the priest's side of the confessional we hear Butt-head. The \r\n\tman can't see him.",
      "BUTT-HEAD (O.S.)",
      "Huh huh huh, really? Was she naked?",
      "MAN",
      "Well, yes Father. Please forgive me. I...",
      "BUTT-HEAD (O.S.)",
      "Cool, huh huh huh. Could you like, see her\r\n\t\t\tboobs?",
      "ANGLE INSIDE ANOTHER CONFESSIONAL",
      "MAN #2",
      "(confused)\r\n\t\t\tHow many Hail Marys?",
      "BEAVIS (O.S.)",
      "A thousand! Yeah, heh heh hmm. And I want\r\n\t\t\tyou to hit yourself. Right now!",
      "MAN #2",
      "Now?!",
      "BEAVIS (O.S.)",
      "Yeah! Heh heh hmm heh. DO IT!",
      "From outside the confession booth, we hear the sound of a SMACK.",
      "BEAVIS (O.S./CONT.)",
      "Harder! Heh heh. Again! Heh heh. You need\r\n\t\t\tto straighten up!",
      "EXT.  ST. FRANCIS CHURCH - DAY",
      "As B&B board the bus they are STRUCK BY LIGHTNING.",
      "INSERT: A RED LINE snakes further down into Arizona.",
      "EXT.  PETRIFIED FOREST VISITOR'S CENTER - DAY",
      "This establishes.",
      "INT.  PETRIFIED FORESTS VISITOR'S CENTER - DAY",
      "B&B stare at an exhibit, riveted. The nuns watch them. A recording \r\n\tplays.",
      "RECORDING (V.O.)",
      "Welcome to the Petrified Forest. The\r\n\t\t\tworld's largest site of petrified wood.",
      "B&B",
      "Huh huh huh huh wood.",
      "The Mother Superior makes a signal the other nuns were waiting \r\n\tfor. They all rush back to the bus, leaving B&B behind.",
      "RECORDING (V.O.)",
      "You may wonder, how can wood get so hard?",
      "B&B",
      "Huh huh huh huh huh huh.",
      "Through the window, we see the bus drive away.",
      "ANGLE ON AN OLD RANGER behind a counter, looking at B&B. He sees \r\n\ttheir A.T.F. photo nearby and reaches for a phone.",
      "EXT.  PETRIFIED FOREST VISITOR'S CENTER - DAY",
      "MONTAGE SONG ENDS.",
      "B&B step outside. Nearby, a tourist car pulls up.",
      "BEAVIS",
      "Hey, where'd those chicks go?",
      "BUTT-HEAD",
      "Uh... I think you scared them off.",
      "BEAVIS",
      "This sucks. What are we doing here?\r\n\t\t\tWeren't we suppost'a go to Washington and\r\n\t\t\tscore or something?",
      "From the car, a tourist couple heads into the building.",
      "BUTT-HEAD",
      "(to couple)\r\n\t\t\tUh, do you know where Washington is?",
      "TOURIST MAN",
      "Yeah, 'bout 2000 miles that way.",
      "He points to the desert, then continues into the building.",
      "BUTT-HEAD",
      "Cool. Huh huh huh.",
      "B&B walk off into the desert.",
      "EXT.  PETRIFIED FOREST TOURIST CENTER - LATER",
      "The place is crawling with A.T.F.  Flemming walks out with Bork \r\n\tand the OLD RANGER.",
      "FLEMMING",
      "Didn't see which way they went. Didn't see\r\n\t\t\ttheir vehicle. I don't suppose you tried\r\n\t\t\tto stop them?",
      "OLD RANGER",
      "The most dangerous guys in America? Not\r\n\t\t\tme, Sonny. I make nine dollars an hour.",
      "FLEMMING",
      "National security is the responsibility of\r\n\t\t\tevery American. Bork...",
      "BORK",
      "Cavity search...?",
      "FLEMMING",
      "Deep and hard.",
      "Agents lead the old Ranger away.",
      "FLEMMING (CONT.)",
      "They're not gonna get away this time. I\r\n\t\t\twant roadblocks. Every road outta here for\r\n\t\t\ttwo hundred miles.",
      "EXT.  ROAD - DAY",
      "IN MONTAGE SHOTS:",
      "A.T.F. agents put up roadblocks.",
      "Agents load guns.",
      "Agents pile up sandbags and prepare for battle.",
      "EXT.  DESERT - DAY",
      "WIDE SHOT. A wasteland. Scorching desert hear. B&B, small in \r\n\tframe, look lost. They're parched, weak.",
      "BEAVIS",
      "This sucks. It's all hot and stuff.",
      "BUTT-HEAD",
      "This desert is stupid. They need to put a\r\n\t\t\tdrinking fountain out here.",
      "BEAVIS",
      "Yeah or like a Seven-Eleven or\r\n\t\t\tsomething... Are we almost there?",
      "BUTT-HEAD",
      "Uh, probably like, another five minutes or\r\n\t\t\tsomething.",
      "ANGLE FROM OVERHEAD. Lost, alone, B&B wobble like they haven't \r\n\tlong to live. Overhead, vultures circle.",
      "ANGLE ON B&B, exhausted, spent. Staring ahead, Butt-Head suddenly \r\n\tsees something.",
      "BUTT-HEAD (CONT.)",
      "Whoa! Check it out!",
      "Beavis clears his eyes and sees it too.",
      "B&B",
      "Yes! Yes! Huh huh huh.",
      "Excited, saved, they rush weakly forward.",
      "B&B'S P.O.V. REVEALS they rush to: A GIANT BIG SCREEN TV.",
      "BEAVIS",
      "Turn it on! Turn it on!",
      "As they get closer it disappears - just a mirage.",
      "BUTT-HEAD",
      "Uh...",
      "BEAVIS",
      "Dammit!!!! Dammit!!!!",
      "ANGLE ON SUN, brightening. The FRAME WHITES OUT.",
      "EXT.  ROADBLOCK - DAY",
      "Cars are backed up into the horizon.",
      "The car up front is waved on. Up next: Tom and Marcy. An agent \r\n\tsteps over and shows the picture of B&B.",
      "TOM",
      "Something wrong, Officer?",
      "AGENT",
      "Sir, we're looking for these two\r\n\t\t\tfugitives.",
      "ANDERSON SQUINTS to see.",
      "HIS P.O.V. REVEALS the photo out of focus.",
      "ANDERSON",
      "Why I'll be danged. It's those boys been\r\n\t\t\twhackin' off in my camper...",
      "AGENT",
      "You saw these two?",
      "ANDERSON",
      "I sure did. They were whackin' off in my\r\n\t\t\ttool shed. Then whackin' off in my camper.\r\n\t\t\tI never seen so much whackin' off.",
      "The agent steps back and shouts into his walkie-talkie:",
      "AGENT",
      "Blue Den this is post nine! I have\r\n\t\t\tpositive ID!! (to Tom) Sir, I'm gonna have\r\n\t\t\tto ask you and your wife to step out of\r\n\t\t\tthe vehicle.",
      "ANDERSON",
      "Well you see, me and the missus are on our\r\n\t\t\tway to Washington. We got this schedule...",
      "The agent pulls his gun and orders:",
      "AGENT",
      "Now!!!!",
      "EXT.  SIDE OF HIGHWAY/JUST OFF ROADBLOCK - DAY",
      "A BIT LATER. Agents swarm over Tom's camper, turning everything \r\n\tupside, pulling out dishes, trashing everything.",
      "TOM",
      "(furious)\r\n\t\t\tNow wait right there. You're dealing with\r\n\t\t\ta veteran of two foreign wars. They're the\r\n\t\t\tones been whacking off. If I find anything\r\n\t\t\tbroken in there, you and I are gonna\r\n\t\t\ttangle!",
      "An A.T.F. agent smashes the micro on the ground and sifts through \r\n\tthe pieces.",
      "Nearby, Flemming and Hurley watch.",
      "FLEMMING",
      "(appalled)\r\n\t\t\tMasturbating in a man's camper! We're\r\n\t\t\tdealing with two sick individuals. I want\r\n\t\t\tthat camper torn apart, full cavity\r\n\t\t\tsearches all around.",
      "SNAP! SFX as Agent Hurley puts on her rubber gloves and leads Tom \r\n\tand Marcy away.",
      "Agent Bork runs up to Flemming.",
      "BORK",
      "Chief - just came in! Two days ago,\r\n\t\t\tExpress Airways had a disturbance by\r\n\t\t\tsomeone calling himself - Cornholio. Guess\r\n\t\t\twho matches the description?",
      "He holds up a police sketch of Cornholio. Flemming walks to a \r\n\tnearby chopper. SOUND of engine revving. Others follow.",
      "FLEMMING",
      "Finally, a real break. Get me that\r\n\t\t\tflight's point of origin. We're gonna kick\r\n\t\t\tsome ass.",
      "EXT.  DESERT - DAY",
      "B&B walk along in the scorching heat. Ahead of them they see a \r\n\tDUMB GUY and a DUMBER GUY with motorcycles parked. They are trying \r\n\tto start a camp fire, LAUGHING.",
      "DUMB GUY",
      "(to B&B)\r\n\t\t\tUh, hey. One of you kids got a match?",
      "BUTT-HEAD",
      "(dehydrated)\r\n\t\t\tUh, my butt and your...uh, butt.",
      "INT.  B&B'S HOME - DAY",
      "Peaceful. Empty. Suddenly dozens of A.T.F. agents break in, guns \r\n\tready, searching every corner. They tear it apart.",
      "EXT.  B&B'S TOWN/STREETS - DAY",
      "Agents rush down the business streets. People are in a panic. It's \r\n\tlike an invasion.",
      "ANGLE ON ELITE MOTOR LODGE - ON B&B'S TV SET as agents rush by, \r\n\tknocking it over with a crash.",
      "INT.  VAN DRIESSEN'S CLASS - DAY",
      "Guitar in hand, Van Driessen sings:",
      "VAN DRIESSEN",
      "She flies so gracefully,\r\n\t\t\tover rocks, trees and sand. Soaring over\r\n\t\t\tcliffs and gently\r\n\t\t\tfloating down to land.\r\n\t\t\tShe proudly lifts her voice\r\n\t\t\tto sound her mating call.\r\n\t\t\tAnd soon her mate responds\r\n\t\t\tby singing... \"Caw, Caw, Caw.\"\r\n\t\t\tCome with me, Lesbian Seagull.\r\n\t\t\tSettle down and rest with me...",
      "Suddenly dozens of A.T.F. agents crash into the room. The door \r\n\tbashes in, knocking Van Driessen down hard and crushing his \r\n\tguitar.",
      "Flemming enters. Behind him, McVicker.",
      "McVICKER\r\n\t\t\tUh...uh...uh that's him. He's their\r\n\t\t\tteacher.",
      "VAN DRIESSEN",
      "What's going on here?",
      "FLEMMING",
      "I'll ask the questions. Are these your\r\n\t\t\tstudents?",
      "He shows a picture of B&B.",
      "VAN DRIESSEN",
      "I assume you're a government agent. I\r\n\t\t\twould think you would know there's\r\n\t\t\tsomething in this country called due\r\n\t\t\tprocess.",
      "FLEMMING",
      "That's about the kind of talk I'd expect\r\n\t\t\tfrom the guy who taught these two. Take\r\n\t\t\tthis scum away.",
      "VAN DRIESSEN",
      "I believe I'm supposed to be read my\r\n\t\t\tMiranda Rights...",
      "An agent interrupts, punching Van Driessen in the gut. He's taken \r\n\taway. Flemming turns menacingly to McVicker.",
      "McVICKER\r\n\t\t\tI...I...I always knew they were no good.\r\n\t\t\tI... I... I hate them!",
      "FLEMMING",
      "(to McVicker)\r\n\t\t\tYou've been harboring two criminal\r\n\t\t\tmasterminds!",
      "Bork rushes up to Flemming with a paper.",
      "BORK",
      "Chief, you know that guy whose camper they\r\n\t\t\twere whacking off in?",
      "FLEMMING",
      "(appalled)\r\n\t\t\tBork! You are a federal agent. You\r\n\t\t\trepresent the United States Government...\r\n\t\t\tNever end a sentence with a preposition.\r\n\t\t\tTry again.",
      "BORK",
      "Oh, ah... You know that guy in whose\r\n\t\t\tcamper they... I mean that guy off in\r\n\t\t\twhose camper they were whacking?",
      "FLEMMING",
      "That's better. Yes?",
      "BORK",
      "We've run a sample through the National\r\n\t\t\tCriminal Sperm Bank and come up with two\r\n\t\t\tpossible genetic matches for a father.\r\n\t\t\t(holds up photos)",
      "TIGHT ON PHOTO. It's the DUMB GUY and DUMBER GUY from the desert.",
      "BORK (O.S./CONT.)",
      "Former Motley Crue members turned\r\n\t\t\tdrifters.",
      "Flemming takes the paper and marches off. Others follow.",
      "DISSOLVE TO:",
      "EXT.  DESERT - NIGHT",
      "B&B and the Dumn abd Dumber Guys are sitting around a campfire. \r\n\tThe Dumb Guy looks like an older, more stupid, version of Butt-\r\n\tHead. The Dumber Guy is a couple of evolutionary scales down from \r\n\tBeavis. Their relationship is an exaggerated version of B&B's.",
      "Butt-Head is staring at the Dumb Guy in admiration. Beavis, like \r\n\tthe Dumber Guy, appears to be just staring at the fire, \r\n\thypnotized. Dumb Guy is eating spaghetti out of a can.",
      "BUTT-HEAD",
      "You were a roadie for Motley Crue?",
      "DUMB GUY",
      "(mouth full)\r\n\t\t\tYup. Huh huh.",
      "BEAVIS",
      "Fire.",
      "DUMB GUY",
      "Here's another true story. About fifteen\r\n\t\t\tyears ago, we stopped in this, uh, toilet,\r\n\t\t\tcalled Highland...",
      "BUTT-HEAD",
      "Really? That's where we're from.",
      "DUMB GUY",
      "Well, then you know what I'm talking\r\n\t\t\tabout. Anyway, here's the story. I\r\n\t\t\tscored with these two chicks. True story.",
      "BUTT-HEAD",
      "You scored with two chicks?!",
      "DUMB GUY",
      "(spaghetti dribbling from mouth)\r\n\t\t\tYeah, they were sluts. Huh huh huh.",
      "DUMBER GUY",
      "Ih hih hih hih hih hih.",
      "Dumb Guy punches Dumber Guy in the head with a closed fist.",
      "DUMB GUY",
      "Shut up, dumb-ass! You didn't score. I\r\n\t\t\tscored with both of them...",
      "BUTT-HEAD",
      "Uh, do you think these two sluts still\r\n\t\t\tlive in Highland? That would be cool.",
      "DUMB GUY",
      "(after taking another big bite)\r\n\t\t\tHey, you wanna see something really cool?\r\n\t\t\tHuh huh huh.",
      "Dumb Guy gets up, turns his butt towards the fire and starts to \r\n\tdrop his pants.",
      "EXT.  DESERT/LONG SHOT - CONTINUOUS",
      "The campfire is in the distance, middle of nowhere. A flatulant \r\n\tsound is heard. Suddenly, a big beautiful purple and orange \r\n\tfireball erupts, lighting up the sky.",
      "B&B/DUMB GUY/DUMBER GUY (O.S.)",
      "Huh huh huh huh huh huh huh huh huh huh.",
      "BEAVIS (O.S.)",
      "Fire.",
      "EXT.  DESERT - MORNING",
      "B&B wake up. The Dumb Guy and Dumber Guy are gone. The sun is \r\n\tscorching.",
      "B&B inch forward - spent, dehydrated, near death.",
      "ANGLE ON GROUND as B&B collapse into frame. Butt-Head looks up at \r\n\tthe sun, squinting.",
      "BUTT-HEAD",
      "(barely alive)\r\n\t\t\tThe sun sucks.",
      "A vulture picks at Beavis' shirt. Beavis SMACKS the vulture.",
      "BEAVIS",
      "(to the vulture)\r\n\t\t\tCut it out butt-hole!",
      "The vulture moves revealing a PEYOTE CACTUS. Beavis looks at it.",
      "BEAVIS (CONT.)",
      "Hey Butt-Head, isn't there supposed to be\r\n\t\t\tlike, water in cactuses?",
      "BUTT-HEAD",
      "(semiconscious)\r\n\t\t\tUh...",
      "Beavis takes a bite of the cactus, chews and then coughs.",
      "BUTT-HEAD (CONT.)",
      "(sees something)\r\n\t\t\tHey Beavis, check it out.",
      "IN FRONT OF B&B: Two vultures start humping.",
      "B&B",
      "(struggling to laugh)\r\n\t\t\tHuh huh huh (cough) huh huh (cough).",
      "EXT.  ROADBLOCK - DAY",
      "START ON SUN - over B&B?",
      "REVEAL it's over Muddy who looks at a picture of B&B held by an \r\n\tA.T.F. agent.",
      "MUDDY",
      "No, I can't say I've seen 'em. I sure hope\r\n\t\t\tit's safe to drive around here.",
      "COP",
      "Don't worry, sir. Just stick to the main\r\n\t\t\troads. If they're around, they're probably\r\n\t\t\thiding out in the desert.",
      "MUDDY",
      "That's good to know, Officer.",
      "Muddy takes off with a smile and turns off onto a side road.",
      "EXT.  DESERT - LATER",
      "B&B barely crawling forward. Butt-Head stops, then Beavis. They're \r\n\tbarely able to talk.",
      "BEAVIS",
      "Hey Butt-Head, are we gonna die?",
      "BUTT-HEAD",
      "Uh, probably, huh huh...Whoa, I think my\r\n\t\t\tlife is like, flashing in front of my\r\n\t\t\teyes!",
      "BUTT-HEAD'S VISION. Through time-lapse dissolves we see him \r\n\tsitting on his couch with Beavis, laughing like an idiot in the \r\n\texact same positions at age 2, 5, 7, 10, 13.",
      "BUTT-HEAD",
      "Whoa, my life is cool!",
      "TIGHT ON BEAVIS:",
      "BEAVIS",
      "Uh... I think I'm seeing something too.\r\n\t\t\tIt's like a really long time ago...",
      "BEAVIS' VISION: Beavis as a sperm cell swimming through a uterus. \r\n\tIt's a sperm cell with the face of Beavis on it.",
      "BEAVIS/SPERM",
      "Yeah, heh heh. This is gonna be cool.",
      "Beavis/Sperm swims over to the egg.",
      "With its own tail the Beavis/Sperm starts picking its nose.",
      "BEAVIS/SPERM (CONT.)",
      "Hey, how's it goin'? Heh heh heh.",
      "Several other sperm charge in, knocking Beavis into the egg. His \r\n\tconception looks like a dumb accident.",
      "BACK ON BEAVIS:",
      "BEAVIS",
      "Yeah, heh heh I scored.",
      "Animated bubbles appear around Beavis' head.",
      "BEAVIS (CONT.)",
      "Hey Butt-Head, I'm starting to feel weird.\r\n\t\t\tI think I'm freaking out.",
      "BUTT-HEAD",
      "Huh? Huh huh.",
      "BEAVIS",
      "Whoa, this is cool! Heh heh. It's like,\r\n\t\t\teverything looks all weird and...",
      "BEAVIS' P.O.V. OF BUTT-HEAD: His face starts to warp and colors \r\n\tstart shifting.",
      "BEAVIS (CONT.)",
      "...and... Whoa!...and it's like there's\r\n\t\t\tall these weird shapes and it's sort of\r\n\t\t\tlike,...it's like...like a MUSIC VIDEO!!!",
      "Tight on Beavis' face staring in wonder.",
      "THIS IS WHERE THE MUSIC VIDEO/HALLUCINATION SEQUENCE BEGINS. It \r\n\tcould even be so shameless as to actually have a chyron in the \r\n\tlower left hand corner.",
      "I would like to have a band (White Zombie?) do a version of \r\n\tsomething like, \"Fire,\" by The Crazy World of Arthur Brown. This \r\n\tis the song that begins, \"I am God of Hellfire and I bring you... \r\n\tfire!\"",
      "The concept of this will depend somewhat on which band we get, but \r\n\tI would like to see it get pretty wild and surreal. (If it's White \r\n\tZombie, we could incorporate some of Rob Zombie's artwork.)",
      "BEAVIS' P.O.V.:",
      "We see the sun above the horizon turn into a giant ball of fire. \r\n\tThe ball of fire develops a face and speaks.",
      "FIRE",
      "I am God of Hellfire and I bring\r\n\t\t\tyou...(music begins) Fire...",
      "BEAVIS",
      "Whoa!!! This kicks ass!!!",
      "THIS IS THE GREATEST VIDEO BEAVIS HAS EVER SEEN. Out of the ball \r\n\tof fire steps a beautiful woman in a bikini.",
      "At first the video is mostly the God of Hellfire, chicks in \r\n\tbikinis and various images of B&B's TV in all its glory.",
      "As the video/hallucination continues, it becomes a psychotic mass \r\n\tof naked people, fire, TVs, vultures, B&B head-banging, weird \r\n\tstuff from my high school notebooks, etc.",
      "At one point we see the God of Hellfire in a Burger World uniform.",
      "As the song winds down, we incorporate Muddy's car into the \r\n\tsurreal imagery. (We should also incorporate their TV, as well as \r\n\tmaybe some of the characters from the show that aren't in the \r\n\tmovie.)",
      "Then, we REVEAL Muddy's car actually pulling up to B&B's near-dead \r\n\tbodies.",
      "The SONG ENDS as Muddy tosses water on B&B. REVEAL they were not \r\n\tfar from the side of a road all along.",
      "B&B",
      "Ahhhhghhhhgh!",
      "B&B snap out of it. They rise and find Muddy hovering over them \r\n\twith a shotgun.",
      "BEAVIS",
      "Aagh! I'm all wet!...(realizing) Oh, cool.\r\n\t\t\tHeh heh heh. Water.",
      "Muddy aims his shotgun at B&B.",
      "MUDDY",
      "Ah'm gonna enjoy this. Any last words\r\n\t\t\tb'fore ah kill ya?",
      "B&B think.",
      "BUTT-HEAD",
      "Uh... Huh huh. I have a couple. Butt\r\n\t\t\tcheeks, huh huh huh.",
      "BEAVIS",
      "Yeah! Boobs. Heh heh. I just wanna say\r\n\t\t\tthat again. Boobs. Heh heh.",
      "MUDDY",
      "Ah'm gonna blow you both to hell!",
      "BUTT-HEAD",
      "Cool, huh huh. (realizing) Hey Beavis\r\n\t\t\tthat's that dude that's paying us to do\r\n\t\t\this wife.",
      "BEAVIS",
      "Oh yeah. Can you just take us to\r\n\t\t\tWashington? We're gonna meet her there\r\n\t\t\tand, you know, heh heh hmmm...",
      "MUDDY",
      "Washington! That's where she was gonna\r\n\t\t\tmeet up with ya? (realizes) Damn, she's\r\n\t\t\tgoin' all the way!",
      "B&B",
      "Huh huh huh huh huh huh huh.",
      "Muddy lowers the gun a bit.",
      "MUDDY",
      "You know, I just might need you after all.\r\n\t\t\tAw right, in the trunk. You're gonna help\r\n\t\t\tme get mah unit back.",
      "Muddy pops it open. B&B climb in. Muddy closes the trunk on them \r\n\tand walks to the front of the car. HOLD ON THE TRUNK.",
      "BUTT-HEAD (O.S.)",
      "Boy, it sure is hard to score. Huh huh\r\n\t\t\thuh.",
      "Muddy peels out.",
      "EXT.  HIGHWAY - DAY",
      "A MONTAGE SONG BEGINS.",
      "Muddy drives by.",
      "INSERT: A RED LINE snakes through a map to Santa Fe.",
      "DISSOLVE TO:",
      "EXT.  HIGHWAY - DAY",
      "Muddy's car drives by. Muddy hears B&B laugh from inside the trunk \r\n\tand turns up the radio to drown it out.",
      "INSERT: A RED LINE snakes through a map to Oklahoma City.",
      "DISSOLVE TO:",
      "EXT.  GAS STATION - DAY",
      "Muddy pumps gas. From inside the trunk:",
      "BEAVIS (O.C.)",
      "Hey Butt-Head, look. A jack. Heh heh.",
      "BUTT-HEAD (O.C.)",
      "Huh huh. Jack. Huh huh.",
      "INSERT: A RED LINE snakes through a map to Little Rock, Nashville \r\n\tand into Virginia up Rt. 81.",
      "EXT.  MUDDY'S CAR DRIVING ON HIGHWAY - DAY",
      "ANGLE OUTSIDE MUDDY'S TRUNK. From within we hear:",
      "BUTT-HEAD (O.C.)",
      "Hey, Beavis, check it out. I'm jacking\r\n\t\t\toff!",
      "B&B",
      "Huh huh huh huh huh huh.",
      "Pumping up the jack, they cause the lid of the trunk to start to \r\n\tbend.",
      "Suddenly, it pops open. B&B are a sweaty mess. They gasp.",
      "BUTT-HEAD",
      "This sucks. Let's get outta here.",
      "They look out. The road behind them races past at 80 mph. Beavis \r\n\tstares dumbly.",
      "BEAVIS",
      "Uh, you first.",
      "BUTT-HEAD",
      "C'mon, Beavis, just start running really\r\n\t\t\tfast when you hit the ground. It'll work.",
      "BEAVIS",
      "Okay. I'll go right after you.",
      "Butt-Head shoves Beavis out of the car.",
      "BEAVIS (CONT.)",
      "Ahhhhghghhghghgh!",
      "Beavis tries to run, but hits the road and flips over and over - \r\n\tand smashes his butt.",
      "BEAVIS (CONT.)",
      "Owwwwww, my butt!!!!!!",
      "His body stops in the middle of the road. A huge truck, about to \r\n\thit him, swerves and jackknifes over the side.",
      "Behind the truck, several cars screech to a halt, one smashing \r\n\tinto the other.",
      "ANGLE ON MUDDY'S TRUNK",
      "Butt-Head looks at the road.",
      "BUTT-HEAD",
      "Huh huh huh huh huh. That was cool.",
      "ANGLE ON MUDDY'S TIRE. It hits a pothole.",
      "ANGLE ON BUTT-HEAD, shooting out of the trunk, he grabs onto the \r\n\tlid. He bounces against the road again and again.",
      "Finally, he loses his grip as the lid to the trunk closes.",
      "ANGLE ON BUTT-HEAD, rolling along the highway.",
      "A car, about to hit Butt-Head, screeches to a halt. Other cars \r\n\tbehind it smash and pile up.",
      "ANGLE ON ROAD SOME WAYS BACK. On Tom and Marcy in their car.",
      "TOM",
      "Boy, what I wouldn't give for five minutes\r\n\t\t\talone with them two little bastards...",
      "The car ahead of Tom crashes into the car ahead of that. Tom \r\n\tcrashes into it. And the car behind crashes into Tom.",
      "OVERHEAD ANGLE shows cars and trucks behind, crashing, piling up. \r\n\tA massive pile-up.",
      "INT.  MUDDY'S CAR - DAY",
      "Muddy doesn't notice the mess behind him. He drives on.",
      "MONTAGE SONG ENDS",
      "EXT.  HIGHWAY - DAY",
      "LATER.",
      "ON MEDIVAC helicopters; one landing, another taking off.",
      "MOVE TO WOMAN TV REPORTER, talking to camera:",
      "REPORTER",
      "Authorities are calling this the worst\r\n\t\t\thighway disaster in the nation's\r\n\t\t\thistory...",
      "INT.  A.T.F. HEADQUARTERS/FLEMMING'S OFFICE - DAY",
      "Flemming, Bork, and about six other agents look at a map. Behind \r\n\tthem, a TV is on with the reporter continuing. Behind the \r\n\treporter, B&B poke their heads into frame at 45 degree angles, \r\n\tlooking like deer in the headlights.",
      "REPORTER (CONT.)",
      "... Behind me, over 400 vehicles lay\r\n\t\t\twrecked or stuck. No one knows what caused\r\n\t\t\tit, but police have not ruled out the\r\n\t\t\tpossibility of terrorists.",
      "Bork notices B&B on TV and taps Flemming on the shoulder. Flemming \r\n\tlooks.",
      "FLEMMING",
      "Well, I'll be a blue-nosed gopher.",
      "BORK",
      "(despairing)\r\n\t\t\tWhere did these guys come from?",
      "Flemming looks at the big map which traces sightings of B&B across \r\n\tAmerica.",
      "FLEMMING",
      "The question is, where are they going.",
      "He looks again at the TV. On the news, a story about...",
      "REPORTER 2",
      "...set for 5:00 tomorrow when\r\n\t\t\trepresentatives from around the world will\r\n\t\t\tmeet in Washington for the first such\r\n\t\t\tpeace conference...",
      "Flemming looks back at the map, and then back at the TV.",
      "FLEMMING",
      "What the hell...? Bork! That bus we picked\r\n\t\t\tup. Where was it headin'?",
      "BORK",
      "(checks papers)\r\n\t\t\tD.C., Chief.",
      "FLEMMING",
      "(realizing)\r\n\t\t\tJesus jumped-up... Bork, can you imagine\r\n\t\t\twhat would happen if they set that thing\r\n\t\t\toff in our nation's capital, or even\r\n\t\t\tworse, if they sold it to some damned\r\n\t\t\tforeigner at that conference. (rises and\r\n\t\t\tputs his fist down) Well, it's not gonna\r\n\t\t\thappen!",
      "EXT.  HIGHWAY/CRASH SITE - DAY",
      "B&B walk along looking at the wreckage.",
      "BUTT-HEAD",
      "Whoa, this kicks ass! Huh huh huh.",
      "MARTHA (O.S.)",
      "Yoo-hoo! Travis and Bob Head. Whoo-hoo!",
      "The tour bus stands nearby. Martha calls from the window.",
      "BEAVIS",
      "Hey Butt-Head it's that chick!",
      "BUTT-HEAD",
      "Uh, oh yeah. Cool. They can take us to\r\n\t\t\tWashington and we can finally score.",
      "B&B head into the bus.",
      "BEAVIS",
      "Yeah, heh heh. Umm, isn't Seattle in\r\n\t\t\tWashington? Heh heh... 'cuz I was\r\n\t\t\tthinking maybe we could go see Hole.",
      "BUTT-HEAD",
      "Yeah. We can go see Hole and then we can\r\n\t\t\tget some hole. Huh huh huh huh.",
      "INSERT: MAP. The RED LINE snakes right up to D.C.",
      "INT/EXT.  TOUR BUS - DAY",
      "INTERCUT BETWEEN THE BUS AND THE SIGHTS IT PASSES:",
      "ANGLE ON THE LINCOLN MONUMENT.",
      "ANGLE ON BUS WINDOW. Several seniors press their faces to see.",
      "ANGLE ON THE WASHINGTON MONUMENT.",
      "ANGLE ON BUS WINDOW. More seniors rush to the window to see.",
      "ANGLE ON THE CAPITOL BUILDING.",
      "ANGLE ON BUS WINDOW. B&B press their bare asses.",
      "EXT.  CAPITOL - DAY",
      "The seniors and B&B get off the bus.",
      "As soon as they're out of sight, Dallas drives up and sees the \r\n\tTour Bus. She smiles to herself.",
      "INT.  CAPITOL UNDERGROUND GARAGE - DAY",
      "Dark. Isolated.",
      "Dallas pulls up and gets out of her car. Suddenly, a voice:",
      "VOICE/MUDDY",
      "'Spectin' someone?",
      "Dallas wheels around. Muddy's got a gun on her.",
      "MUDDY (CONT.)",
      "Well, well. Look at this. The love of my\r\n\t\t\tlife. Where have you been?",
      "Muddy moves towards Dallas. She steps back.",
      "DALLAS",
      "Honey, I was gonna split it with you after\r\n\t\t\tI sold it, right down the middle. I swear.\r\n\t\t\tI just...",
      "MUDDY",
      "Sure you were. But now you don't have to\r\n\t\t\tgo through all that bother.",
      "Dallas moves seductively towards Muddy.",
      "DALLAS",
      "Come on Muddy. Whatd'ya say we just\r\n\t\t\tforget about it and go get a room like old\r\n\t\t\ttimes...",
      "Muddy cocks his gun.",
      "MUDDY",
      "I don't think so. Where is it?",
      "INT.  CAPITOL - DAY",
      "B&B walk up to the information booth where a HOST makes an \r\n\tannouncement.",
      "HOST",
      "(announces)\r\n\t\t\tAll Senators are requested for a vote. All\r\n\t\t\tSenators are requested for a vote.",
      "A bell accompanies this announcement.",
      "HOST (CONT.)",
      "(to B&B)\r\n\t\t\tCan I help you?",
      "BEAVIS",
      "Yeah, we're looking for Washington.",
      "BUTT-HEAD",
      "Huh huh. We're gonna meet this chick with\r\n\t\t\treally big hooters.",
      "HOST",
      "Sirs, you are in Washington.",
      "BEAVIS",
      "Well where is she?!",
      "BUTT-HEAD",
      "Could you, like, tell her we're ready to\r\n\t\t\tscore?",
      "HOST",
      "No! Just a moment...",
      "She turns to the side to answer the phone.",
      "INT.  CAPITOL/PRIVATE PANEL ROOM - DAY",
      "Six Senators sit behind a panel. BOB PACKWOOD testifies across \r\n\tfrom them.",
      "SENATOR",
      "Thank you for returning, Senator Packwood,\r\n\t\t\tto help us understand how sexual\r\n\t\t\tharassment happens in this sacred\r\n\t\t\tinstitution.",
      "Suddenly, SOUND OF BUTT-HEAD over the PA.",
      "BUTT-HEAD (V.O.)",
      "Uh... Attention, attention! We're looking\r\n\t\t\tfor that chick with the big boobs.",
      "BEAVIS (V.O.)",
      "Heh heh. We wanna do her now!",
      "HOST (V.O.)",
      "Hey! Gimme tha...",
      "B&B (V.O.)",
      "Huh huh huh huh huh.",
      "ANGLE ON PACKWOOD - smiles.",
      "PACKWOOD",
      "Huh huh huh huh huh.",
      "INT.  CAPITOL/SENATE - DAY",
      "Classic wide, overhead shot. SOUND of all Senators.",
      "SENATORS",
      "Huh huh huh huh huh.",
      "INT.  CAPITOL UNDERGROUND GARAGE - DAY",
      "Muddy finishes tying Dallas' hands behind her back. He crosses to \r\n\this trunk.",
      "MUDDY",
      "You forgot who yer dealin' with, Honey. Ya\r\n\t\t\tsee, I got your mules right here in my\r\n\t\t\ttrunk and...",
      "Muddy pops the trunk. It's empty.",
      "MUDDY (CONT.)",
      "Say what?... I'm gonna kill 'em!!!",
      "DALLAS",
      "No honey we're gonna kill 'em.",
      "Dallas, still tied up, starts kissing Muddy. He gives in.",
      "EXT.  CAPITOL - DAY",
      "ANGLE ON B&B getting on the bus last.",
      "INT.  TOUR BUS - DAY",
      "Butt-Head sits. Beavis pauses, still standing.",
      "BEAVIS",
      "Hey wait a minute. What's going on? Why\r\n\t\t\tare we getting back on the bus?",
      "OLD GUY",
      "It's time to go son.",
      "BEAVIS",
      "We can't leave! We never met that chick!\r\n\t\t\tDammit!!! We were supposed to get some!",
      "BUTT-HEAD",
      "Huh huh huh. Settle down Beavis.",
      "BEAVIS",
      "Oh yeah,...I mean no. NO! I won't settle\r\n\t\t\tdown! Not this time!...",
      "Beavis is shaking, fed up. He delivers the speech of his life.",
      "BEAVIS (CONT.)",
      "Dammit, this always happens! I think I'm\r\n\t\t\tgonna score and then I never score! It's\r\n\t\t\tnot fair! We've traveled a hundred miles\r\n\t\t\t'cause we thought we were gonna score, but\r\n\t\t\tnow it's not gonna happen!",
      "BUS DRIVER",
      "(yelling from his seat)\r\n\t\t\tHey buddy, sit down! Now!",
      "BEAVIS",
      "SHUT UP! (continuing) I'm sick and tired\r\n\t\t\tof this! We're never gonna score! It's\r\n\t\t\tjust not gonna happen! We're just gonna\r\n\t\t\tget old like these people, but they've\r\n\t\t\tprobably scored!",
      "BUS DRIVER",
      "(standing)\r\n\t\t\tHey! I'm warning you! Sit down!",
      "BEAVIS",
      "It's like this chick's a slut (motioning\r\n\t\t\tto Martha)... and look at this guy!...\r\n\t\t\tHe's old but he's probably scored a\r\n\t\t\tmillion times!",
      "OLD GUY",
      "(nods in agreement)\r\n\t\t\tOhh yeah.",
      "BEAVIS",
      "But not us! We're never gonna score! WE'RE",
      "NEVER GONNA SCORE!!! AAGGHHHH!!!",
      "The bus driver tackles Beavis.",
      "INT.  CAPITOL/PARKING GARAGE/MUDDY'S CAR - DAY",
      "In a tight shot, we see Muddy and Dallas humping away in the back \r\n\tseat (in a PG-13 kind of way).",
      "We hear the sound of a door opening.",
      "ANGLE ON FLEMMING, BORK AND SEVERAL AGENTS LOOKING DOWN.",
      "FLEMMING",
      "Well look what we have here. You two make\r\n\t\t\tme sick... Book 'em Bork.",
      "DALLAS",
      "You don't have anything on us and you know\r\n\t\t\tit.",
      "FLEMMING",
      "Oh I don't huh? How about lewd conduct?\r\n\t\t\tMaybe indecent exposure?...\r\n\t\t\tHere's what's gonna happen. One of you's\r\n\t\t\tgonna make a deal and get me the unit. The\r\n\t\t\tother can spend the next sixty years in\r\n\t\t\tjail.",
      "MUDDY",
      "There you're wrong, boy. Me and mah wife\r\n\t\t\tare back together and you'll never...",
      "DALLAS",
      "He stole the unit. Said he put it in some\r\n\t\t\tkid's pants.",
      "MUDDY",
      "Why you damn little...",
      "He's cuffed and dragged away.",
      "INT.  TOUR BUS - DAY",
      "The driver sits down and drives on.",
      "Beavis is slightly beat up. Martha reaches into her purse, filled \r\n\twith prescription medications.",
      "MARTHA",
      "Now Travis, it doesn't do a body good to\r\n\t\t\tget all worked up. Here. This should help\r\n\t\t\tyou relax.",
      "She holds up a box of NoDrowz and squints at the label.",
      "MARTHA",
      "Does that say Xanax?",
      "BEAVIS",
      "Um, um, yeah, probably. Heh heh.",
      "Beavis takes a couple, then starts wolfing down the whole box.",
      "INT.  FLEMMING'S CAR - DAY",
      "Flemming's on the radio. Bork checks a tour guide.",
      "FLEMMING",
      "(to radio)\r\n\t\t\tOkay, boys and girls, our suspects are on\r\n\t\t\ta tour bus we believe to be headed for...\r\n\t\t\t(checks papers) the White House! Jumpin'\r\n\t\t\tJesus! I want everyone there. Our people.\r\n\t\t\tLocals. Orders are shoot to kill. Repeat!\r\n\t\t\tShoot to kill!",
      "BORK",
      "Chief, I swear, we tore that bus apart.\r\n\t\t\tThey couldn't have...",
      "FLEMMING",
      "Bork, when this is all over, remind me to\r\n\t\t\tmake you an appointment with Agent Hurley.",
      "EXT.  STREETS OF WASHINGTON - DAY",
      "All manner of police, A.T.F., F.B.I. cars speed along.",
      "EXT.  WHITE HOUSE/TOURIST PARKING LOT - DAY",
      "B&B and the seniors walk from the bus to the White House. Beavis \r\n\tis starting to shake as he finishes off the NoDrowz.",
      "NEARBY, Anderson's camper pulls up.",
      "INT.  WHITE HOUSE - DAY",
      "The seniors and B&B are being led on a tour. B&B in back. Beavis \r\n\tis starting to SHAKE AND MAKE STRANGE NOISES.",
      "As the tour moves on, Beavis stays behind. He goes over to a \r\n\tcoffee-serving cart sitting outside a meeting room. He starts",
      "WOLFING DOWN SUGAR CUBES.",
      "BACK ON THE TOUR:",
      "The tour is led by a smiling guide, SANDY.",
      "SANDY",
      "Welcome to the White House. My name is\r\n\t\t\tSandy, and I'll be your tour guide. In\r\n\t\t\tcase you don't know it, you've come on a\r\n\t\t\tvery special day. Today...",
      "She points to the camera crews outside the window.",
      "EXT.  WHITE HOUSE LAWN - DAY",
      "ON A NEWS REPORTER, facing camera. Behind her, a large gathering \r\n\tbefore a stage.",
      "REPORTER",
      "Today, representatives from around the\r\n\t\t\tworld are gathered at the White House for\r\n\t\t\tan historic global conference called: Give\r\n\t\t\tPeace A Chance - or G-PAC.",
      "EXT.  WHITE HOUSE ENTRANCE - DAY",
      "A.T.F., Police and F.B.I. cars arrive.",
      "INT.  WHITE HOUSE TOUR - DAY",
      "The tour stands in the East Room.",
      "SANDY",
      "This is the East Room. Many of the\r\n\t\t\tportraits you see were saved from the fire\r\n\t\t\tset by the British in 1814...",
      "Beavis is shaking, babbling, staring at his fist, etc.",
      "BEAVIS",
      "Heh heh. Fire. Heh heh Aaaaeeehhhhg!!!",
      "BUTT-HEAD",
      "What's your problem Beavis?",
      "SANDY",
      "...The site for the White House was chosen\r\n\t\t\tby President Washington and Pierre\r\n\t\t\tL'Enfant...",
      "Beavis now has his T-shirt pulled over his head and is pacing \r\n\taround and babbling. He's too loud now for Sandy to ignore.",
      "BEAVIS",
      "L'enfentatta tiitatta for my bunghole!",
      "SANDY",
      "Sir, are you okay?",
      "BEAVIS",
      "Are you threatening me?! I am Cornholio!",
      "SANDY",
      "Sir, maybe you should wait out in the\r\n\t\t\tlobby.",
      "Beavis/Cornholio wanders off, muttering.",
      "BEAVIS/CORNHOLIO",
      "In thees lobby, wheel there be T.P.?",
      "EXT.  WHITE HOUSE - DAY",
      "ON FLEMMING AND THE HEAD SECRET SERVICE GUY - arguing.",
      "FLEMMING",
      "You don't understand. National security is\r\n\t\t\tat stake here. We must evacuate.",
      "SECRET SERVICE GUY",
      "Not without proper authorization.",
      "INT.  WHITE HOUSE - DAY",
      "A group of foreign dignitaries is being led through the hallway on \r\n\ta tour. Two of them chat in Spanish.",
      "We see Beavis coming down the hall in the opposite direction.",
      "DIGNITARY #1",
      "El Presidente es un gringo muy gordo, no?",
      "DIGNITARY #2",
      "Si.",
      "They pass Beavis babbling - riffing off their Spanish.",
      "BEAVIS/CORNHOLIO",
      "Gr-r-ringo! Burrito! R-r-anddatattta!!",
      "Beavis turns around and stops.",
      "BEAVIS/CORNHOLIO (CONT.)",
      "I am Cornholio! I need T.P. for my\r\n\t\t\tbunghole! Heh heh heh.",
      "The group continues down the hall, ignoring Beavis.",
      "BEAVIS/CORNHOLIO (CONT.)",
      "(humble)\r\n\t\t\tWould you like to see my bunghole?",
      "Beavis leaves.",
      "INT.  WHITE HOUSE/CORRIDOR OF PRESIDENTS - DAY",
      "Tom and Marcy Anderson gaze at a portrait of Eisenhower.",
      "TOM",
      "(sotto)\r\n\t\t\tWhere are ya when we need ya Ike... (to\r\n\t\t\tMarcy) I tell ya what, Honey, with all we\r\n\t\t\tbeen through, it don't change a thing. I\r\n\t\t\tsaid it before and I'll say it again. This\r\n\t\t\tis the greatest country on earth...",
      "Beavis/Cornholio wanders by behind them. Tom turns to look.",
      "TOM'S BLURRY P.O.V.: We see Beavis/Cornholio wander down the hall",
      "BABBLING.",
      "TOM",
      "(adjusting his glasses)\r\n\t\t\tSay, that looks like... Nah, it couldn't\r\n\t\t\tbe.",
      "INT.  WHITE HOUSE/ANOTHER PART OF THE HALLWAY - DAY",
      "Beavis comes around a corner and stops at a portrait of Nixon.",
      "ANGLE ON PORTRAIT. Nixon doing classic victory pose - peace signs \r\n\twith both hands up.",
      "ANGLE ON BEAVIS. His hands also up in the Cornholio pose. He \r\n\tstares for a beat, then:",
      "BEAVIS/CORNHOLIO",
      "Are you threatening me?!... I am\r\n\t\t\tCornholio!",
      "Beavis wanders off.",
      "INT.  PRESS ROOM - DAY",
      "The press secretary is giving a conference. The room is packed \r\n\twith reporters.",
      "PRESS SECRETARY",
      "Yes, the president does plan to speak\r\n\t\t\ttoday at the G-PAC conference.",
      "REPORTERS",
      "(raising hands)\r\n\t\t\tMr. Secretary! Mr. Secretary! What about\r\n\t\t\tthe rumors that a biological weapon has\r\n\t\t\tbeen stolen and smuggled out of the\r\n\t\t\tcountry at this conference. Mr. Secretary!",
      "SECRETARY",
      "Those rumors are entirely unfounded...",
      "While this goes on: Through a doorway in the back of the room, we \r\n\tsee Beavis wander out of frame and then come back in.",
      "He starts WOLFING DOWN MORE SUGAR CUBES from a coffee serving \r\n\tcart.",
      "BEAVIS",
      "I am the great Cornholio. I am a gringo...",
      "EXT.  WHITE HOUSE - DAY",
      "IN MONTAGE SHOTS:",
      "A.T.F. and Secret Service agents argue.",
      "Several S.W.A.T. trucks pull up.",
      "S.W.A.T. team guys jump out of trucks and load guns.",
      "INT.  WHITE HOUSE TOUR - DAY",
      "The tour stands in a giant, elegant dining room.",
      "SANDY",
      "This is the State Dining Room where the\r\n\t\t\tmost powerful world leaders are\r\n\t\t\tentertained.",
      "BUTT-HEAD",
      "Uh, where's the TV? Huh huh huh. Hey\r\n\t\t\tBeavis,... Beavis?",
      "Butt-Head wanders off.",
      "BUTT-HEAD (CONT.)",
      "This house sucks.",
      "INT.  HALLWAY OUTSIDE OF OVAL OFFICE - DAY",
      "A Secret Service guard is talking on radio/phone.",
      "GUARD",
      "Evacuation?... Probably just another bomb\r\n\t\t\tthreat or something... OK.",
      "The guard walks off down the hallway, leaving his post.",
      "From the other end of the hallway we see Beavis/Cornholio enter, \r\n\tstill babbling.",
      "INT.  WHITE HOUSE/OVAL OFFICE - DAY",
      "Beavis wanders in and finds no one around. He shouts in \r\n\tfrustration.",
      "BEAVIS/CORNHOLIO",
      "I am the great Cornholio! Heh heh. You\r\n\t\t\twill cooperate with my bunghole!",
      "He picks up the red phone and presses the button again and again.",
      "INT.  STRATEGIC AIR COMMAND - DAY",
      "The war room. A LIEUTENANT picks up the red phone.",
      "A TITLE COMES UP: STRATEGIC AIR COMMAND.",
      "LIEUTENANT",
      "Yes, Mr. President.",
      "BEAVIS/CORNHOLIO",
      "(on phone)\r\n\t\t\tI am Meester President! I have no\r\n\t\t\tbunghole! I am Cornholio!",
      "LIEUTENANT",
      "Mr. President, I can't make out what\r\n\t\t\tyou're saying.",
      "BEAVIS/CORNHOLIO",
      "(on phone)\r\n\t\t\tBungholio! Presidente! I need teepee!",
      "A GENERAL comes by.",
      "LIEUTENANT",
      "(to general)\r\n\t\t\tSir, the President sounds strange.\r\n\t\t\tSomething's going on. I don't think it's a\r\n\t\t\tdrill.",
      "GENERAL",
      "Washington may be under attack. Go to\r\n\t\t\tDefcon 4.",
      "ANGLE ON LIEUTENANT'S HAND, moving to push a button. Alarms sound.",
      "ANGLE ON BIG MAP. A sign flashes: DEFCON 4. Soldiers run through \r\n\tframe.",
      "EXT.  WHITE HOUSE - DAY",
      "The seniors, along with other tourists and dignitaries are \r\n\tescorted out of the building.",
      "INT.  WHITE HOUSE CORRIDOR - DAY",
      "A.T.F. agents rush by. We HOLD here after they go. Butt-Head walks \r\n\tby, unaware.",
      "Butt-Head walks around and opens a door. The door to CHELSEA \r\n\tCLINTON'S room.",
      "Inside, she's folding clothes. (NOTE: If Clinton is not reelected, \r\n\tthe shot will be wider, revealing she's packing a suitcase)",
      "BUTT-HEAD",
      "(excited)\r\n\t\t\tWhoa! Huh huh uh,... (suave) Hey, baby.\r\n\t\t\tHuh huh, I noticed you have braces. So do\r\n\t\t\tI, huh huh.",
      "EXT.  WHITE HOUSE - DAY",
      "We HOLD ON A WIDE SHOT of the back of the White House for a beat. \r\n\tThen:",
      "We see Butt-Head come CRASHING out of a second-story window - \r\n\tthrown by Chelsea. He lands deep in the bushes below.",
      "ANGLE ON the bushes.",
      "BUTT-HEAD",
      "Huh huh huh. That was cool.",
      "We see Butt-Head slowly emerge from the bushes. He looks up, \r\n\tsuddenly seeing:",
      "DOZENS OF A.T.F. AGENTS surround him, rifles trained.",
      "BUTT-HEAD",
      "(awestruck)\r\n\t\t\tThis is the coolest thing I have ever\r\n\t\t\tseen.",
      "Flemming steps up.",
      "FLEMMING",
      "Alright, where's the unit?",
      "BUTT-HEAD",
      "Uh, in my pants?",
      "Bork and others quickly frisk Butt-head.",
      "BORK",
      "Not on him, Chief.",
      "FLEMMING",
      "Agent Hurley...",
      "Hurley steps forward.",
      "FLEMMING (CONT.)",
      "... I want you to give this scumbag a\r\n\t\t\tcavity search. I'm talking Roto-Rooter.\r\n\t\t\tDon't stop 'till you reach the back of his\r\n\t\t\tteeth.",
      "Butt-Head is led away.",
      "INT.  OVAL OFFICE - DAY",
      "Beavis is on the red phone. He goes through the President's \r\n\tdrawers.",
      "LIEUTENANT",
      "(on phone)\r\n\t\t\tMr. President, the bombers are scrambled.\r\n\t\t\tSir, we're awaiting your final orders.",
      "BEAVIS/CORNHOLIO",
      "I order you to surrender your T.P.!",
      "INT.  STRATEGIC AIR COMMAND - DAY",
      "The General grabs the phone from the Lieutenant.",
      "GENERAL",
      "Gimme that! (to phone) Mr. President, in\r\n\t\t\tthe name of all that is holy, I must have\r\n\t\t\tthose launch codes!",
      "BEAVIS/CORNHOLIO",
      "(on phone)\r\n\t\t\tAre you threatening me? Bungholio!",
      "Click. Beavis hangs up.",
      "INT.  WHITE HOUSE/OVAL OFFICE - DAY",
      "Beavis walks out of the Oval Office.",
      "BEAVIS/CORNHOLIO",
      "Presidente Bungholio! You will cooperate\r\n\t\t\twith my bunghole!",
      "INT.  A.T.F. VAN - DAY",
      "Hurley steps out of a van to speak with Flemming and Bork. She \r\n\tpulls off a LONG GLOVE that goes almost to her shoulder.",
      "Butt-Head sits, disheveled.",
      "BUTT-HEAD",
      "Uh, huh huh, did I just score?",
      "HURLEY",
      "He's clean, chief.",
      "FLEMMING",
      "The other guy must have it. He's gotta be\r\n\t\t\tin here somewhere. (re: Butt-Head) Bring\r\n\t\t\thim.",
      "Flemming, Bork and the other agents take off.",
      "INT.  WHITE HOUSE - DAY",
      "In the main reception area, Beavis is surrounded by a few FOREIGN \r\n\tDIGNITARIES who try to make sense of what he is saying.",
      "DIGNITARY #1",
      "Que es un \"bunghole\"? Que lengua es?\r\n\t\t\tArabigo?",
      "DIGNITARY #2",
      "De donde eres tu?",
      "BEAVIS/CORNHOLIO",
      "Arabigo? I am the Great Cornholio. I have\r\n\t\t\tno bunghole. Where I come from there is no",
      "T.P.",
      "A White House representative comes up. He assumes Beavis is with \r\n\tthe dignitaries.",
      "REPRESENTATIVE",
      "I'm terribly sorry for the inconvenience\r\n\t\t\tgentlemen, but we're going to have\r\n\t\t\toutside for a moment. Follow me please.",
      "He leads them out, including Beavis who continues to babble.",
      "BEAVIS/CORNHOLIO",
      "You can run but you cannot hide from the\r\n\t\t\tAlmighty Bunghole! Heh heh hmm.",
      "EXT.  WHITE HOUSE - DAY",
      "Beavis/Cornholio and the dignitaries are escorted out. Beavis, \r\n\tunnoticed, keeps walking.",
      "Beavis, walking along stops. He sees something.",
      "BEAVIS/CORNHOLIO",
      "Aaaaahh...",
      "ON BEAVIS' P.O.V. across the street, we see what Beavis is looking \r\n\tat:",
      "ANDERSON'S CAMPER.",
      "ANGLE ON BEAVIS. He takes the picture of Dallas out of his pocket.",
      "TIGHT ON the picture of Dallas.",
      "TIGHT ON Anderson's camper.",
      "TIGHT ON Beavis.",
      "BEAVIS/CORNHOLIO (CONT.)",
      "Aaaahh, heh heh...",
      "Beavis looks alternately at the camper and the picture a couple of \r\n\ttimes, and then walks across the street.",
      "BEAVIS/CORNHOLIO (CONT.)",
      "Booiiing! Ptang ptang! Wagh-hah!!!",
      "Beavis goes into Anderson's camper and shuts the door.",
      "A Secret Service agent walks by, just missing Beavis.",
      "INT.  WHITE HOUSE/CORRIDOR OF PRESIDENTS - DAY",
      "Tom and Marcy enjoying a moment.",
      "TOM",
      "Boy I tell ya what, it really makes ya\r\n\t\t\tproud. I could stay here all day.",
      "An A.T.F. agent comes up and interrupts Tom.",
      "AGENT",
      "Sir, I'm gonna have to ask you to leave...",
      "TOM",
      "Now wait just a minute...",
      "AGENT",
      "Now!",
      "NEARBY, Flemming and Bork are showing the police sketch of \r\n\tCornholio to Sandy and questioning her.",
      "Bork sees Anderson walk by from a distance.",
      "BORK",
      "Say chief, isn't that guy whose\r\n\t\t\tcamper,...I mean, off in whose...",
      "FLEMMING",
      "(irritated)\r\n\t\t\tNot now Bork.",
      "EXT.  ANDERSON'S CAMPER - DAY",
      "From inside the camper we hear THE STRANGEST CORNHOLIO SOUNDS YET.",
      "ANGLE ON the front of the camper. Tom and Marcy walk up.",
      "TOM",
      "I tell ya what honey, this country's goin'\r\n\t\t\tto Hell in a handbasket.",
      "They get in the front. Tom adjusts the side-view mirror.",
      "TOM (CONT.)",
      "I'm gonna go over right now and talk to my\r\n\t\t\tCongressman about this...",
      "TOM'S P.O.V.: In the side-view mirror we see the camper SHAKING \r\n\tand hear Beavis/Cornholio.",
      "BEAVIS/CORNHOLIO (O.S.)",
      "Ooooaaaaaghhh!!! Whack-awhack-aaaaghh!!!",
      "TOM",
      "What the hell?...Wait here a minute...",
      "Tom gets out and goes into the camper.",
      "HOLD ON THE CAMPER DOOR.",
      "Tom throws Beavis/Cornholio out the door. Beavis is in his \r\n\tunderwear with his T-shirt still pulled over his head.",
      "TOM (CONT.)",
      "And if I ever catch ya whackin' in here\r\n\t\t\tagain I'm gonna hog-tie ya! (to himself)\r\n\t\t\tNow I gotta straighten up in here.",
      "Tom goes back in the camper.",
      "BEAVIS/CORNHOLIO",
      "You have offended my bunghole!",
      "EXT.  WHITE HOUSE - DAY",
      "Bork reports to Flemming. Butt-Head is held by two agents.",
      "BORK",
      "We just cleared all four floors. No sign\r\n\t\t\tof him.",
      "FLEMMING",
      "Damn! Where the hell is he? We should've\r\n\t\t\tfound him by now.",
      "Bork sees something. It's Beavis, about a hundred yards away.",
      "BORK",
      "Chief, look!",
      "FLEMMING",
      "(picks up radio)\r\n\t\t\tAttention all units. We've got him. He's\r\n\t\t\tin front of a camper in the visitor's lot.",
      "EXT.  OUTSIDE ANDERSON'S CAMPER - DAY",
      "Beavis stands, T-shirt still over his head. Suddenly, dozens of \r\n\tagents surround him, pointing guns at him. Beavis seems oblivious \r\n\tto the danger.",
      "BEAVIS/CORNHOLIO",
      "I am the great Cornholio! I will lay waste\r\n\t\t\tto your bunghole! Heh heh.",
      "BEHIND THE AGENTS, Flemming approaches and gives orders.",
      "FLEMMING",
      "OK, nobody shoot. He could still have the\r\n\t\t\tunit on him. Keep your distance. We don't\r\n\t\t\twanna take a chance on hitting it.",
      "BORK",
      "Where are his pants?",
      "FLEMMING",
      "Who knows?",
      "Beavis reaches to scratch his butt. Agents step back, cautious.",
      "Flemming picks up a bullhorn and addresses Beavis.",
      "FLEMMING (CONT.)",
      "This is Agent Flemming, A.T.F.. We won't\r\n\t\t\thurt you. We just want the unit. Tell us\r\n\t\t\twhere the unit is.",
      "BEAVIS/CORNHOLIO",
      "Do you have T.P.? T.P. for my bunghole?",
      "FLEMMING",
      "We'll get you whatever you want. (to\r\n\t\t\tagents) Get that other kid. We might need\r\n\t\t\thim.",
      "BEAVIS/CORNHOLIO",
      "Do you have any oleo? Heh heh.",
      "BORK",
      "(on a radio)\r\n\t\t\tThis is Bork. We need some T.P. and\r\n\t\t\tsome...(to Flemming) What's he say?",
      "ANGLE BEHIND AGENTS. Butt-Head is brought in by two agents.",
      "BUTT-HEAD",
      "Whoa, this rules! Can I have a gun too?\r\n\t\t\tHuh huh huh.",
      "ON BEAVIS. He continues to babble, making the agents nervous.",
      "BEAVIS/CORNHOLIO",
      "You must bow down to the Almighty\r\n\t\t\tBunghole. (Beavis) Heh heh, this is cool.\r\n\t\t\t(Cornholio, chanting) Bungholio-o-o-o-o-o!",
      "FLEMMING",
      "(to Bork)\r\n\t\t\tHe's jerkin' us off. I think we're gonna\r\n\t\t\thave to take him out. Get ready to fire on\r\n\t\t\tmy orders... (on bullhorn) This is your\r\n\t\t\tlast chance. Give us the unit now...",
      "BEAVIS/CORNHOLIO",
      "(Beavis) Why does everyone wanna see my\r\n\t\t\tschlong? (Cornholio, chanting) I am the\r\n\t\t\tone-and-only-almighty-bungholiooo!",
      "FLEMMING",
      "(to agents)\r\n\t\t\tOK boys. Get ready to fire on the count of\r\n\t\t\tthree. (on bullhorn) I'm gonna give you\r\n\t\t\tthree seconds...",
      "ANGLE ON AGENTS taking aim, cocking their guns.",
      "FLEMMING (CONT.)",
      "(on bullhorn)\r\n\t\t\tOne...",
      "ANGLE ON BEAVIS, chanting.",
      "BEAVIS/CORNHOLIO",
      "Cornholio-o-o-o-o...",
      "ANGLE ON BUTT-HEAD.",
      "BUTT-HEAD",
      "Uh, huh huh huh.",
      "FLEMMING",
      "(on bullhorn)\r\n\t\t\t...Two...",
      "BEAVIS/CORNHOLIO",
      "...o-o-o-eieee-ooooeeeooooo...",
      "FLEMMING",
      "(on bullhorn)\r\n\t\t\tThrr...",
      "Suddenly Tom Anderson throws open his camper door, holding Beavis' \r\n\tpants.",
      "TOM",
      "And take yer damn pants with ya...!\r\n\t\t\t(noticing) What in the hell...?",
      "BORK",
      "(pointing)\r\n\t\t\tTHE PANTS!!! He's got the unit!",
      "Suddenly all guns are on Anderson.",
      "FLEMMING",
      "(through bullhorn)\r\n\t\t\tDrop the pants! Now!",
      "TOM",
      "Wait a minute. I ain't the one...",
      "IN SLOW MOTION:",
      "A S.W.A.T. TEAM GUY lunges at Tom, grabbing the pants.",
      "Tom pulls away, causing the pants to RIP. THE UNIT GOES FLYING.",
      "A FROZEN MOMENT. SLOW MOTION.",
      "TIGHT ON THE UNIT.",
      "TIGHT ON FACES IN THE CROWD.",
      "TIGHT ON THE UNIT.",
      "TIGHT ON FLEMMING.",
      "TIGHT ON BUTT-HEAD, LAUGHING IN SLOW MOTION - OBLIVIOUS.",
      "TIGHT ON THE UNIT, FALLING, FALLING.",
      "IT HITS BUTT-HEAD'S HEAD, BOUNCES AND FALLS INTO HIS HANDS.",
      "The agents all stare at Butt-Head - quiet, not sure what to do.",
      "Butt-Head hands it to Flemming, nonchalant.",
      "BUTT-HEAD",
      "Uh, here ya go. Huh huh huh.",
      "The crowd CHEERS.",
      "ON ANDERSON'S CAMPER.",
      "Tom is handcuffed roughly.",
      "TOM",
      "Now wait just a minute...",
      "An agent comes out of the camper with the picture of Dallas. Bork \r\n\tgrabs it and shows it to Tom.",
      "BORK",
      "How do you explain this?",
      "Flemming approaches Tom.",
      "FLEMMING",
      "Sooo, using two innocent teenagers as\r\n\t\t\tpawns in your sick game, huh?",
      "TOM",
      "I don't know what the hell...",
      "FLEMMING",
      "(disgusted)\r\n\t\t\tTake him away.",
      "Anderson is dragged away past a group of young, boy-scout types \r\n\twho shake their heads in shame.",
      "ANGLE ON Beavis and Butt-head being interviewed by a reporter. \r\n\tBeavis is in his underwear. Tom is being dragged away in the \r\n\tbackground.",
      "BEAVIS",
      "I always thought there was something wrong\r\n\t\t\twith him. Heh heh heh.",
      "BUTT-HEAD",
      "Yeah, he had a lot of problems. Huh huh\r\n\t\t\thuh.",
      "BEAVIS",
      "Yeah, and um, he used to hit me too.",
      "BUTT-HEAD",
      "(leaning towards camera)\r\n\t\t\tUh hey, does anyone wanna see my unit?",
      "B&B",
      "Huh huh huh huh huh huh.",
      "DISSOLVE TO:",
      "EXT.  WHITE HOUSE - DAY",
      "Later. Establish. Most A.T.F. cars are pulling out.",
      "INT.  WHITE HOUSE/OVAL OFFICE - DAY",
      "B&B sit as Flemming paces in front of them. Beavis is no longer \r\n\tCornholio.",
      "FLEMMING",
      "I gotta admit, I didn't believe it. I\r\n\t\t\tthought you were scum. But you saved more\r\n\t\t\tlives today than you'll ever know. You led\r\n\t\t\tus to one of the sickest criminals in our\r\n\t\t\thistory. This country owes you a debt.",
      "BUTT-HEAD",
      "Uh, does that mean, like, we're gonna get\r\n\t\t\tmoney and stuff?",
      "BEAVIS",
      "Yeah, and chicks! We were supposed to\r\n\t\t\tscore.",
      "FLEMMING",
      "For security reasons, your actions will\r\n\t\t\thave to remain top secret. But someone\r\n\t\t\tvery special wants to give his thanks.",
      "Flemming motions to the big chair. The PRESIDENT swivels around \r\n\tand rises to shake hands with B&B.",
      "PRESIDENT",
      "Beavis and Butt-Head. On behalf of all\r\n\t\t\tyour fellow Americans, I extend my deepest\r\n\t\t\tthanks. You exemplify a fine new crop of\r\n\t\t\tyoung Americans who will grow into the\r\n\t\t\tleaders of this great country.",
      "BUTT-HEAD",
      "Huh huh huh. He said crap. Huh huh.",
      "BEAVIS",
      "Heh heh. This guy's cool.",
      "PRESIDENT",
      "In recognition for your great service, I'm\r\n\t\t\tappointing you honorary agents in the\r\n\t\t\tBureau of Alcohol, Tobacco and Firearms.",
      "BUTT-HEAD",
      "Whoa, huh huh!!!",
      "The President hands them citations.",
      "BUTT-HEAD (CONT.)",
      "You hear that, Beavis! We're gonna get\r\n\t\t\talcohol, tobacco and guns!",
      "BEAVIS",
      "Yeah, maybe some chicks too. Heh heh.",
      "B&B leave the office, muttering.",
      "BUTT-HEAD",
      "Cigarettes and beer rule! Huh huh.",
      "BEAVIS",
      "Yeah! We're with the bureau of cigarettes\r\n\t\t\tand chicks! We're gonna score!",
      "B&B",
      "Huh huh huh huh huh.",
      "EXT.  AIRPORT NEAR B&B'S HOMETOWN - DAY",
      "A plane lands.",
      "INT.  PLANE/DOOR - DAY",
      "As before, the flight crew stares in horror and silence as B&B \r\n\tdeplane.",
      "BUTT-HEAD",
      "Uh... bye-bye.",
      "BEAVIS",
      "Heh heh. Bye bye. Heh heh.",
      "EXT.  ELITE MOTEL LODGE BAR - DAY",
      "Walking home, B&B pass the motel. They notice the sign for big \r\n\tscreen TV. They stop and look at it.",
      "BUTT-HEAD",
      "You know what else sucks? We never even\r\n\t\t\tgot a TV.",
      "ON BEAVIS, seeing something, amazed, ecstatic.",
      "BEAVIS",
      "Heh mmm, hey mmm Butt-Head! Look!",
      "Heavenly MUSIC. B&B stare at the wonder before them.",
      "ANGLE ON THEIR TV, mangled, partly-crushed junk.",
      "B&B",
      "Yes! Yes! Yes! Huh huh huh.",
      "B&B run up to the set like it was their lost and found dog.",
      "EXT.  RESIDENTIAL STREET - DAY",
      "B&B walk off into the distance with the TV.",
      "BEAVIS",
      "Hey Butt-Head, do you think we're ever\r\n\t\t\tgonna score?",
      "BUTT-HEAD",
      "Uh, I probably will, but not you. You're\r\n\t\t\ttoo much of a butt-monkey. Huh huh.",
      "BEAVIS",
      "Shut up, dill-hole.",
      "BUTT-HEAD",
      "Butt-dumpling...",
      "BEAVIS",
      "Turd-burglar...",
      "BUTT-HEAD",
      "Dill-wad...",
      "BEAVIS",
      "Bunghole...",
      "BUTT-HEAD",
      "Butt-snatch...",
      "BEAVIS",
      "Um, uh, butt... um, hole. Butt-hole...",
      "BUTT-HEAD",
      "Uh... dill, um, face...",
      "BEAVIS",
      "Um... ass... head...",
      "BUTT-HEAD",
      "Uh... butt-snatch...",
      "BEAVIS",
      "You already said that, Butt-Head.",
      "BUTT-HEAD",
      "Oh, uh, I mean, uh, ass-goblin...",
      "B&B",
      "Huh huh huh...",
      "B&B head off into the sunset, trading lame insults as we FADE OUT.",
      "END"
    ],
  }
]
