[
{
  "title": "Apartment, The Script",
  "writers": "Written by Billy Wilder,I.A.L Diamond",
  "a_url": "https://imsdb.com/genre/Comedy/Movie Scripts/Apartment, The Script.html",
  "screenplay_text": [
    "The Apartment by Billy Wilder and I.A.L. Diamond",
    "THE APARTMENT",
    "by\r\n\r\n            Billy Wilder and I.A.L. Diamond",
    "THE APARTMENT",
    "A DESK COMPUTER",
    "A man's hand is punching out a series of figures on the\r\nkeyboard.",
    "BUD (V.O.)",
    "On November first, 1959, the\r\n            population of New York City was\r\n            8,042,783.  if you laid all these\r\n            people end to end, figuring an\r\n            average height of five feet six and\r\n            a half inches, they would reach\r\n            from Times Square to the outskirts\r\n            of Karachi, Pakistan.  I know facts\r\n            like this because I work for an\r\n            insurance company --",
    "THE INSURANCE BUILDING - A WET, FALL DAY",
    "It's a big mother, covering a square block in lower\r\nManhattan, all glass and aluminum, jutting into the leaden\r\nsky.",
    "BUD (V.O.)",
    "-- Consolidated Life of New York.\r\n            We are one of the top five companies\r\n            in the country -- last year we\r\n            wrote nine-point-three billion\r\n            dollars worth of policies.  Our\r\n            home office has 31,259 employees --\r\n            which is more than the entire\r\n            population of Natchez, Mississippi,\r\n            of Gallup, New Mexico.",
    "INT. NINETEENTH FLOOR",
    "Acres of gray steel desk, gray steel filing cabinets, and\r\nsteel-gray faces under indirect light.  One wall is lined\r\nwith glass-enclosed cubicles for the supervisory personnel.\r\nIt is all very neat, antiseptic, impersonal.  The only human\r\ntough is supplied by a bank of IBM machines, clacking away\r\ncheerfully in the background.",
    "BUD (V.O.)",
    "I work on the nineteenth floor --\r\n            Ordinary Policy Department -\r\n            Premium Accounting Division -\r\n            Section W -- desk number 861.",
    "DESK 861",
    "Like every other desk, it has a small name plate attached to\r\nthe side.  This one reads C.C. BAXTER.",
    "BUD (V.O.)",
    "My name is C.C. Baxter - C. for\r\n            Calvin, C. for Clifford -- however,\r\n            most people call me Bud. I've been\r\n            with Consolidated Life for three\r\n            years and ten months.  I started in\r\n            the branch office in Cincinnati,\r\n            then transferred to New York.  My\r\n            take-home pay is $94.70 a week, and\r\n            there are the usual fringe benefits.\r\n\r\nBAXTER is about thirty, serious, hard-working, unobtrusive.\r\nHe wears a Brooks Brothers type suit, which he bought\r\nsomewhere on Seventh Avenue, upstairs.  There is a stack of\r\nperforated premium cards in front of him, and he is totaling\r\nthem on the computing machine.  He looks off.",
    "ELECTRIC WALL CLOCK",
    "It shows 5:19.  With a click, the minute hand jumps to 5:20,\r\nand a piercing bell goes off.",
    "BUD (V.O.)",
    "The hours in our department are\r\n            8:50 to 5:20 --",
    "FULL SHOT - OFFICE",
    "Instantly all work stops.  Papers are being put away,\r\ntypewriters and computing machines are covered, and everybody\r\nstarts clearing out.  Within ten seconds, the place is\r\nempty -- except for Bud Baxter, still bent over his work,\r\nmarooned in a sea of abandoned desks.",
    "BUD (V.O.)",
    "-- they're staggered by floors, so\r\n            that sixteen elevators can handle\r\n            the 31,259 employees without a\r\n            serious traffic jam.  As for\r\n            myself, I very often stay on at the\r\n            office and work for an extra hour\r\n            or two -- especially when the\r\n            weather is bad.  It's not that I'm\r\n            overly ambitious -- it's just a way\r\n            of killing time, until it's all\r\n            right for me to go home.\r\n            You see, I have this little problem\r\n            with my apartment --",
    "DISSOLVE TO:",
    "STREET IN THE WEST SIXTIES - EVENING",
    "Bud, wearing a weather-beaten Ivy League raincoat and a\r\nnarrow-brimmed brown hat, comes walking slowly down the\r\nstreet skirting the puddles on the sidewalk.  He stops in\r\nfront of a converted brownstone, looks up.",
    "BUD (V.O.)",
    "I live in the West Sixties - just\r\n            half a block from Central Park.  My\r\n            rent is $84 a month.  It used to be\r\n            eighty until last July when Mrs.\r\n            Lieberman, the landlady, put in a\r\n            second-hand air conditioning unit.\r\n\r\nThe windows on the second floor are lit, but the shades are\r\ndrawn.  From inside drifts the sound of cha cha music.",
    "BUD (V.O.)",
    "It's a real nice apartment -\r\n            nothing fancy -- but kind of\r\n            cozy -- just right for a bachelor.\r\n            The only problem is - I can't\r\n            always get in when I want to.",
    "INT. THE APARTMENT - EVENING",
    "What used to be the upstairs parlor of a one-family house in\r\nthe early 1900's has been chopped up into living room,\r\nbedroom, bathroom and kitchen.  The wallpaper is faded, the\r\ncarpets are threadbare, and the upholstered furniture could\r\nstand shampooing.  There are lots of books, a record player,\r\nstacks of records, a television set (21 inches and 24\r\npayments), unframed prints from the Museum of Modern Art\r\n(Picasso, Braque, Klee) tacked up on the walls.\r\n\r\nOnly one lamp is lit, for mood, and a cha cha record is\r\nspinning around on the phonograph.  On the coffee table in\r\nfront of the couch are a couple of cocktail glasses, a\r\npitcher with some martini dregs, an almost empty bottle of\r\nvodka, a soup bowl with a few melting ice cubes at the\r\nbottom, some potato chips, an ashtray filled with cigar\r\nstubs and lipstick-stained cigarette butts, and a woman's\r\nhandbag.\r\n\r\nMR. KIRKEBY, a dapper, middle-aged man, stands in front of\r\nthe mirror above the fake fireplace, buttoning up his vest.\r\nHe does not notice that the buttons are out of alignment.",
    "KIRKEBY",
    "(calling off)\r\n            Come on, Sylvia.  It's getting late.\r\n\r\nSYLVIA, a first baseman of a dame, redheaded and saftig,\r\ncomes cha cha-ing into the room, trying to fasten a necklace\r\nas she hums along with the music.  She dances amorously up\r\nto Kirkeby.",
    "KIRKEBY",
    "Cut it out, Sylvia.  We got to get\r\n            out of here.\r\n\r\nHe helps her with the necklace, then turns off the phonograph.",
    "SYLVIA",
    "What's the panic?  I'm going to\r\n            have another martooni.\r\n\r\nShe crosses to the coffee table, starts to pour the remnants\r\nof the vodka into the pitcher.",
    "KIRKEBY",
    "Please, Sylvia!  It's a quarter to\r\n            nine!",
    "SYLVIA",
    "(dropping slivers of\r\n                   ice into the pitcher)\r\n            First you can't wait to get me up\r\n            here, and now -- rush, rush, rush!\r\n            Makes a person feel cheap.",
    "KIRKEBY",
    "Sylvia -- sweetie -- it's not\r\n            that -- but I promised the guy I'd\r\n            be out of here by eight o'clock,\r\n            positively.",
    "SYLVIA",
    "(pouring martini)\r\n            What guy?  Whose apartment is this,\r\n            anyway?",
    "KIRKEBY",
    "(exasperated)\r\n            What's the difference?  Some\r\n            schnook that works in the office.",
    "EXT. BROWNSTONE HOUSE - EVENING",
    "Bud is pacing back and forth, throwing an occasional glance\r\nat the lit windows of his apartment.  A middle-aged woman\r\nwith a dog on a leash approaches along the sidewalk.\r\n\r\nShe is MRS. LIEBERMAN, the dog is a Scottie, and they are\r\nboth wearing raincoats.  Seeing them, Bud leans casually\r\nagainst the stoop.",
    "MRS. LIEBERMAN",
    "Good evening, Mr. Baxter.",
    "BUD",
    "Good evening, Mrs. Lieberman.",
    "MRS. LIEBERMAN",
    "Some weather we're having.  Must be\r\n            from all the meshugass at Cape\r\n            Canaveral.\r\n                   (she is half-way up\r\n                   the steps)\r\n            You locked out of your apartment?",
    "BUD",
    "No, no.  Just waiting for a friend.\r\n            Good night, Mrs. Lieberman.",
    "MRS. LIEBERMAN",
    "Good night, Mr. Baxter.\r\n\r\nShe and the Scottie disappear into the house.  Bud resumes\r\npacing, his eyes on the apartment windows.  Suddenly he\r\nstops -- the lights have gone out.",
    "INT. SECOND FLOOR LANDING - EVENING",
    "Kirkeby, in coat and hat, stands in the open doorway of the\r\ndarkened apartment.",
    "KIRKEBY",
    "Come on -- come on, Sylvia!\r\n\r\nSylvia comes cha cha-ing out, wearing an imitation Persian\r\nlamb coat, her hat askew on her head, bag, gloves, and an\r\numbrella in her hand.",
    "SYLVIA",
    "Some setup you got here.  A real,\r\n            honest-to-goodness love nest.",
    "KIRKEBY",
    "Sssssh.\r\n\r\nHe locks the door, slips the key under the doormat.",
    "SYLVIA",
    "(still cha cha-ing)\r\n            You're one button off, Mr. Kirkeby.\r\n\r\nShe points to his exposed vest.  Kirkeby looks down, sees\r\nthat the buttons are out of line.  He starts to rebutton\r\nthem as they move down the narrow, dimly-lit stairs.",
    "SYLVIA",
    "You got to watch those things.\r\n            Wives are getting smarter all the\r\n            time.  Take Mr. Bernheim -- in the\r\n            Claims Department -- came home one\r\n            night with lipstick on his shirt --\r\n            told his wife he had a shrimp\r\n            cocktail for lunch -- so she took\r\n            it out to the lab and had it\r\n            analyzed -- so now she has the\r\n            house in Great Neck and the children\r\n            and the new Jaguar --",
    "KIRKEBY",
    "Don't you ever stop talking?",
    "EXT. BROWNSTONE HOUSE - EVENING",
    "Bud, standing on the sidewalk, sees the front door start to\r\nopen.  He moves quickly into the areaway, almost bumping\r\ninto the ashcans, stands in the shadow of the stoop with his\r\nback turned discreetly toward Kirkeby and Sylvia as they\r\ncome down the steps.",
    "KIRKEBY",
    "Where do you live?",
    "SYLVIA",
    "I told you -- with my mother.",
    "KIRKEBY",
    "Where does she live?",
    "SYLVIA",
    "A hundred and seventy-ninth\r\n            street -- the Bronx.",
    "KIRKEBY",
    "All right -- I'll take you to the\r\n            subway.",
    "SYLVIA",
    "Like hell you will.  You'll buy me\r\n            a cab.",
    "KIRKEBY",
    "Why do all you dames have to live\r\n            in the Bronx?",
    "SYLVIA",
    "You mean you bring other girls up\r\n            here?",
    "KIRKEBY",
    "Certainly not.  I'm a happily\r\n            married man.\r\n\r\nThey move down the street.  Bud appears from the areaway,\r\nglances after them, then mounts the steps, goes through the\r\nfront door.",
    "INT. VESTIBULE - EVENING",
    "There are eight mailboxes.  Bud opens his, takes out a\r\nmagazine in a paper wrapper and a few letters, proceeds up\r\nthe staircase.",
    "INT. SECOND FLOOR LANDING - EVENING",
    "Bud, glancing through his mail, comes up to the door of his\r\napartment.  As he bends down to lift the doormat, the door\r\nof the rear apartment opens and MRS. DREYFUSS, a jovial\r\nwell-fed middle-aged woman, puts out a receptacle full of\r\nold papers and empty cans.  Bud looks around from his bent\r\nposition.",
    "BUD",
    "Oh.  Hello there, Mrs. Dreyfuss.",
    "MRS. DREYFUSS",
    "Something the matter?",
    "BUD",
    "I seem to have dropped my key.\r\n                   (faking a little search)\r\n            Oh -- here it is.\r\n\r\nHe slides it out from under the mat, straightens up.",
    "MRS. DREYFUSS",
    "Such a racket I heard in your\r\n            place -- maybe you had burglars.",
    "BUD",
    "Oh, you don't have to worry about\r\n            that -- nothing in there that\r\n            anybody would want to steal...\r\n                   (unlocking door quickly)\r\n            Good night, Mrs. Dreyfuss.\r\n\r\nHe ducks into the apartment.",
    "INT. THE APARTMENT - EVENING",
    "Bud snaps on the lights, drops the mail and the key on a\r\nsmall table, looks around with distaste at the mess his\r\nvisitors have left behind.  He sniffs the stale air, crosses\r\nto the window, pulls up the shade, opens it wide.  Now he\r\ntakes off his hat and raincoat, gathers up the remains of\r\nthe cocktail party from the coffee table.  Loaded down with\r\nglasses, pitcher, empty vodka bottle, ice bowl and potato\r\nchips, he starts toward the kitchen.\r\n\r\nThe doorbell rings.  Bud stops, undecided what to do with\r\nthe stuff in his hands, then crosses to the hall door,\r\nbarely manages to get it open.  Mr. Kirkeby barges in past\r\nhim.",
    "KIRKEBY",
    "The little lady forgot her galoshes.\r\n\r\nHe scours the room for the missing galoshes.",
    "BUD",
    "Mr. Kirkeby, I don't like to\r\n            complain -- but you were supposed\r\n            to be out of here by eight.",
    "KIRKEBY",
    "I know, Buddy-boy, I know.  But\r\n            those things don't always run on\r\n            schedule -- like a Greyhound bus.",
    "BUD",
    "I don't mind in the summer -- but\r\n            on a rainy night -- and I haven't\r\n            had any dinner yet --",
    "KIRKEBY",
    "Sure, sure.  Look, kid -- I put in\r\n            a good word for you with Sheldrake,\r\n            in Personnel.",
    "BUD",
    "(perking up)\r\n            Mr. Sheldrake?",
    "KIRKEBY",
    "That's right.  We were discussing\r\n            our department -- manpower-wise --\r\n            and promotion-wise --\r\n                   (finds the galoshes\r\n                   behind a chair)\r\n            -- and I told him what a bright boy\r\n            you were.  They're always on the\r\n            lookout for young executives.",
    "BUD",
    "Thank you, Mr. Kirkeby.",
    "KIRKEBY",
    "(starting toward door)\r\n            You're on your way up, Buddy-boy.\r\n            And you're practically out of liquor.",
    "BUD",
    "I know.  Mr. Eichelberger -- in the\r\n            Mortgage Loan Department -- last\r\n            night he had a little Halloween\r\n            party here --",
    "KIRKEBY",
    "Well, lay in some vodka and some\r\n            vermouth -- and put my name on it.",
    "BUD",
    "Yes, Mr. Kirkeby.  You still owe me\r\n            for the last two bottles --",
    "KIRKEBY",
    "I'll pay you on Friday.\r\n                   (in the open doorwaY)\r\n            And whatever happened to those\r\n            little cheese crackers you used to\r\n            have around?\r\n\r\nHe exits, shutting the door.",
    "BUD",
    "(making a mental note)\r\n            Cheese crackers.\r\n\r\nHe carries his load into the kitchen.\r\n\r\nThe kitchen is minute and cluttered.  On the drainboard are\r\nan empty vermouth bottle, some ice-cube trays, a jar with\r\none olive in it, and a crumpled potato-chip bag.\r\n\r\nBud comes in, dumps his load on the drainboard, opens the\r\nold-fashioned refrigerator.  He takes out a frozen chicken\r\ndinner, turns the oven on, lights it with a match, rips the\r\nprotective paper off the aluminum tray and shoves it in.\r\n\r\nNow he starts to clean up the mess on the drainboard.  He\r\nrinses the cocktail glasses, is about to empty the martini\r\npitcher into the sink, thinks better of it.  He pours the\r\ncontents into a glass, plops the lone olive out of the jar,\r\nscoops up the last handful of potato chips, toasts an\r\nimaginary companion, and drinks up.  Then he pulls a\r\nwastebasket from under the sink.\r\n\r\nIt is brimful of liquor bottles, and Bud adds the empty\r\nvodka and vermouth bottles and the olive jar.  Picking up\r\nthe heavy receptacle, he carries it through the living room\r\ntoward the hall door.",
    "INT. SECOND FLOOR LANDING - EVENING",
    "The door of Bud's apartment opens, and Bud comes out with\r\nthe wastebasket full of empty bottles.  Just then, DR. DAVID\r\nDREYFUSS, whose wife we met earlier, comes trudging up the\r\nstairs.  He is a tall, heavy-set man of fifty, with a bushy\r\nmustache, wearing a bulky overcoat and carrying an aged\r\nmedical bag.",
    "DR. DREYFUSS",
    "Good evening, Baxter.",
    "BUD",
    "Hi, Doc.  Had a late call?",
    "DR. DREYFUSS",
    "Yeah.  Some clown at Schrafft's\r\n            57th Street ate a club sandwich,\r\n            and forgot to take out the toothpick.",
    "BUD",
    "Oh.\r\n                   (sets down wastebasket)\r\n            'Bye, Doc.",
    "DR. DREYFUSS",
    "(indicating bottles)\r\n            Say, Baxter -- the way you're\r\n            belting that stuff, you must have a\r\n            pair of cast-iron kidneys.",
    "BUD",
    "Oh, that's not me.  It's just that\r\n            once in a while, I have some people\r\n            in for a drink.",
    "DR. DREYFUSS",
    "As a matter of fact, you must be an\r\n            iron man all around. From what I\r\n            hear through the walls, you got\r\n            something going for you every night.",
    "BUD",
    "I'm sorry if it gets noisy --",
    "DR. DREYFUSS",
    "Sometimes,  there's a twi-night\r\n            double-header.\r\n                   (shaking his head)\r\n            A nebbish like you!",
    "BUD",
    "(uncomfortable)\r\n            Yeah.  Well -- see you, Doc.\r\n                   (starts to back\r\n                   through door)",
    "DR. DREYFUSS",
    "You know, Baxter -- I'm doing some\r\n            research at the Columbia Medical\r\n            Center -- and I wonder if you could\r\n            do us a favor?",
    "BUD",
    "Me?",
    "DR. DREYFUSS",
    "When you make out your will -- and\r\n            the way you're going, you should --\r\n            would you mind leaving your body to\r\n            the University?",
    "BUD",
    "My body?  I'm afraid you guys would\r\n            be disappointed.  Good night, Doc.",
    "DR. DREYFUSS",
    "Slow down, kid.\r\n\r\nHe starts into the rear apartment as Bud closes the door.",
    "INT. THE APARTMENT - EVENING",
    "Bud, loosening his tie, goes into the kitchen, opens the\r\noven, turns off the gas.  He takes a coke out of the\r\nrefrigerator, uncaps it, gets a knife and fork from a\r\ndrawer, and using his handkerchief as a potholder, pulls the\r\nhot aluminum tray out of the oven.  He carries everything\r\nout into the living room.\r\n\r\nIn the living room, Bud sets his dinner down on the coffee\r\ntable, settles himself on the couch.  He rears up as\r\nsomething stabs him, reaches under his buttocks, pulls out a\r\nhairpin.  He drops it into an ashtray, tackles his dinner.\r\nWithout even looking, he reaches over to the end table and\r\npresses the remote TV station-selector.  He takes a sip from\r\nthe coke bottle, his eyes on the TV screen across the room.\r\n\r\nThe picture on the TV set jells quickly.  Against a\r\nbackground of crisscrossing searchlights, a pompous announcer\r\nis making his spiel.",
    "ANNOUNCER",
    "-- from the world's greatest\r\n            library of film classics, we\r\n            proudly present --\r\n                   (fanfare)\r\n            Greta Garbo -- John Barrymore --\r\n            Joan Crawford -- Wallace Beery --\r\n            and Lionel Barrymore in --\r\n                   (fanfare)",
    "GRAND HOTEL!",
    "There is an extended fanfare.  Bud leans forward, chewing\r\nexcitedly on a chicken leg.",
    "ANNOUNCER",
    "But first, a word from our sponsor.\r\n            If you smoke the modern way, don't\r\n            be fooled by phony filter claims --\r\n\r\nBud, still eating, automatically reaches for the station-\r\nselector, pushes the button.\r\n\r\nA new channel pops on.  It features a Western -- Cockamamie\r\nIndians are attacking a stagecoach.\r\n\r\nThat's not for Bud.  He switches to another station.  In a\r\nfrontier saloon, Gower Street cowboys are dismantling the\r\nfurniture and each other.\r\n\r\nBud wearily changes channels.  But he can't get away from\r\nWesterns -- on this station, the U.S. Cavalry is riding to\r\nthe rescue.  Will they get there in time?\r\n\r\nBud doesn't wait to find out.  He switches channels again,\r\nand is back where he started.\r\n\r\nOn the screen, once more, is the announcer standing in front\r\nof the crisscrossing searchlights.",
    "ANNOUNCER",
    "And now, Grand Hotel -- starring\r\n            Greta Garbo, John Barrymore, Joan\r\n            Crawford --\r\n                   (Bud is all eyes and\r\n                   ears again)\r\n            -- Wallace Beery, and Lionel\r\n            Barrymore.  But first -- a word\r\n            from our alternate sponsor.\r\n                   (unctuously)\r\n            Friends, do you have wobbly\r\n            dentures -- ?\r\n\r\nThat does it.  Bud turns the set off in disgust.\r\n\r\nThe TV screen blacks out, except for a small pinpoint of\r\nlight in the center, which gradually fades away.\r\n\r\nIn the bathroom, Bud, in pajamas by now, is brushing his\r\nteeth.  From the shower rod hang three pairs of socks on\r\nstretchers.  Bud takes a vial from the medicine shelf,\r\nshakes out a sleeping pill, washes it down with a glass of\r\nwater.  He turns the light off, walks into the bedroom.\r\n\r\nIn the bedroom, the single bed is made, and the lamp on the\r\nnight table is on.  Bud plugs in the electric blanket, turns\r\nthe dial on.  Then he climbs into bed, props up the pillow\r\nbehind him.  From the night table, he picks up the magazine\r\nthat arrived in the mail, slides it out of the wrapper,\r\nopens it.  It's the new issue of PLAYBOY.  Bud leafs through\r\nit till he comes to the piece de resistance of the magazine.\r\nHe unfolds the overleaf, glances at it casually, refolds it,\r\nthen turns to the back of the magazine and starts to read.\r\n\r\nWhat he is so avidly interested in is the men's fashion\r\nsection.  There is a layout titled WHAT THE YOUNG EXECUTIVE\r\nWILL WEAR with a sub-head reading The Bowler is Back.\r\nIllustrating the article are several photographs of male\r\nmodels wearing various styles of bowlers.\r\n\r\nBud is definitely in the market for a bowler, but somehow\r\nhis mind starts wandering.  He turns back to the overleaf\r\nagain, unfolds it, studies it, then holds the magazine up\r\nvertically to get a different perspective on the subject.\r\nBy now the sleeping pill is beginning to take effect, and he\r\nyawns.  He drops the magazine on the floor, kills the light,\r\nsettles down to sleep.  The room is dark except for the glow\r\nfrom the dial of the electric blanket.\r\n\r\nThree seconds.  Then the phone jangles shrilly in the living\r\nroom.  Bud stumbles groggily out of bed, and putting on his\r\nslippers, makes his way into the living room.  He switches\r\non the light, picks up the phone.",
    "BUD",
    "Hello? -- Hello? -- yes, this is\r\n            Baxter.",
    "INT. PHONE BOOTH IN A MANHATTAN BAR - NIGHT",
    "On the night is a hearty man of about forty-five, nothing\r\ngut personality, most of it obnoxious.  His name is DOBISCH.\r\n\r\nOutside the booth is a blonde babe, slightly boozed, and\r\nbeyond there is a suggestion of the packed, smoky joint.",
    "DOBISCH",
    "Hiya, Buddy-boy.  I'm in this bar\r\n            on Sixty-first Street -- and I got\r\n            to thinking about you -- and I\r\n            figured I'd give you a little buzz.",
    "BUD - ON PHONE",
    "BUD",
    "Well, that's very nice of you --\r\n            but who is this?",
    "INT. PHONE BOOTH",
    "DOBISCH",
    "Dobisch -- Joe Dobisch, in\r\n            Administration.",
    "BUD - ON PHONE",
    "BUD",
    "(snapping to attention)\r\n            Oh, yes, Mr. Dobisch.  I didn't\r\n            recognize your voice --",
    "INT. PHONE BOOTH",
    "DOBISCH",
    "That's okay, Buddy-boy.  Now like I\r\n            was saying, I'm in this joint on\r\n            Sixty-first -- and I think I got\r\n            lucky --\r\n                   (glances toward blonde)\r\n            -- she's a skater with the Ice\r\n            Show --\r\n                   (he chuckles)\r\n            -- and I thought maybe I could\r\n            bring her up for a quiet drink.",
    "BUD - ON PHONE",
    "BUD",
    "I'm sorry, Mr. Dobisch.  You know I\r\n            like to help you guys out -- but\r\n            it's sort of late -- so why don't\r\n            we make it some other time?",
    "INT. PHONE BOOTH",
    "DOBISCH",
    "Buddy-boy -- she won't keep that\r\n            long -- not even on ice.  Listen,\r\n            kid, I can't pass this up -- she\r\n            looks like Marilyn Monroe.",
    "BUD - ON PHONE",
    "BUD",
    "I don't care if it is Marilyn\r\n            Monroe -- I'm already in bed -- and\r\n            I've taken a sleeping pill -- so\r\n            I'm afraid the answer is no.",
    "INT. PHONE BOOTH",
    "DOBISCH",
    "(pulling rank)\r\n            Look, Baxter -- we're making out\r\n            the monthly efficiency rating --\r\n            and I'm putting you in the top ten.\r\n            Now you don't want to louse yourself\r\n            up, do you?",
    "BUD - ON PHONE",
    "BUD",
    "Of course not.  But -- how can I be\r\n            efficient in the office if I don't\r\n            get enough sleep at night?",
    "INT. PHONE BOOTH",
    "DOBISCH",
    "It's only eleven -- and I just want\r\n            the place for forty-five minutes.\r\n\r\nThe blonde opens the door of the phone booth, leans in.",
    "BLONDE",
    "I'm getting lonely.  Who are you\r\n            talking to, anyway?",
    "DOBISCH",
    "My mother.",
    "BLONDE",
    "That's sweet.  That's real sweet.\r\n\r\nDobisch shuts the door in her face.",
    "DOBISCH",
    "(into phone again)\r\n            Make it thirty minutes.  What do\r\n            you say, Bud?",
    "BUD - ON PHONE",
    "BUD",
    "(a last stand)\r\n            I'm all out of liquor -- and\r\n            there's no clean glasses -- no\r\n            cheese crackers -- no nothing.",
    "INT. PHONE BOOTH",
    "DOBISCH",
    "Let me worry about that.  Just\r\n            leave the key under the mat and\r\n            clear out.",
    "INT. THE APARTMENT",
    "BUD",
    "(into phone; resigned)\r\n            Yes, Mr. Dobisch.\r\n\r\nHe hangs up, shuffles back into the bedroom.",
    "BUD",
    "(muttering to himself)\r\n            Anything you say, Mr. Dobisch -- no\r\n            trouble at all, Mr. Dobisch -- be\r\n            my guest --\r\n\r\nHe reappears from the bedroom, pulling his trousers on over\r\nhis pajama pants.",
    "BUD",
    "-- We never close at Buddy-boy's --\r\n            looks like Marilyn Monroe --\r\n                   (he chuckles a la Dobisch)\r\n\r\n\r\nPutting on his raincoat and hat, Bud opens the hall door,\r\ntakes the key from the table, shoves it under the doormat.\r\nHis eyes fall on the Dreyfuss apartment, and there is some\r\nconcern on his face.  He picks up a pad and pencil from the\r\ntable, prints something in block letters.  Tearing off the\r\ntop sheet, he impales it on the spindle of the phonograph,\r\nthen walks out, closing the door behind him.  The note reads:",
    "NOT TOO LOUD",
    "THE NEIGHBORS ARE COMPLAINING",
    "EXT. BROWNSTONE HOUSE - NIGHT",
    "Bud comes out the door, in slippered feet, pants and raincoat\r\nover his pajamas.  As he sleep-walks down the steps, a cab\r\npulls up in front of the house.  Bud ducks discreetly into\r\nthe areaway.  Mr. Dobisch, bareheaded, emerges cautiously\r\nfrom the cab.  Between the fingers of his hands he is\r\ncarrying four long-stemmed glasses, brimful of stingers.\r\nThe blonde steps out, holding his hat.",
    "BLONDE",
    "This the place?",
    "DOBISCH",
    "Yeah.\r\n                   (to cab driver)\r\n            How much?",
    "CABBIE",
    "Seventy cents.\r\n\r\nDobisch, his hands full of stingers, turns to the blonde,\r\nindicates his pants pocket.",
    "DOBISCH",
    "Get the money, will you?\r\n\r\nThe blonde plants the hat on top of his head, unbuttons his\r\novercoat, reaches into his pants pocket.  As she does so,\r\nshe jogs his elbow.",
    "DOBISCH",
    "Watch those stingers!\r\n\r\nThe blonde has taken out Dobisch's money clip, with about a\r\nhundred dollars in it.",
    "DOBISCH",
    "Give him a buck.\r\n\r\nThe blonde peels a bill off, hands it to the cabbie, hangs\r\non to the rest of the roll just a second too long.",
    "DOBISCH",
    "Now put it back, honey.\r\n                   (she does)\r\n            Atta girl.\r\n\r\nThe cab drives off.  Dobisch and the blonde start up the\r\nsteps to the house.",
    "BLONDE",
    "You sure this is a good idea?",
    "DOBISCH",
    "Can't think of a better one.",
    "BLONDE",
    "(holding door open\r\n                   for him)\r\n            I mean - barging in on your\r\n            mother -- in the middle of the night?",
    "DOBISCH",
    "(edging past her with stingers)\r\n            Don't worry about the old lady.\r\n            One squawk from her, and she's out\r\n            of a job.\r\n\r\nIn the areaway, Bud has overheard them, and it doesn't make\r\nhim any happier.  He steps out on the sidewalk, shuffles\r\ndown the street.",
    "INT. SECOND FLOOR LANDING - NIGHT",
    "The blonde and Dobisch, his hands full of stingers, come up\r\nto Bud's door.",
    "DOBISCH",
    "Get the key, will you.\r\n\r\nAutomatically, she reaches into his pocket.",
    "DOBISCH",
    "Not there.  Under the mat.",
    "BLONDE",
    "(puzzled)\r\n            Under the mat?\r\n                   (picks up key)",
    "DOBISCH",
    "(impatiently)\r\n            Open up, open up -- we haven't got\r\n            all night.\r\n\r\nThe blonde unlocks the door to the apartment, opens it.",
    "BLONDE",
    "(suspiciously)\r\n            So this is your mother's apartment?",
    "DOBISCH",
    "That's right.  Maria Ouspenskaya.",
    "BLONDE",
    "(sticking her head in)\r\n            Hiya, Ouspenskaya.\r\n\r\nDobisch nudges her inside with his knee, kicks the door shut\r\nbehind him.\r\n\r\nThe landing is empty for a second.  Then the door of the\r\nrear apartment opens, and Dr. Dreyfuss, in a beaten bathrobe,\r\nsets out a couple of empty milk bottles with a note in them.\r\nSuddenly, from Bud's apartment, comes a shrill female giggle.\r\nDr. Dreyfuss reacts.  Then the cha cha music starts full\r\nblast.",
    "DR. DREYFUSS",
    "(calling to his wife,\r\n                   off-screen)\r\n            Mildred -- he's at it again.\r\n\r\nShaking his head, he closes the door.",
    "EXT. CENTRAL PARK - NIGHT",
    "Bud, in raincoat and slippered feet, turns in off the\r\nstreet, plods along a path in the deserted park.  He stops\r\nat a damp bench under a lamp post, sits.  In the background,\r\nlights shine from the towering buildings on Central Park\r\nSouth.\r\n\r\nBud huddles inside his raincoat, shivering.  He is very\r\nsleepy by now.  His eyes close and his head droops.  A gust\r\nof wind sends wet leaves swirling across the bench.  Bud\r\ndoesn't stir.  He is all in.",
    "FADE OUT.",
    "FADE IN:",
    "INT. LOBBY INSURANCE BUILDING - DAY",
    "It's a quarter to nine of a gray November morning, and work-\r\nbound employees are piling in through the doors.  Among them\r\nis Bud, bundled up in a raincoat, hat, heavy muffler and\r\nwool gloves, and carrying a box of Kleenex.  He coughs,\r\npulls out a tissue, wipes his dripping nose.  He has a bad\r\ncold.\r\n\r\nThe lobby is an imposing, marbled affair, as befits a\r\ncompany which last year wrote 9.3 billion dollars worth of\r\ninsurance.  There are sixteen elevators, eight of them\r\nmarked LOCAL - FLOORS 1-18, and opposite them eight marked\r\nEXPRESS - FLOORS 18-37.  The starter, a uniformed Valkyrie\r\nwielding a clicker, is directing the flow of traffic into\r\nthe various elevators.\r\n\r\nBud joins the crowd in front of one of the express elevators.\r\nAlso standing there is Mr. Kirkeby, reading the Herald-\r\nTribune.",
    "BUD",
    "(hoarsely)\r\n            Good morning, Mr. Kirkeby.",
    "KIRKEBY",
    "(as if he just knew\r\n                   him vaguely)\r\n            Oh, how are you, Baxter.  They\r\n            keeping you busy these days?",
    "BUD",
    "Yes, sir.  They are indeed.\r\n                   (he sniffs)\r\n\r\nThe elevator doors open, revealing the operator.  She is in\r\nher middle twenties and her name is FRAN KUBELIK.  Maybe\r\nit's the way she's put together, maybe it's her face, or\r\nmaybe it's just the uniform -- in any case, there is\r\nsomething very appealing about her.  She is also an\r\nindividualist -- she wears a carnation in her lapel, which\r\nis strictly against regulations.  As the elevator loads, she\r\ngreets the passengers cheerfully.",
    "FRAN",
    "(rattling it off)\r\n            Morning, Mr. Kessel -- Morning,\r\n            Miss Robinson -- Morning, Mr.\r\n            Kirkeby -- Morning, Mr. Williams --\r\n            Morning, Miss Livingston -- Morning,\r\n            Mr. McKellway -- Morning, Mr.\r\n            Pirelli -- Morning, Mrs. Schubert --\r\n\r\nInterspersed is an occasional \"Morning, Miss Kubelik\" from\r\nthe passengers.",
    "FRAN",
    "Morning, Mr. Baxter.",
    "BUD",
    "Morning, Miss Kubelik.\r\n\r\nHe takes his hat off -- he is the only one.  The express is\r\nnow loaded.",
    "STARTER",
    "(working the clicker)\r\n            That's all.  Take it away.",
    "FRAN",
    "(shutting the door)\r\n            Watch the door, please.  Blasting\r\n            off.",
    "INT. ELEVATOR",
    "Bud is standing right next to Fran as the packed express\r\nshoots up.",
    "BUD",
    "(studying her)\r\n            What did you do to your hair?",
    "FRAN",
    "It was making me nervous, so I\r\n            chopped it off.  Big mistake, huh?",
    "BUD",
    "I sort of like it.\r\n\r\nHe sniffs, takes out a Kleenex, wipes his nose.",
    "FRAN",
    "Say, you got a lulu.",
    "BUD",
    "Yeah.  I better not get too close.",
    "FRAN",
    "Oh, I never catch colds.",
    "BUD",
    "Really?  I was looking at some\r\n            figures from the Sickness and\r\n            Accident Claims Division -- do you\r\n            know that the average New Yorker\r\n            between the ages of twenty and\r\n            fifty has two and a half colds a\r\n            year?",
    "FRAN",
    "That makes me feel just terrible.",
    "BUD",
    "Why?",
    "FRAN",
    "Well, to make the figures come out\r\n            even -- since I have no colds a\r\n            year -- some poor slob must have\r\n            five colds a year.",
    "BUD",
    "That's me.\r\n                   (dabs his nose)",
    "FRAN",
    "You should have stayed in bed this\r\n            morning.",
    "BUD",
    "I should have stayed in bed last\r\n            night.\r\n\r\nThe elevator has slowed down, now stops.  Fran opens the door.",
    "FRAN",
    "Nineteen.  Watch your step.\r\n\r\nAbout a third of the passengers get out, including Bud and\r\nMr. Kirkeby.  As Kirkeby passes Fran, he slaps her behind\r\nwith his folded newspaper.  Fran jumps slightly.",
    "FRAN",
    "(all in the day's work)\r\n            And watch your hand, Mr. Kirkeby!",
    "KIRKEBY",
    "(innocently)\r\n            I beg your pardon?",
    "FRAN",
    "One of these days I'm going to shut\r\n            those doors on you and --\r\n\r\nShe withdraws her hand into the sleeve of her uniform, and\r\nwaves the \"amputated\" arm at him.",
    "FRAN",
    "Twenty next.\r\n\r\nThe doors close.",
    "INT. NINETEENTH FLOOR - DAY",
    "Kirkeby turns away from the elevator, and grinning smugly,\r\nfalls in beside Bud.",
    "KIRKEBY",
    "That Kubelik -- boy!  Would I like\r\n            to get her on a slow elevator to\r\n            China.",
    "BUD",
    "Oh, yes.  She's the best operator\r\n            in the building.",
    "KIRKEBY",
    "I'm a pretty good operator myself --\r\n            but she just won't give me a\r\n            tumble -- date-wise.",
    "BUD",
    "Maybe you're using the wrong\r\n            approach.",
    "KIRKEBY",
    "A lot of guys around here have\r\n            tried it -- all kinds of\r\n            approaches -- no dice.  What is she\r\n            trying to prove?",
    "BUD",
    "Could be she's just a nice,\r\n            respectable girl -- there are\r\n            millions of them.",
    "KIRKEBY",
    "Listen to him.  Little Lord\r\n            Fauntleroy!\r\n\r\nLeaving Bud at the employees' coat-racks, Kirkeby heads\r\ntoward his office, one of the glass-enclosed cubicles.  Bud\r\nhangs up his hat and raincoat, stows away the gloves and\r\nmuffler.  Out of his coat pocket he takes a plastic anti-\r\nhistamine sprayer and a box of cough drops, and still\r\ncarrying the Kleenex, threads his way to his desk.  Most of\r\nthe desks are already occupied, and the others are filling\r\nrapidly.\r\n\r\nOnce seated at his desk, Bud arranges his medicaments neatly\r\nin front of him. He takes a Kleenex out of the box, blows\r\nhis nose, then leaning back in his swivel chair sprays first\r\none nostril, then the other. Suddenly the piercing bell goes\r\noff -- the workday has begun. Being the ultra-conscientious\r\ntype, Bud instantly sits upright in his chair, removes the\r\ncover from his computing machine, picks up a batch of\r\nperforated premium cards, starts entering figures on his\r\ncomputer.\r\n\r\nAfter a few seconds, he glances around to make sure that\r\neverybody in the vicinity is busy. Then he looks up a number\r\nin the company telephone directory, dials furtively.",
    "BUD",
    "(cupping hand over\r\n                   phone mouthpiece)\r\n            Hello, Mr. Dobisch? This is Baxter,\r\n            on the nineteenth floor.",
    "INT. DOBISCH'S OFFICE - DAY",
    "It is a glass-enclosed cubicle on the twenty-first floor.\r\nThrough the glass we see another enormous layout of desks,\r\neverybody working away. Dobisch is holding the phone in one\r\nhand, running an electric shaver over his face with the other.",
    "DOBISCH",
    "Oh, Buddy-boy. I was just about to\r\n            call you.\r\n                   (shuts off electric shaver)\r\n            I'm sorry about that mess on the\r\n            living room wall. You see, my\r\n            little friend, she kept insisting\r\n            Picasso was a bum -- so she started\r\n            to do that mural -- but I'm sure it\r\n            will wash off -- just eyebrow pencil.",
    "BUD - ON PHONE",
    "BUD",
    "It's not Picasso I'm calling about.\r\n            It's the key -- to my apartment --\r\n            you were supposed to leave it under\r\n            the mat.",
    "DOBISCH - ON PHONE",
    "DOBISCH",
    "I did, didn't I? I distinctly\r\n            remember bending over and putting\r\n            it there --",
    "BUD - ON PHONE",
    "BUD",
    "Oh, I found a key there, all\r\n            right -- only it's the wrong key.",
    "DOBISCH - ON PHONE",
    "DOBISCH",
    "It is?\r\n                   (takes Bud's key out\r\n                   of his pocket)\r\n            Well, how about that? No wonder I\r\n            couldn't get into the executive\r\n            washroom this morning.",
    "BUD - ON PHONE",
    "BUD",
    "And I couldn't get into my\r\n            apartment -- so at four a. m. I had\r\n            to wake up the landlady and give\r\n            her a whole song and dance about\r\n            going out to mail a letter and the\r\n            door slamming shut.",
    "DOBISCH - ON PHONE",
    "DOBISCH",
    "That's a shame. I'll send the key\r\n            right down. And about your\r\n            promotion --\r\n                   (leafs through report\r\n                   on desk)\r\n            -- I'm sending that efficiency\r\n            report right up to Mr. Sheldrake,\r\n            in Personnel. I wouldn't be\r\n            surprised if you heard from him\r\n            before the day is over.",
    "BUD - ON PHONE",
    "BUD",
    "Thank you, Mr. Dobisch.\r\n\r\nHe hangs up, feels his forehead. It is warm. Clipped to his\r\nhandkerchief pocket are a black fountain pen and, next to\r\nit, a thermometer in a black case. Bud unclips the\r\nthermometer case, unscrews the cap, shakes the thermometer\r\nout, puts it under his tongue. He resumes work.\r\n\r\nA messenger comes up to his desk with an interoffice envelope.",
    "MESSENGER",
    "From Mr. Dobisch.",
    "BUD",
    "(thermometer in mouth)\r\n            Wait.\r\n\r\nHe turns away from the messenger, unties the string of the\r\nenvelope, takes his key out, puts it in a coat pocket. From\r\na trouser pocket, he extracts Dobisch's key to the executive\r\nwashroom, slips it discreetly into the envelope, reties it,\r\nhands it to the messenger.",
    "BUD",
    "(thermometer in mouth)\r\n            To Mr. Dobisch.\r\n\r\nPuzzled by the whole procedure, the messenger leaves. Bud\r\nnow removes the thermometer from his mouth, reads it. It's\r\nworse than he thought. He puts the thermometer back in the\r\ncase, clips it to his pocket, takes his desk calendar out of\r\na drawer, turns a leaf. Under the date WEDNESDAY, NOVEMBER 4\r\nthere is an entry in his handwriting -- MR. VANDERHOF. Bud\r\nconsults the telephone directory again, picks up the phone,\r\ndials.",
    "INT. VANDERHOF'S OFFICE - DAY",
    "This is another glass-enclosed cubicle on another floor. MR.\r\nVANDERHOF, a Junior Chamber of Commerce type, is dictating\r\nto an elderly secretary who sits across the desk from him.",
    "VANDERHOF",
    "Dear Mr. MacIntosh --\r\n                   (phone rings and he\r\n                   picks it up)\r\n            Vanderhof, Public Relations. Oh,\r\n            yes, Baxter. Just a minute.\r\n                   (to secretary)\r\n            All right, Miss Finch -- type up\r\n            what we got so far.\r\n                   (he waits till she is\r\n                   out of the office;\r\n                   then, into phone)\r\n            Now what is it, Baxter?",
    "BUD - ON PHONE",
    "BUD",
    "Look, Mr. Vanderhof -- I've got you\r\n            down here for tonight -- but I'm\r\n            going to be using the place\r\n            myself -- so I'll have to cancel.",
    "VANDERHOF - ON PHONE",
    "VANDERHOF",
    "Cancel? But it's her birthday -- I\r\n            already ordered the cake --",
    "BUD - ON PHONE",
    "BUD",
    "I hate to disappoint you -- I mean,\r\n            many happy returns -- but not\r\n            tonight --",
    "VANDERHOF - ON PHONE",
    "VANDERHOF",
    "That's not like you, Baxter. Just\r\n            the other day, at the staff meeting,\r\n            I was telling Mr. Sheldrake what a\r\n            reliable man you were.",
    "BUD - ON PHONE",
    "BUD",
    "Thank you, Mr. Vanderhof. But I'm\r\n            sick -- I have this terrible\r\n            cold -- and a fever -- and I got to\r\n            go to bed right after work.",
    "VANDERHOF - ON PHONE",
    "VANDERHOF",
    "Buddy-boy, that's the worst thing\r\n            you can do. If you got a cold, you\r\n            should go to a Turkish bath --\r\n            spend the night there -- sweat it\r\n            out --",
    "BUD - ON PHONE",
    "BUD",
    "Oh, no. I'd get pneumonia -- and if\r\n            I got pneumonia, I'd be in bed for\r\n            a month -- and if I were in bed for\r\n            a month --",
    "VANDERHOF - ON PHONE",
    "VANDERHOF",
    "Okay, you made your point. We'll\r\n            just have to do it next Wednesday --\r\n            that's the only night of the week I\r\n            can get away.",
    "BUD - ON PHONE",
    "BUD",
    "Wednesday -- Wednesday --\r\n                   (leafing through calendar)\r\n            I got somebody penciled in -- let\r\n            me see what I can do -- I'll get\r\n            back to you.\r\n\r\nHe hangs up, riffles through the directory, finds the\r\nnumber, and with a furtive look around, dials again.",
    "BUD",
    "(into phone)\r\n            Mr. Eichelberger? Is this Mortgage\r\n            and Loan? I'd like to speak to Mr.\r\n            Eichelberger. Yes, it is urgent.",
    "INT. EICHELBERGER'S OFFICE - DAY",
    "Also glass-enclosed, but slightly larger than the others. MR.\r\nEICHELBERGER, a solid citizen of about fifty, is displaying\r\nsome mortgage graphs to three associates. A fourth one has\r\nanswered the phone.",
    "ASSOCIATE",
    "(holding out phone to Eichelberger)\r\n            For you, Mel.\r\n\r\nEichelberger puts the charts down, takes the phone.",
    "EIGHELBERGER",
    "Eichelberger here -- oh, yes,\r\n            Baxter --\r\n                   (a glance at his\r\n                   associates; then\r\n                   continues, as though\r\n                   it were a business call)\r\n            What's your problem? -- Wednesday\r\n            is out? -- oh -- that throws a\r\n            little monkey wrench into my\r\n            agenda -- Thursday? No, I'm all\r\n            tied up on Thursday -- let's\r\n            schedule that meeting for Friday.",
    "BUD - ON PHONE",
    "BUD",
    "Friday?\r\n                   (checks calendar)\r\n            Let me see what I can do. I'll get\r\n            back to you.\r\n\r\nHe hangs up, consults the directory, starts to dial a number.",
    "INT. KIRKEBY'S OFFICE - DAY",
    "It's another of those glass-enclosed cubicles, on the\r\nnineteenth floor. Kirkeby is talking into a dictaphone.",
    "KIRKEBY",
    "Premium-wise and billing-wise, we\r\n            are eighteen percent ahead of last\r\n            year, October-wise.\r\n\r\nThe phone has been ringing. Kirkeby switches off the machine,\r\npicks up the phone.",
    "KIRKEBY",
    "Hello? Yeah, Baxter. What's up?",
    "BUD - ON PHONE",
    "BUD",
    "Instead of Friday -- could you\r\n            possibly switch to Thursday? You'd\r\n            be doing me a great favor --",
    "KIRKEBY - ON PHONE",
    "KIRKEBY",
    "Well -- it's all right with me, Bud.\r\n            Let me check. I'll get back to you.\r\n\r\nHe presses down the button on the cradle, dials Operator.",
    "INT. SWITCHBOARD ROOM",
    "There is a double switchboard in the center, with nine girls\r\non each side, all busy as beavers. In the foreground we\r\nrecognize Sylvia, Kirkeby's date of last night.",
    "SYLVIA",
    "Consolidated Life -- I'll connect\r\n            you -- Consolidated Life --\r\n\r\nThe girl next to her turns and holds out a line.",
    "SWITCHBOARD GIRL",
    "Sylvia -- it's for you.\r\n\r\nSylvia plugs the call into her own switchboard.",
    "SYLVIA",
    "Yes? Oh, hello -- sure I got home\r\n            all right -- you owe me forty-five\r\n            cents.",
    "KIRKEBY - ON PHONE",
    "KIRKEBY",
    "Okay, okay. Look, Sylvia -- instead\r\n            of Friday - could we make it\r\n            Thursday night?",
    "SYLVIA - AT SWITCHBOARD",
    "SYLVIA",
    "Thursday? That's The Untouchables --\r\n            with Bob Stack.",
    "KIRKEBY - ON PHONE",
    "KIRKEBY",
    "Bob WHO? -- all right, so we'll\r\n            watch it at the apartment. Big deal.\r\n                   (he hangs up, dials)\r\n            Baxter? It's okay for Thursday.",
    "INT. NINETEENTH FLOOR - DAY",
    "Bud, at his desk, is on the phone.",
    "BUD",
    "Thank you, Mr. Kirkeby.\r\n                   (hangs up, consults\r\n                   directory, dials)\r\n            Mr. Eichelberger? It's okay for\r\n            Friday.\r\n                   (hangs up, consults\r\n                   directory, dials)\r\n            Mr. Vanderhof? It's okay for\r\n            Wednesday.\r\n\r\nDuring this, the phone has rung at the next desk, and the\r\noccupant, MR. MOFFETT, has picked it up. As Bud hangs up --",
    "MOFFETT",
    "(into phone)\r\n            All right -- I'll tell him.\r\n                   (hangs up, turns to Bud)\r\n            Hey, Baxter -- that was Personnel.\r\n            Mr. Sheldrake's secretary.",
    "BUD",
    "Sheldrake?",
    "MOFFETT",
    "She's been trying to reach you for\r\n            the last twenty minutes. They want\r\n            you up stairs.",
    "BUD",
    "Oh!\r\n\r\nHe jumps up, stuffs the nose-spray into one pocket, a\r\nhandful of Kleenex into the other.",
    "MOFFETT",
    "What gives, Baxter? You getting\r\n            promoted or getting fired?",
    "BUD",
    "(cockily)\r\n            Care to make a small wager?",
    "MOFFETT",
    "I've been here twice as long as you\r\n            have --",
    "BUD",
    "Shall we say -- a dollar?",
    "MOFFETT",
    "It's a bet.\r\n\r\nBud snake-hips between the desks like a broken-field runner.\r\n\r\nAt the elevator, Bud presses the UP button, paces nervously.\r\nOne of the elevator doors opens, and as Bud starts inside,\r\nthe doors of the adjoining elevator open, and Fran Kubelik\r\nsticks her head out.",
    "FRAN",
    "Going up?\r\n\r\nHearing her voice, Bud throws a quick \"Excuse me\" to the\r\nother operator, exits quickly and steps into Fran's elevator.",
    "BUD",
    "Twenty-seven, please. And drive\r\n            carefully. You're carrying precious\r\n            cargo -- I mean, manpower-wise.\r\n\r\nFran shuts the doors.",
    "INT. ELEVATOR - DAY",
    "Fran presses a button, and the elevator starts up.",
    "FRAN",
    "Twenty-seven.",
    "BUD",
    "You may not realize it, Miss\r\n            Kubelik, but I'm in the top ten --\r\n            efficiency-wise and this may be the\r\n            day -- promotion-wise.",
    "FRAN",
    "You're beginning to sound like Mr.\r\n            Kirkeby already.",
    "BUD",
    "Why not? Now that they're kicking\r\n            me upstairs --",
    "FRAN",
    "Couldn't happen to a nicer guy.\r\n                   (Bud beams)\r\n            You know, you're the only one\r\n            around here who ever takes his hat\r\n            off in the elevator.",
    "BUD",
    "Really?",
    "FRAN",
    "The characters you meet. Something\r\n            happens to men in elevators. Must\r\n            be the change of altitude -- the\r\n            blood rushes to their head, or\r\n            something -- boy, I could tell you\r\n            stories --",
    "BUD",
    "I'd love to hear them. Maybe we\r\n            could have lunch in the cafeteria\r\n            sometime -- or some evening, after\r\n            work --\r\n\r\nThe elevator has stopped, and Fran opens the doors.",
    "FRAN",
    "Twenty-seven.",
    "INT. TWENTY-SEVENTH FLOOR FOYER - DAY",
    "It is pretty plush up here -- soft carpeting and tall\r\nmahogany doors leading to the executive offices. The elevator\r\ndoor is open, and Bud steps out.",
    "FRAN",
    "I hope everything goes all right.",
    "BUD",
    "I hope so.\r\n                   (turning back)\r\n            Wouldn't you know they'd call me on\r\n            a day like this -- with my cold and\r\n            everything --\r\n                   (fumbling with his tie)\r\n            How do I look?",
    "FRAN",
    "Fine.\r\n                   (stepping out of elevator)\r\n            Wait.\r\n\r\nShe takes the carnation out of her lapel, starts to put it\r\nin Bud's buttonhole.",
    "BUD",
    "Thank you. That's the first thing I\r\n            ever noticed about you -- when you\r\n            were still on the local elevator --\r\n            you always wore a flower --\r\n\r\nThe elevator buzzer is now sounding insistently.  Fran steps\r\nback inside.",
    "FRAN",
    "Good luck. And wipe your nose.\r\n\r\nShe shuts the doors. Bud looks after her, then takes a\r\nKleenex out of his pocket, and wiping his nose, crosses to a\r\nglass door marked J. D. SHELDRAKE, DIRECTOR OF PERSONNEL. He\r\nstashes the used Kleenex away in another pocket, enters.",
    "INT. SHELDRAKE'S ANTEROOM - DAY",
    "It is a sedate office with a secretary and a couple of\r\ntypists. The secretary's name is MISS OLSEN. She is in her\r\nthirties, flaxen- haired, handsome, wears harlequin glasses,\r\nand has an incisive manner. Bud comes up to her desk.",
    "BUD",
    "C. C. Baxter -- Ordinary Premium\r\n            Accounting -- Mr. Sheldrake called\r\n            me.",
    "MISS OLSEN",
    "I called you -- that is, I tried to\r\n            call you -- for twenty minutes.",
    "BUD",
    "I'm sorry, I --",
    "MISS OLSEN",
    "Go on in.\r\n\r\nShe indicates the door leading to the inner office. Bud\r\nsquares his shoulders and starts in.",
    "INT. SHELDRAKE'S OFFICE - DAY",
    "Mr. Sheldrake is a $14,000 a year man, and rates a four-\r\nwindow office.\r\n\r\nIt is not quite an executive suite, but it is several pegs\r\nabove the glass cubicles of the middle echelon. There is\r\nlots of leather, and a large desk behind which sits MR.\r\nSHELDRAKE. He is a substantial looking, authoritative man in\r\nhis middle forties, a pillar of his suburban community, a\r\nblood donor and a family man. The latter is attested to by a\r\nframed photograph showing two boys, aged 8 and 10, in\r\nmilitary school uniforms.\r\n\r\nAs Baxter comes through the door, Sheldrake is leafing\r\nthrough Dobisch's efficiency report. He looks up at Bud\r\nthrough a pair of heavy-rimmed reading glasses.",
    "SHELDRAKE",
    "Baxter?",
    "BUD",
    "Yes, sir.",
    "SHELDRAKE",
    "(studying him)\r\n            I was sort of wondering what you\r\n            looked like. Sit down.",
    "BUD",
    "Yes, Mr. Sheldrake.\r\n\r\nHe seats himself on the very edge of the leather armchair\r\nfacing Sheldrake.",
    "SHELDRAKE",
    "Been hearing some very nice things\r\n            about you -- here's a report from\r\n            Mr. Dobisch -- loyal, cooperative,\r\n            resourceful --",
    "BUD",
    "Mr. Dobisch said that?",
    "SHELDRAKE",
    "And Mr. Kirkeby tells me that\r\n            several nights a week you work late\r\n            at the office -- without overtime.",
    "BUD",
    "(modestly)\r\n            Well, you know how it is -- things\r\n            pile up.",
    "SHELDRAKE",
    "Mr. Vanderhof, in Public Relations,\r\n            and Mr. Eichelberger, in Mortgage\r\n            and Loan -- they'd both like to\r\n            have you transferred to their\r\n            departments.",
    "BUD",
    "That's very flattering.\r\n\r\nSheldrake puts the report down, takes off his glasses, leans\r\nacross the desk toward Bud.",
    "SHELDRAKE",
    "Tell me, Baxter -- just what is it\r\n            that makes you so popular?",
    "BUD",
    "I don't know.",
    "SHELDRAKE",
    "Think.\r\n\r\nBud does so. For a moment, he is a picture of intense\r\nconcentration. Then --",
    "BUD",
    "Would you mind repeating the\r\n            question?",
    "SHELDRAKE",
    "Look, Baxter, I'm not stupid. I\r\n            know everything that goes on in\r\n            this building -- in every\r\n            department -- on every floor --\r\n            every day of the year.",
    "BUD",
    "(in a very small voice)\r\n            You do?",
    "SHELDRAKE",
    "(rises, starts pacing)\r\n            In 1957, we had an employee here,\r\n            name of Fowler. He was very popular,\r\n            too. Turned out he was running a\r\n            bookie joint right in the Actuarial\r\n            Department tying up the switchboard,\r\n            figuring the odds on our I.B.M.\r\n            machines -- so the day before the\r\n            Kentucky Derby, I called in the\r\n            Vice Squad and we raided the\r\n            thirteenth floor.",
    "BUD",
    "(worried)\r\n            The Vice Squad?",
    "SHELDRAKE",
    "That's right, Baxter.",
    "BUD",
    "What -- what's that got to do with\r\n            me? I'm not running any bookie joint.",
    "SHELDRAKE",
    "What kind of joint are you running?",
    "BUD",
    "Sir?",
    "SHELDRAKE",
    "There's a certain key floating\r\n            around the office -- from Kirkeby\r\n            to Vanderhof to Eichelberger to\r\n            Dobisch -- it's the key to a\r\n            certain apartment -- and you know\r\n            who that apartment belongs to?",
    "BUD",
    "Who?",
    "SHELDRAKE",
    "Loyal, cooperative, resourceful C.\r\n            C. Baxter.",
    "BUD",
    "Oh.",
    "SHELDRAKE",
    "Are you going to deny it?",
    "BUD",
    "No, sir. I'm not going to deny it.\r\n            But if you'd just let me explain --",
    "SHELDRAKE",
    "You better.",
    "BUD",
    "(a deep breath)\r\n            Well, about six months ago -- I was\r\n            going to night school, taking this\r\n            course in Advanced Accounting --\r\n            and one of the guys in our\r\n            department -- he lives in Jersey --\r\n            he was going to a banquet at the\r\n            Biltmore -- his wife was meeting\r\n            him in town, and he needed someplace\r\n            to change into a tuxedo -- so I\r\n            gave him the key    and word must\r\n            have gotten around -- because the\r\n            next thing I knew, all sorts of\r\n            guys were suddenly going to\r\n            banquets -- and when you give the\r\n            key to one guy, you can't say no to\r\n            another and the whole thing got out\r\n            of hand -- pardon me.\r\n\r\nHe whips out the nasal-spray, administers a couple of quick\r\nsquirts up each nostril.",
    "SHELDRAKE",
    "Baxter, an insurance company is\r\n            founded on public trust. Any\r\n            employee who conducts himself in a\r\n            manner unbecoming --\r\n                   (shifting into a new gear)\r\n            How many charter members are there\r\n            in this little club of yours?",
    "BUD",
    "Just those four -- out of a total\r\n            of 31,259 -- so actually, we can be\r\n            very proud of our personnel --\r\n            percentage-wise.",
    "SHELDRAKE",
    "That's not the point. Four rotten\r\n            apples in a barrel -- no matter how\r\n            large the barrel -- you realize\r\n            that if this ever leaked out --",
    "BUD",
    "Oh, it won't. Believe me. And it's\r\n            not going to happen again. From now\r\n            on, nobody is going to use my\r\n            apartment --\r\n\r\nIn his vehemence he squeezes the spray bottle, which squirts\r\nall over the desk.",
    "SHELDRAKE",
    "Where is your apartment?",
    "BUD",
    "West 67th Street. You have no idea\r\n            what I've been going through --\r\n            with the neighbors and the landlady\r\n            and the liquor and the key --",
    "SHELDRAKE",
    "How do you work it with the key?",
    "BUD",
    "Well, usually I slip it to them in\r\n            the office and they leave it under\r\n            the mat -- but never again -- I can\r\n            promise you that --\r\n\r\nThe phone buzzer sounds, and Sheldrake picks up the phone.",
    "SHELDRAKE",
    "Yes, Miss Olsen.",
    "INT. SHELDRAKE'S ANTEROOM - DAY",
    "Miss Olsen is on the phone.",
    "MISS OLSEN",
    "Mrs. Sheldrake returning your\r\n            call -- on two --\r\n\r\nShe presses a button down, starts to hang the phone up,\r\nglances around to see if the typists are watching, then\r\nraises the receiver to her ear and eavesdrops on the\r\nconversation.",
    "INT. SHELDRAKE'S OFFICE - DAY",
    "Sheldrake is talking into the phone.",
    "SHELDRAKE",
    "Yes, dear -- I called you earlier --\r\n            where were you? Oh, you took Tommy\r\n            to the dentist --\r\n\r\nDuring this, Bud has risen from his chair, started inching\r\ntoward the door.",
    "SHELDRAKE",
    "(turning to him)\r\n            Where are you going, Baxter?",
    "BUD",
    "Well, I don't want to intrude --\r\n            and I thought -- since it's all\r\n            straightened out anyway --",
    "SHELDRAKE",
    "I'm not through with you yet.",
    "BUD",
    "Yes, sir.",
    "SHELDRAKE",
    "(into phone)\r\n            The reason I called is -- I won't\r\n            be home for dinner tonight. The\r\n            branch manager from Kansas City is\r\n            in town -- I'm taking him to the\r\n            theatre Music Man, what else? No,\r\n            don't wait up for me -- 'bye,\r\n            darling.\r\n                   (hangs up, turns to Bud)\r\n            Tell me something,  Baxter  -- have\r\n            you seen Music Man?",
    "BUD",
    "Not yet. But I hear it's one swell\r\n            show.",
    "SHELDRAKE",
    "How would you like to go tonight?",
    "BUD",
    "You mean -- you and me? I thought\r\n            you were taking the branch manager\r\n            from Kansas City --",
    "SHELDRAKE",
    "I made other plans. You can have\r\n            both tickets.",
    "BUD",
    "Well, that's very kind of you --\r\n            only I'm not feeling well -- you\r\n            see, I have this cold -- and I\r\n            thought I'd go straight home.",
    "SHELDRAKE",
    "Baxter, you're not reading me. I\r\n            told you I have plans.",
    "BUD",
    "So do I -- I'm going to take four\r\n            aspirins and get into bed -- so you\r\n            better give the tickets to somebody\r\n            else --",
    "SHELDRAKE",
    "I'm not just giving those tickets,\r\n            Baxter -- I want to swap them.",
    "BUD",
    "Swap them? For what?\r\n\r\nSheldrake picks up the Dobisch reports, puts on his glasses,\r\nturns a page.",
    "SHELDRAKE",
    "It also says here -- that you are\r\n            alert, astute, and quite\r\n            imaginative --",
    "BUD",
    "Oh?\r\n                   (the dawn is breaking)\r\n            Oh!\r\n\r\nHe reaches into his coat pocket, fishes out a handful of\r\nKleenex, and then finally the key to his apartment. He holds\r\nit up.",
    "BUD",
    "This?",
    "SHELDRAKE",
    "That's good thinking, Baxter. Next\r\n            month there's going to be a shift\r\n            in personnel around here -- and as\r\n            far as I'm concerned, you're\r\n            executive material.",
    "BUD",
    "I am?",
    "SHELDRAKE",
    "Now put down the key --\r\n                   (pushing a pad toward him)\r\n            -- and put down the address.\r\n\r\nBud lays the key on the desk, unclips what he thinks is his\r\nfountain pen, uncaps it, starts writing on the pad.",
    "BUD",
    "It's on the second floor - my name\r\n            is not on the door -- it just says",
    "2A --",
    "Suddenly he realizes that he has been trying to write the\r\naddress with the thermometer.",
    "BUD",
    "Oh -- terribly sorry. It's that\r\n            cold --",
    "SHELDRAKE",
    "Relax, Baxter.",
    "BUD",
    "Thank you, sir.\r\n\r\nHe has replaced the thermometer with the fountain pen, and\r\nis scribbling the address.",
    "BUD",
    "You'll be careful with the record\r\n            player, won't you? And about the\r\n            liquor -- I ordered some this\r\n            morning -- but I'm not sure when\r\n            they'll deliver it --\r\n\r\nHe has finished writing the address, shoves the pad over to\r\nSheldrake.",
    "SHELDRAKE",
    "Now remember, Baxter -- this is\r\n            going to be our little secret.",
    "BUD",
    "Yes, of course.",
    "SHELDRAKE",
    "You know how people talk.",
    "BUD",
    "Oh, you don't have to worry --",
    "SHELDRAKE",
    "Not that I have anything to hide.",
    "BUD",
    "Oh, no sir. Certainly not. Anyway,\r\n            it's none of my business -- four\r\n            apples, five apples -- what's the\r\n            difference -- percentage-wise?",
    "SHELDRAKE",
    "(holding out the tickets)\r\n            Here you are, Baxter. Have a nice\r\n            time.",
    "BUD",
    "You too, sir.\r\n\r\nClutching the tickets, he backs out of the office.",
    "DISSOLVE TO:",
    "INT. LOBBY INSURANCE BUILDING - EVENING",
    "It is about 6:30, and the building has pretty well emptied\r\nout by now. Bud, in raincoat and hat, is leaning against one\r\nof the marble pillars beyond the elevators. His raincoat is\r\nunbuttoned, and Fran's carnation is still in his lapel. He\r\nis looking off expectantly toward a door marked EMPLOYEES'",
    "LOUNGE - WOMEN.",
    "Some of the female employees are emerging, dressed for the\r\nstreet. Among them are Sylvia and her colleague from the\r\nswitchboard.",
    "SYLVIA",
    "So I figure, a man in his position,\r\n            he's going to take me to 21 and El\r\n            Morocco -- instead, he takes me to\r\n            Hamburg Heaven and some schnook's\r\n            apartment --\r\n\r\nThey pass Bud without paying any attention to him. Bud has\r\nheard the crack, and looks after Sylvia, a little hurt. Then\r\nhe glances back toward the door of the lounge, as it opens\r\nand Fran Kubelik comes out. She is wearing a wool coat over\r\na street dress, no hat.",
    "FRAN",
    "(passing Bud)\r\n            Good night.",
    "BUD",
    "(casually)\r\n            Good night.\r\n\r\nShe is about three paces beyond him when he suddenly realizes\r\nwho it is.",
    "BUD",
    "Oh -- Miss Kubelik.\r\n                   (he rushes after her,\r\n                   taking off his hat)\r\n            I've been waiting for you.",
    "FRAN",
    "You have?",
    "BUD",
    "I almost didn't recognize you --\r\n            this is the first time I've ever\r\n            seen you in civilian clothes.",
    "FRAN",
    "How'd you make out on the twenty-\r\n            seventh floor?",
    "BUD",
    "Great. Look -- have you seen The\r\n            Music Man?",
    "FRAN",
    "No.",
    "BUD",
    "Would you like to?",
    "FRAN",
    "Sure.",
    "BUD",
    "I thought maybe we could have a\r\n            bite to eat first -- and then --",
    "FRAN",
    "You mean tonight?",
    "BUD",
    "Yeah.",
    "FRAN",
    "I'm sorry, but I can't tonight. I'm\r\n            meeting somebody.",
    "BUD",
    "Oh.\r\n                   (a beat)\r\n            You mean -- like a girl-friend?",
    "FRAN",
    "No. Like a man.\r\n\r\nShe proceeds across the lobby toward the street entrance,\r\nBud following her.",
    "BUD",
    "I wasn't trying to be personal --\r\n            it's just that the fellows in the\r\n            office were -- whether you wondering\r\n            about you ever --",
    "FRAN",
    "Just tell 'em -- now and then.",
    "BUD",
    "This date -- is it just a date --\r\n            or is it something serious?",
    "FRAN",
    "It used to be serious -- at least I\r\n            was -- but he wasn't -- so the\r\n            whole thing is more or less kaputt.",
    "BUD",
    "Well, in that case, couldn't you -- ?",
    "FRAN",
    "I'm afraid not. I promised to have\r\n            a drink with him -- he's been\r\n            calling me all week --",
    "BUD",
    "Oh, I understand.\r\n\r\nHe follows her out through the revolving doors.",
    "EXT. INSURANCE BUILDING - EVENING",
    "Fran and Bud come out.",
    "BUD",
    "(putting his hat on)\r\n            Well, it was just an idea -- I hate\r\n            to see a ticket go to waste --",
    "FRAN",
    "(stops)\r\n            What time does the show go on?",
    "BUD",
    "Eight-thirty.",
    "FRAN",
    "(looks at her watch)\r\n            Well -- I could meet you at the\r\n            theatre -- if that's all right.",
    "BUD",
    "All right? That's wonderful! It's\r\n            the Majestic -- 44th Street.",
    "FRAN",
    "Meet you in the lobby. Okay?\r\n\r\nBud nods happily, falls in beside her as she starts down the\r\nstreet.",
    "BUD",
    "You know, I felt so lousy this\r\n            morning -- a hundred and one\r\n            fever -- then my promotion came\r\n            up -- now you and I -- eleventh row\r\n            center -- and you said I should\r\n            have stayed in bed.",
    "FRAN",
    "How is your cold?",
    "BUD",
    "(high as a kite)\r\n            What cold? And after the show, we\r\n            could go out on the town --\r\n                   (does a little cha\r\n                   cha step)\r\n            I've been taking from Arthur Murray.",
    "FRAN",
    "So I see.",
    "BUD",
    "They got a great little band at El\r\n            Chico, in the Village -- it's\r\n            practically around the corner from\r\n            where you live.",
    "FRAN",
    "Sounds good.\r\n                   (a sudden thought)\r\n            How do you know where I live?",
    "BUD",
    "Oh, I even know who you live\r\n            with -- your sister and brother-in-\r\n            law -- I know when you were born --\r\n            and where -- I know all sorts of\r\n            things about you.",
    "FRAN",
    "How come?",
    "BUD",
    "A couple of months ago I looked up\r\n            your card in the group insurance\r\n            file.",
    "FRAN",
    "Oh.",
    "BUD",
    "I know your height, your weight and\r\n            your Social Security number -- you\r\n            had mumps, you had measles, and you\r\n            had your appendix out.\r\n\r\nThey have now reached the corner, and Fran stops.",
    "FRAN",
    "Well, don't tell the fellows in the\r\n            office about the appendix. They may\r\n            get the wrong idea how you found\r\n            out.\r\n                   (turning the corner)\r\n            'Bye.",
    "BUD",
    "(calling after her)\r\n            Eight-thirty!\r\n\r\nHe watches her walk away, an idiot grin on his face. Despite\r\nwhat he told Fran, his nose is stuffed up, so he takes out\r\nthe anti-histamine and sprays his nostrils. Then, carried\r\naway, he squirts some of the stuff on the carnation in his\r\nbuttonhole, moves off in the opposite direction.",
    "EXT. DOWNTOWN STREET - EVENING",
    "Fran comes hurrying along the street. She is late. Her\r\nobjective is a small Chinese restaurant, with a neon sign\r\nreading THE RICKSHAW - COCKTAILS - CANTONESE FOOD. She\r\nstarts down a flight of steps leading to the entrance.",
    "INT. CHINESE RESTAURANT - EVENING",
    "The bar is a long, narrow, dimly-lit room with booths along\r\none side. Beyond a bamboo curtain is the main dining room,\r\nwhich does not concern us. The place is decorated in Early\r\nBeachcomber style rattan, fish-nets, conch-shells, etc.\r\n\r\nThe help is Chinese. At this early hour, there are only half\r\na dozen customers in the place -- all at the bar except for\r\none man, sitting in the last booth with his back toward\r\ncamera. At a piano, a Chinese member of Local 808 is\r\nimprovising mood music.\r\n\r\nFran comes through the door, and without looking around,\r\nheads straight for the last booth. The bartender nods to\r\nher -- they know her there. As she passes the piano player,\r\nhe gives her a big smile, segues into JEALOUS LOVER.\r\n\r\nFran comes up to the man sitting in the last booth.",
    "FRAN",
    "(a wistful smile)\r\n            Good evening, Mr. Sheldrake.\r\n\r\nSheldrake, for that's who it is, looks around nervously to\r\nmake sure no one has heard her.",
    "SHELDRAKE",
    "Please, Fran -- not so loud.\r\n                   (he gets up)",
    "FRAN",
    "Still afraid somebody may see us\r\n            together?",
    "SHELDRAKE",
    "(reaching for her coat)\r\n            Let me take that.",
    "FRAN",
    "No, Jeff. I can't stay very long.\r\n                   (sits opposite him,\r\n                   with her coat on)\r\n            Can I have a frozen daiquiri?",
    "SHELDRAKE",
    "It's on the way.\r\n                   (sits down)\r\n            I see you went ahead and cut your\r\n            hair.",
    "FRAN",
    "That's right.",
    "SHELDRAKE",
    "You know I liked it better long.",
    "FRAN",
    "Yes, I know. You want a lock to\r\n            carry in your wallet?\r\n\r\nA waiter comes up with a tray: two daiquiris, fried shrimp,\r\neggrolls, and a bowl of sauce.",
    "WAITER",
    "(showing all his teeth)\r\n            Evening, lady. Nice see you again.",
    "FRAN",
    "Thank you.\r\n\r\nThe waiter has set everything on the table, leaves.",
    "SHELDRAKE",
    "How long has it been -- a month?",
    "FRAN",
    "Six weeks. But who's counting?",
    "SHELDRAKE",
    "I missed you, Fran.",
    "FRAN",
    "Like old times. Same booth, same\r\n            song --",
    "SHELDRAKE",
    "It's been hell.",
    "FRAN",
    "(dipping shrimp)\r\n            -- same sauce -- sweet and sour.",
    "SHELDRAKE",
    "You don't know what it's like --\r\n            standing next to you in that\r\n            elevator, day after day -- Good\r\n            morning, Miss Kubelik -- Good\r\n            night, Mr. Sheldrake -- I'm still\r\n            crazy about you, Fran.",
    "FRAN",
    "(avoiding his eyes)\r\n            Let's not start on that again,\r\n            Jeff -- please. I'm just beginning\r\n            to get over it.",
    "SHELDRAKE",
    "I don't believe you.",
    "FRAN",
    "Look, Jeff -- we had two wonderful\r\n            months this summer -- and that was\r\n            it. Happens all the time -- the\r\n            wife and kids go away to the\r\n            country, and the boss has a fling\r\n            with the secretary or the\r\n            manicurist -- or the elevator girl.\r\n            Comes September, the picnic is\r\n            over -- goodbye. The kids go back\r\n            to school, the boss goes back to\r\n            the wife, and the girl --\r\n                   (she is barely able\r\n                   to control herself)\r\n            They don't make these shrimp like\r\n            they used to.",
    "SHELDRAKE",
    "I never said goodbye, Fran.",
    "FRAN",
    "(not listening)\r\n            For a while there, you try kidding\r\n            yourself that you're going with an\r\n            unmarried man. Then one day he\r\n            keeps looking at his watch, and\r\n            asks you if there's any lipstick\r\n            showing, then rushes off to catch\r\n            the seven-fourteen to White Plains.\r\n            So you fix yourself a cup of\r\n            instant coffee -- and you sit there\r\n            by yourself -- and you think -- and\r\n            it all begins to look so ugly --\r\n\r\nThere are tears in her eyes. She breaks off, downs what's\r\nleft of the daiquiri.",
    "SHELDRAKE",
    "How do you think I felt -- riding\r\n            home on that seven-fourteen train?",
    "FRAN",
    "Why do you keep calling me, Jeff?\r\n            What do you want from me?",
    "SHELDRAKE",
    "(taking her hand)\r\n            I want you back, Fran.",
    "FRAN",
    "(withdrawing her hand)\r\n            Sorry, Mr. Sheldrake -- I'm full up.\r\n            You'll have to take the next\r\n            elevator.",
    "SHELDRAKE",
    "You're not giving me a chance, Fran.\r\n            I asked you to meet me because -- I\r\n            have something to tell you.",
    "FRAN",
    "Go ahead -- tell me.",
    "SHELDRAKE",
    "(a glance around)\r\n            Not here, Fran. Can't we go some\r\n            place else?",
    "FRAN",
    "No. I have a date at eight-thirty.",
    "SHELDRAKE",
    "Important?",
    "FRAN",
    "Not very -- but I'm going to be\r\n            there anyway.\r\n\r\nShe takes out an inexpensive square compact with a fleur de\r\nlis pattern on it, opens it, starts to fix her face. The\r\nwaiter comes up with a couple of menus.",
    "WAITER",
    "You ready order dinner now?",
    "FRAN",
    "No. No dinner.",
    "SHELDRAKE",
    "Bring us two more drinks.",
    "CUT TO:",
    "EXT. MAJESTIC THEATRE - EVENING",
    "It is 8:25, and there is the usual hectic to-do -- taxis\r\npulling up, people milling around the sidewalk and crowding\r\ninto the lobby. In the middle of this melee, buffeted by the\r\nthrong, stands Bud, in raincoat and hat, looking anxiously\r\nfor Fran.",
    "CUT TO:",
    "INT. CHINESE RESTAURANT - EVENING",
    "Fran and Sheldrake, in the booth, are working on the second\r\nround of drinks.",
    "SHELDRAKE",
    "Fran -- remember that last weekend\r\n            we had?",
    "FRAN",
    "(wryly)\r\n            Do I. That leaky little boat you\r\n            rented -- and me in a black negligee\r\n            and a life preserver --",
    "SHELDRAKE",
    "Remember what we talked about?",
    "FRAN",
    "We talked about a lot of things.",
    "SHELDRAKE",
    "I mean -- about my getting a divorce.",
    "FRAN",
    "We didn't talk about it -- you did.",
    "SHELDRAKE",
    "You didn't really believe me, did\r\n            you?",
    "FRAN",
    "(shrugging)\r\n            They got it an a long playing\r\n            record now - Music to String Her\r\n            Along By. My wife doesn't understand\r\n            me -- We haven't gotten along for\r\n            years -- You're the best thing that\r\n            ever happened to me --",
    "SHELDRAKE",
    "That's enough, Fran.",
    "FRAN",
    "(going right on)\r\n            Just trust me, baby -- we'll work\r\n            it out somehow --",
    "SHELDRAKE",
    "You're not being funny.",
    "FRAN",
    "I wasn't trying.",
    "SHELDRAKE",
    "If you'll just listen to me for a\r\n            minute --",
    "FRAN",
    "Okay. I'm sorry.",
    "SHELDRAKE",
    "I saw my lawyer this morning -- I\r\n            wanted his advice  -- about the\r\n            best way to handle it --",
    "FRAN",
    "Handle what?",
    "SHELDRAKE",
    "What do you think?",
    "FRAN",
    "(looking at him for a\r\n                   long moment - then)\r\n            Let's get something straight,\r\n            Jeff -- I never asked you to leave\r\n            your wife.",
    "SHELDRAKE",
    "Of course not. You had nothing to\r\n            do with it.",
    "FRAN",
    "(her eyes misting up again)\r\n            Are you sure that's what you want?",
    "SHELDRAKE",
    "I'm sure. If you'll just tell me\r\n            that you still love me --",
    "FRAN",
    "(softly)\r\n            You know I do.",
    "SHELDRAKE",
    "Fran --\r\n\r\nHe takes her hand, kisses it. The bar has been filling up,\r\nand now two couples are seating themselves in a nearby booth.\r\nOne of the women is Miss Olsen.",
    "FRAN",
    "(pulling her hand\r\n                   away gently)\r\n            Jeff -- darling --\r\n\r\nShe indicates the other customers. Sheldrake glances over\r\nhis shoulder.",
    "SHELDRAKE",
    "It is crowding up. Let's get out of\r\n            here.\r\n\r\nThey rise. Sheldrake leaves some money on the table, leads\r\nFran toward the entrance. As they pass Miss Olsen's booth,\r\nshe turns around slowly, and putting on her glasses, looks\r\nafter them.\r\n\r\nSheldrake slips a bill to the piano player, who gives them a\r\nbig smile, slides into JEALOUS LOVER again. Retrieving his\r\nhat and coat from the checkroom girl, Sheldrake steers Fran\r\nthrough the door.\r\n\r\nMiss Olsen watches them with a cold smile.",
    "EXT. CHINESE RESTAURANT - EVENING",
    "Fran and Sheldrake come up the steps.",
    "SHELDRAKE",
    "(to a passing cab)\r\n            Taxi!\r\n\r\nIt passes without stopping.",
    "FRAN",
    "I have that date -- remember?",
    "SHELDRAKE",
    "I love you -- remember?\r\n\r\nAnother taxi approaches. Sheldrake gives a shrill whistle,\r\nand it pulls up. He opens the door.",
    "FRAN",
    "Where are we going, Jeff? Not back\r\n            to that leaky boat --",
    "SHELDRAKE",
    "I promise.\r\n\r\nHe helps her into the cab, takes out of his coat pocket the\r\npage from the pad on which Bud wrote the address of the\r\napartment.",
    "SHELDRAKE",
    "(to cab driver)\r\n            51 West Sixty-Seventh.\r\n\r\nHe gets in beside Fran, shuts the door. As the cab pulls\r\naway, through the rear window the two can be seen kissing.",
    "CUT TO:",
    "EXT. MAJESTIC THEATRE - EVENING",
    "It's 9 o'clock, the lobby is deserted, and standing on the\r\nsidewalk all by himself, is Bud. He takes a Kleenex out of\r\nhis pocket, blows his nose, stuffs the used Kleenex in\r\nanother pocket. He looks up and down the street, consults\r\nhis watch, decides to wait just a little longer.",
    "FADE OUT:",
    "FADE IN:",
    "BAXTER'S DESK CALENDAR",
    "The leaves are flipping over. Mr. Sheldrake seems to be\r\nusing The Apartment regularly -- for the name Sheldrake, in\r\nBud's handwriting, appears on the pages dated Monday,\r\nNovember 9, Thursday, November 12, Thursday, November 19,\r\nMonday, November 23, and Monday, November 30. Mr. Sheldrake\r\nalso seems to be Baxter's only customer by now, since the\r\nother leaves of the calendar are blank.",
    "DISSOLVE TO:",
    "INT. NINETEENTH FLOOR - INSURANCE BUILDING - DAY",
    "It is a gloomy December morning, and hundreds of desk-bound\r\nemployees are bent over their paper-work.\r\n\r\nBud Baxter, in raincoat and hat, is clearing out his desk.\r\nHe has piled everything on his blotter pad -- reference\r\nbooks, papers, a fountain pen set, pencils, paper clips and\r\nthe calendar. Watching him from the next desk is a\r\ndumbfounded Moffett. Bud picks up the blotter pad with his\r\nstuff on it, and as he moves past Moffett's desk, Moffett\r\ntakes out a dollar bill, drops it grudgingly on the loaded\r\npad. Bud flashes him a little grin, continues between the\r\ndesks toward the row of glass-enclosed offices housing the\r\nsupervisory personnel.\r\n\r\nHe comes up to an unoccupied cubicle. A sign painter is\r\nbrushing in some new lettering on the glass door -- it reads\r\nC. C. BAXTER, Second Administrative Assistant. Bud studies\r\nthe sign with a good deal of satisfaction.",
    "BUD",
    "(to painter)\r\n            Would you mind --?\r\n                   (the painter turns around)\r\n            C. C. Baxter -- that's me.\r\n\r\nWith an \"Oh, \" the painter opens the door for him.",
    "INT. BAXTER'S OFFICE - DAY",
    "Bud enters his new office, deposits his stuff on the bare\r\ndesk, looks around possessively. The small cubicle boasts\r\none window, carpeting on the floor, a filing cabinet, a\r\ncouple of synthetic-leather chairs, and a clothes-tree -- to\r\nBud, it is the Taj Mahal. He crosses to the clothes-tree,\r\nremoves his hat and coat, hangs them up. From OFF comes --",
    "KIRKEBY'S VOICE",
    "Hi, Buddy-boy.",
    "DOBISCH'S VOICE",
    "Congratulations, and all that jazz.\r\n\r\nBud turns. Kirkeby, Dobisch, Eichelberger and Vanderhof have\r\ncome into the office.",
    "BUD",
    "Hi, fellas.",
    "EICHELBERGER",
    "Well, you made it, kid -- just like\r\n            we promised.",
    "VANDERHOF",
    "Quite an office -- name on the\r\n            door -- rug on the floor -- the\r\n            whole schmear.",
    "BUD",
    "Yeah.",
    "DOBISCH",
    "Teamwork -- that's what counts in\r\n            an organization like this. All for\r\n            one and one for all -- know what I\r\n            mean?",
    "BUD",
    "I have a vague idea.\r\n\r\nKirkeby signals to Vanderhof, who shuts the door. The four\r\ncharter members of the club start closing in on Bud.",
    "KIRKEBY",
    "Baxter, we're a little disappointed\r\n            in you -- gratitude-wise.",
    "BUD",
    "Oh, I'm very grateful.",
    "EIGHELBERGER",
    "Then why are you locking us out,\r\n            all of a sudden?",
    "BUD",
    "It's been sort of rough these last\r\n            few weeks -- what with my cold and\r\n            like that --\r\n\r\nHe has picked up the desk calendar, shoves it discreetly\r\ninto one of the drawers.",
    "DOBISCH",
    "We went to bat for you -- and now\r\n            you won't play ball with us.",
    "BUD",
    "Well, after all, it's my\r\n            apartment -- it's private\r\n            property -- it's not a public\r\n            playground.",
    "VANDERHOF",
    "All right, so you got yourself a\r\n            girl -- that's okay with us -- but\r\n            not every night of the week.",
    "KIRKEBY",
    "How selfish can you get?\r\n                   (to the others)\r\n            Last week I had to borrow my\r\n            nephew's car and take Sylvia to a\r\n            drive-in in Jersey. I'm too old for\r\n            that sort of thing -- I mean, in a\r\n            Volkswagen.",
    "BUD",
    "I sympathize with your problem --\r\n            and believe me, I'm very sorry --",
    "DOBISCH",
    "You'll be a lot sorrier before\r\n            we're through with you.",
    "BUD",
    "You threatening me?",
    "DOBISCH",
    "Listen, Baxter, we made you and we\r\n            can break you.\r\n\r\nHe deliberately flips a cigar ash on Bud's desk. At the same\r\ntime, the door opens, and Sheldrake comes striding in briskly.",
    "BUD",
    "Good morning, Mr. Sheldrake.\r\n\r\nThe others swivel around.",
    "SHELDRAKE",
    "Morning, gentlemen.\r\n                   (to Bud)\r\n            Everything satisfactory? You like\r\n            your office?",
    "BUD",
    "Oh, yes, sir. Very much. And I want\r\n            to thank you --",
    "SHELDRAKE",
    "Don't thank me -- thank your\r\n            friends here -- they're the ones\r\n            who recommended you.\r\n\r\nThe four friends manage to work up some sickly smiles.",
    "DOBISCH",
    "We just dropped in to wish him the\r\n            best.\r\n                   (quickly brushes\r\n                   cigar ash off desk)",
    "KIRKEBY",
    "(as they move toward\r\n                   the door)\r\n            So long, Baxter. We know you won't\r\n            let us down.",
    "BUD",
    "So long, fellas. Drop in any time.\r\n            The door is always open -- to my\r\n            office.\r\n\r\nThey leave. Sheldrake and Bud are alone.",
    "SHELDRAKE",
    "I like the way you handled that.\r\n            Well, how does it feel to be an\r\n            executive?",
    "BUD",
    "Fine. And I want you to know I'll\r\n            work very hard to justify your\r\n            confidence in me --",
    "SHELDRAKE",
    "Sure you will.\r\n                   (a beat)\r\n            Say, Baxter, about the apartment -\r\n            now that you got a raise, don't you\r\n            think we can afford a second key?",
    "BUD",
    "Well -- I guess so.",
    "SHELDRAKE",
    "You know my secretary -- Miss\r\n            Olsen --",
    "BUD",
    "Oh, yes. Very attractive. Is she --\r\n            the lucky one?",
    "SHELDRAKE",
    "No, you don't understand. She's a\r\n            busybody -- always poking her nose\r\n            into things -- and with that key\r\n            passing back and forth -- why take\r\n            chances?",
    "BUD",
    "Yes, sir. You can't be too careful.\r\n\r\nHe glances toward the glass partitions to make sure that\r\nnobody is watching.",
    "BUD",
    "I have something here -- I think it\r\n            belongs to you.\r\n\r\nOut of his pocket he has slipped the compact with the fleur-\r\nde-lis pattern we saw Fran use at the Rickshaw. He holds it\r\nout to Sheldrake.",
    "SHELDRAKE",
    "To me?",
    "BUD",
    "I mean -- the young lady -- whoever\r\n            she may be -- it was on the couch\r\n            when I got home last night.",
    "SHELDRAKE",
    "Oh, yes. Thanks.",
    "BUD",
    "The mirror is broken.\r\n                   (opens compact,\r\n                   revealing crack in mirror)\r\n            It was broken when I found it.",
    "SHELDRAKE",
    "So it was.\r\n                   (takes the compact)\r\n            She threw it at me.",
    "BUD",
    "Sir?",
    "SHELDRAKE",
    "You know how it is -- sooner or\r\n            later they all give you a bad time.",
    "BUD",
    "(man-of-the-world)\r\n            I know how it is.",
    "SHELDRAKE",
    "You see a girl a couple of times a\r\n            week -- just for laughs -- and\r\n            right away she thinks you're going\r\n            to divorce your wife. I ask you --\r\n            is that fair?",
    "BUD",
    "No, sir. That's very unfair --\r\n            especially to your wife.",
    "SHELDRAKE",
    "Yeah.\r\n                   (shifting gears)\r\n            You know, Baxter, I envy you.\r\n            Bachelor -- all the dames you\r\n            want -- no headaches, no\r\n            complications --",
    "BUD",
    "Yes, sir. That's the life, all right.",
    "SHELDRAKE",
    "Put me down for Thursday again.",
    "BUD",
    "Roger. And I'll get that other key.\r\n\r\nSheldrake exits. Bud takes the calendar out of the desk\r\ndrawer, makes an entry.",
    "DISSOLVE TO:",
    "BAXTER'S DESK CALENDAR",
    "Again the leaves are flipping over, and again we see\r\nSheldrake's name in Bud's handwriting -- booked for the\r\nfollowing dates: Monday, December 14, Thursday, December 17,\r\nMonday, December 21, Thursday, December 24.",
    "DISSOLVE TO:",
    "INT. SWITCHBOARD ROOM - DAY",
    "Perched on top of the switchboard is a small decorated\r\nChristmas tree, and the operators are dispensing holiday\r\ngreetings to all callers.",
    "OPERATORS",
    "Consolidated Life -- Merry\r\n            Christmas -- I'll connect you --\r\n            Consolidated Life -- Merry\r\n            Christmas -- I'm ringing --\r\n\r\nIn the foreground, Sylvia is engaged in a private\r\nconversation of her own.",
    "SYLVIA",
    "(into mouthpiece)\r\n            Yeah? -- YEAH? -- Where? -- You\r\n            bet --\r\n\r\nShe tears off her headset, and turns to the other girls.",
    "SYLVIA",
    "Somebody watch my line -- there's a\r\n            swinging party up on the nineteenth\r\n            floor --\r\n\r\nShe scoots out the door. The other girls immediately abandon\r\ntheir posts, and dash after her.",
    "INT. NINETEENTH FLOOR - DAY",
    "It's a swinging party, all right. Nobody is working. Several\r\ndesks have been cleared and pushed together, and on top of\r\nthis improvised stage four female employees and Mr. Dobisch,\r\nwith his pants-legs rolled up, are doing a Rockette kick\r\nroutine to the tune of JINGLE BELLS. Employees are ringed\r\naround the performers, some drinking out of paper cups,\r\nothers singing and clapping in rhythm.\r\n\r\nOne of the cubicles has been transformed into a bar, and it\r\nis jammed with people. Mr. Kirkeby and Mr. Vanderhof are\r\npouring -- each has a couple of bottles of liquor in his\r\nhands, and is emptying them into the open top of a water-\r\ncooler.\r\n\r\nBut the stuff is flowing out as fast as it flows in --\r\neverybody is in line with a paper cup waiting for a refill.\r\n\r\nBud comes shouldering his way out of the crowded cubicle,\r\nholding aloft two paper cups filled with booze. Since his\r\npromotion he has bought himself a new suit, dark flannel,\r\nand with it he wears a white shirt with a pinned round\r\ncollar, and a foulard tie. He also has quite a glow on.\r\nDetouring past necking couples, he heads in the direction of\r\nthe elevators.\r\n\r\nThe doors of Fran's elevator are just opening, and the\r\nswitchboard operators, led by Sylvia, come streaming out.",
    "SYLVIA",
    "(to a colleague)\r\n            -- so I said to him: Never again! --\r\n            either get yourself a bigger car or\r\n            a smaller girl --\r\n\r\nAs they head for the party, they pass Bud, who is approaching\r\nthe elevator with the two drinks. Fran is just closing the\r\nelevator doors.",
    "BUD",
    "Miss Kubelik.\r\n\r\nThe doors slide open again, and Fran looks out. Instead of\r\nthe customary carnation in the lapel of her uniform, she\r\nwears a sprig of holly.",
    "BUD",
    "(holding out one of\r\n                   the drinks)\r\n            Marry Christmas.",
    "FRAN",
    "Thank you.\r\n                   (takes drink)\r\n            I thought you were avoiding me.",
    "BUD",
    "What gave you that idea?",
    "FRAN",
    "In the last six weeks you've only\r\n            been in my elevator once -- and\r\n            then you didn't take your hat off.",
    "BUD",
    "Well, as a matter of fact, I was\r\n            rather hurt when you stood me up\r\n            that night --",
    "FRAN",
    "I don't blame you. It was\r\n            unforgivable.",
    "BUD",
    "I forgive you.",
    "FRAN",
    "You shouldn't.",
    "BUD",
    "You couldn't help yourself. I mean,\r\n            when you're having a drink with one\r\n            man, you can't just suddenly walk\r\n            out on him because you have another\r\n            date with another man. You did the\r\n            only decent thing.",
    "FRAN",
    "Don't be too sure. Just because I\r\n            wear a uniform -- that doesn't make\r\n            me a Girl Scout.",
    "BUD",
    "Miss Kubelik, one doesn't get to be\r\n            a second administrative assistant\r\n            around here unless he's a pretty\r\n            good judge of character -- and as\r\n            far as I'm concerned, you're tops.\r\n            I mean, decency-wise -- and\r\n            otherwise-wise.\r\n                   (toasting)\r\n            Cheers.",
    "FRAN",
    "Cheers.\r\n\r\nThey down their drinks. Bud takes the empty cup from her.",
    "BUD",
    "One more?",
    "FRAN",
    "(indicating elevator)\r\n            I shouldn't drink when I'm driving.",
    "BUD",
    "You're so right.\r\n\r\nHe reaches into the elevator, takes a cardboard sign off a\r\nhook, hangs it on the elevator door. It reads USE OTHER",
    "ELEVATOR.",
    "BUD",
    "By the power vested in me, I\r\n            herewith declare this elevator out\r\n            of order.\r\n                   (leading her toward\r\n                   the party)\r\n            Shall we join the natives?",
    "FRAN",
    "Why not?\r\n                   (as they pass a\r\n                   kissing couple)\r\n            They seem friendly enough.",
    "BUD",
    "Don't you believe it. Later on\r\n            there will be human sacrifices --\r\n            white collar workers tossed into\r\n            the computing machines, and punched\r\n            full of those little square holes.",
    "FRAN",
    "How many of those drinks did you\r\n            have?",
    "BUD",
    "(holding up four fingers)\r\n            Three.",
    "FRAN",
    "I thought so.\r\n\r\nThey have now reached the entrance to the bar, which is\r\noverflowing with thirsty natives.",
    "BUD",
    "You wait here. I think I hear the\r\n            sound of running water.\r\n\r\nHe leaves her outside the cubicle, and elbows his way\r\nthrough the crowd toward the booze-filled water cooler. Out\r\nof another cubicle comes Miss Olsen, cup in hand. She too\r\nhas had quite a few. Seeing Fran, she walks up to her, with\r\nan acid smile on her face.",
    "MISS OLSEN",
    "Hi. How's the branch manager from\r\n            Kansas City?",
    "FRAN",
    "I beg your pardon?",
    "MISS OLSEN",
    "I'm Miss Olsen -- Mr. Sheldrake's\r\n            secretary.",
    "FRAN",
    "Yes, I know.",
    "MISS OLSEN",
    "So you don't have to play innocent\r\n            with me. He used to tell his wife\r\n            that I was the branch manager from\r\n            Seattle -- four years ago when we\r\n            were having a little ring-a-ding-\r\n            ding.",
    "FRAN",
    "I don't know what you're talking\r\n            about.",
    "MISS OLSEN",
    "And before me there was Miss Rossi\r\n            in Auditing -- and after me there\r\n            was Miss Koch in Disability -- and\r\n            just before you there was Miss\r\n            What's-Her-Name, on the twenty-\r\n            fifth floor --",
    "FRAN",
    "(wanting to get away)\r\n            Will you excuse me?",
    "MISS OLSEN",
    "(holding her by the arm)\r\n            What for? You haven't done\r\n            anything -- it's him -- what a\r\n            salesman -- always the last booth\r\n            in the Chinese restaurant -- and\r\n            the same pitch about divorcing his\r\n            wife -- and in the end you wind up\r\n            with egg foo yong on your face.\r\n\r\nBud comes burrowing out of the crowded cubicle, balancing\r\nthe two filled paper cups, spots Fran.",
    "BUD",
    "Miss Kubelik.\r\n\r\nFran turns away from Miss Olsen.",
    "FRAN",
    "Well -- thank you.",
    "MISS OLSEN",
    "Always happy to do something for\r\n            our girls in uniform.\r\n\r\nShe moves off as Bud joins Fran, who is looking a little pale.",
    "BUD",
    "You all right? What's the matter?",
    "FRAN",
    "Nothing.\r\n                   (takes the drink)\r\n            There are just too many people here.",
    "BUD",
    "Why don't we step into any office?\r\n            There's something I want your\r\n            advice about, anyway.\r\n                   (leads her toward his cubicle)\r\n            I have my own office now, naturally.\r\n            And you may be interested to know\r\n            I'm the second youngest executive\r\n            in the company -- the only one\r\n            younger is a grandson of the\r\n            chairman of the board.",
    "INT. BAXTER'S OFFICE - DAY",
    "Bud ushers Fran in, and is confronted by a strange couple\r\nnecking in the corner. He gestures them out, crosses to his\r\ndesk.",
    "BUD",
    "Miss Kubelik, I would like your\r\n            honest opinion. I've had this in my\r\n            desk for a week -- cost me fifteen\r\n            dollars -- but I just couldn't get\r\n            up enough nerve to wear it --\r\n\r\nFrom under the desk he has produced a hatbox, and out of the\r\nhatbox a black bowler, which he now puts on his head.",
    "BUD",
    "It's what they call the junior\r\n            executive model. What do you think?\r\n\r\nFran looks at him blankly, absorbed in her own thoughts.",
    "BUD",
    "Guess I made a boo-boo, huh?",
    "FRAN",
    "(paying attention again)\r\n            No -- I like it.",
    "BUD",
    "Really? You mean you wouldn't be\r\n            ashamed to be seen with somebody in\r\n            a hat like this?",
    "FRAN",
    "Of course not.",
    "BUD",
    "Maybe if I wore it a little more to\r\n            the side --\r\n                   (adjusting hat)\r\n            is that better?",
    "FRAN",
    "Much better.",
    "BUD",
    "Well, as long as you wouldn't be\r\n            ashamed to be seen with me -- how\r\n            about the three of us going out\r\n            this evening -- you and me and the\r\n            bowler -- stroll down Fifth\r\n            Avenue -- sort of break it in --",
    "FRAN",
    "This is a bad day for me.",
    "BUD",
    "I understand. Christmas -- family\r\n            and all that --",
    "FRAN",
    "I'd better get back to my elevator.\r\n            I don't want to be fired.",
    "BUD",
    "Oh, you don't have to worry about\r\n            that. I have quite a bit of\r\n            influence in Personnel. You know Mr.\r\n            Sheldrake?",
    "FRAN",
    "(guardedly)\r\n            Why?",
    "BUD",
    "He and I are like this.\r\n                   (crosses his fingers)\r\n            Sent me a Christmas card. See?\r\n\r\nHe has picked up a Christmas card from his desk, shows it to\r\nFran. It is a photograph of the Sheldrake clan grouped\r\naround an elaborate Christmas tree -- Mr. and Mrs.\r\nSheldrake, the two boys in military school uniforms, and a\r\nbig French poodle. Underneath it says:",
    "SEASON'S GREETINGS",
    "from the SHELDRAKES\r\n                Emily, Jeff, Tommy, Jeff Jr.,\r\n                         and Figaro.",
    "FRAN",
    "(studying the card ruefully)\r\n            Makes a cute picture.",
    "BUD",
    "I thought maybe I could put in a\r\n            word for you with Mr. Sheldrake --\r\n            get you a little promotion -- how\r\n            would you like to be an elevator\r\n            starter?",
    "FRAN",
    "I'm afraid there are too many other\r\n            girls around here with seniority\r\n            over me.",
    "BUD",
    "No problem. Why don't we discuss it\r\n            sometime over the holidays -- I\r\n            could call you and pick you up and\r\n            we'll have the big unveiling --\r\n                   (touching the brim of\r\n                   his bowler)\r\n            -- you sure this is the right way\r\n            to wear it?",
    "FRAN",
    "I think so.",
    "BUD",
    "You don't think it's tilted a\r\n            little too much --\r\n\r\nFran takes her compact out of her uniform pocket, opens it,\r\nhands it to Bud.",
    "FRAN",
    "Here.",
    "BUD",
    "(examining himself in\r\n                   the mirror)\r\n            After all, this is a conservative\r\n            firm -- I don't want people to\r\n            think I'm an entertainer --\r\n\r\nHis voice trails off. There is something familiar about the\r\ncracked mirror of the compact -- and the fleur-de-lis\r\npattern on the case confirms his suspicion. Fran notices the\r\npeculiar expression on his face.",
    "FRAN",
    "What is it?",
    "BUD",
    "(with difficulty)\r\n            The mirror -- it's broken.",
    "FRAN",
    "I know. I like it this way -- makes\r\n            me look the way I feel.\r\n\r\nThe phone has started to ring. Bud doesn't hear it. He\r\ncloses the compact, hands it to Fran.",
    "FRAN",
    "Your phone.",
    "BUD",
    "Oh.\r\n                   (picks up phone from desk)\r\n            Yes?\r\n                   (throws a quick look\r\n                   at Fran)\r\n            Just a minute.\r\n                   (covers mouthpiece;\r\n                   to Fran)\r\n            If you don't mind -- this is sort\r\n            of personal",
    "FRAN",
    "All right. Have a nice Christmas.\r\n\r\nShe exits, closing the door. Bud takes his hand off the\r\nmouthpiece.",
    "BUD",
    "(every word hurts)\r\n            Yes, Mr. Sheldrake -- no, I didn't\r\n            forget -- the tree is up and the\r\n            Tom and Jerry mix is in the\r\n            refrigerator -- yes, sir -- same to\r\n            you.\r\n\r\nHe hangs up, stands there for a moment, the bowler still on\r\nhis head, the noise from the party washing over him. He\r\nslowly crosses to the clothes-tree. picks up his coat -- a\r\nnew, black chesterfield. With the coat over his arm, he\r\nstarts out of the office.",
    "INT. NINETEENTH FLOOR - DAY",
    "The party has picked up tempo. On top of the desks, Sylvia\r\nis doing a mock strip tease -- without taking any clothes\r\noff. There is hollering, drinking and clapping all around her.\r\n\r\nBud moves past the floor show, paying no attention. Kirkeby\r\nspots him, detaches himself from the cheering section around\r\nSylvia.",
    "KIRKEBY",
    "Where you going, Buddy-boy? The\r\n            party's just starting.\r\n                   (catching up with him)\r\n            Listen, kid -- give me a break,\r\n            will you -- how about tomorrow\r\n            afternoon? I can't take her to that\r\n            drive-in again -- the car doesn't\r\n            even have a heater four o'clock --\r\n            okay?\r\n\r\nBud ignores him, continues walking through the ranks of\r\nempty desks.",
    "DISSOLVE TO:",
    "INT. CHEAP BAR - COLUMBUS AVENUE IN THE SIXTIES - EVENING",
    "It is six o'clock, and the joint is crowded with customers\r\nhaving one for the road before joining their families for\r\nChristmas Eve. There are men with gaily wrapped packages,\r\nsmall trussed-up Christmas trees, a plucked turkey in a\r\nplastic bag. Written across the mirror behind the bar, in\r\nglittering white letters, is HAPPY HOLIDAYS. Everybody is in\r\nhigh spirits, laughing it up and toasting each other.\r\n\r\nEverybody except Bud Baxter. He is standing at the bar in\r\nhis chesterfield and bowler, slightly isolated, brooding\r\nover an almost empty martini glass. The bartender comes up,\r\nsets down a fresh martini with an olive on a toothpick,\r\ntakes his payment from a pile of bills and coins lying in\r\nfront of Bud. Bud fishes out the olive, adds it to half a\r\ndozen other impaled olives neatly arranged in fan shape on\r\nthe counter. He is obviously trying to complete the circle.\r\n\r\nA short, rotund man dressed as Santa Claus hurries in from\r\nthe street, and comes up to the bar beside Bud.",
    "SANTA CLAUS",
    "(to bartender)\r\n            Hey, Charlie -- give me a shot of\r\n            bourbon -- and step on it -- my\r\n            sleigh is double parked.\r\n\r\nHe laughs uproariously at his own joke, nudges Bud with his\r\nelbow. Bud stares at him coldly, turns back to his martini.\r\nThe laughter dies in Santa Claus' throat. He gets his short\r\nof bourbon, moves down the bar to find more convivial company.\r\n\r\nStanding near the end of the curved bar is a girl in her\r\nmiddle twenties wearing a ratty fur coat. Her name is MARGIE\r\nMacDOUGALL, she is drinking a Rum Collins through a straw,\r\nand she too is alone. From a distance, she is studying Bud\r\nwith interest. On the bar in front of her is a container of\r\nstraws in paper wrappers. She takes one of them out, tears\r\noff the end of the paper, blows through the straw -- sending\r\nthe wrapper floating toward Bud. The paper wrapper passes\r\nright in front of Bud's nose. He doesn't notice it.\r\n\r\nMargie, undaunted, lets go with another missile.\r\n\r\nThis time the wrapper lands on the brim of Bud's bowler. No\r\nreaction. Another wrapper comes floating in, hits Bud's\r\ncheek. He never takes his eye off his martini.\r\n\r\nMargie leaves her place, and carrying her handbag and her\r\nempty glass, comes up alongside Bud. Without a word, she\r\nreaches up and removes the wrapper from Bud's bowler.",
    "MARGIE",
    "You buy me a drink, I'll buy you\r\n            some music.\r\n                   (sets the glass down)\r\n            Rum Collins.\r\n\r\nNot waiting for an answer, she heads for the juke box. Bud\r\nlooks after her noncommittally, then turns to the bartender.",
    "BUD",
    "Rum Collins.\r\n                   (indicating martini glass)\r\n            And another one of these little\r\n            mothers.\r\n\r\nAt the juke box, Margie has dropped a coin in and made her\r\nselection. The music starts -- ADESTE FIDELIS. She rejoins\r\nBud at the bar just as the bartender is putting down their\r\ndrinks in front of them. Bud removes the new olive, adds it\r\nto the pattern on the counter in front of him. They both\r\ndrink, staring straight ahead. For quite a while, there is\r\ncomplete silence between them.",
    "MARGIE",
    "(out of nowhere)\r\n            You like Castro?\r\n                   (a blank look from Bud)\r\n            I mean -- how do you feel about\r\n            Castro?",
    "BUD",
    "What is Castro?",
    "MARGIE",
    "You know, that big-shot down in\r\n            Cuba with the crazy beard.",
    "BUD",
    "What about him?",
    "MARGIE",
    "Because as far as I'm concerned,\r\n            he's a no good fink. Two weeks ago\r\n            I wrote him a letter -- never even\r\n            answered me.",
    "BUD",
    "That so.",
    "MARGIE",
    "All I wanted him to do was let\r\n            Mickey out for Christmas.",
    "BUD",
    "Who is Mickey?",
    "MARGIE",
    "My husband. He's in Havana -- in\r\n            jail.",
    "BUD",
    "Oh. Mixed up in that revolution?",
    "MARGIE",
    "Mickey? He wouldn't do nothing like\r\n            that. He's a jockey. They caught\r\n            him doping a horse.",
    "BUD",
    "Well, you can't win 'em all.\r\n\r\nThey sit there silently for a moment, contemplating the\r\ninjustices of the world.",
    "MARGIE",
    "(to herself)\r\n            'Twas the night before Christmas\r\n            And all through the house\r\n            Not a creature was stirring --\r\n            Nothing --\r\n            No action --\r\n            Dullsville!\r\n                   (drinks; to Bud)\r\n            You married?",
    "BUD",
    "No.",
    "MARGIE",
    "Family?",
    "BUD",
    "No.",
    "MARGIE",
    "A night like this, it sort of\r\n            spooks you to walk into an empty\r\n            apartment.",
    "BUD",
    "I said I had no family -- I didn't\r\n            say I had an empty apartment.\r\n\r\nThey both drink.",
    "CUT TO:",
    "INT. BUD'S APARTMENT - EVENING",
    "The living room is dark, except for a shaft of light from\r\nthe kitchen, and the glow of the colored bulbs on a small\r\nChristmas tree in front of the phony fireplace.\r\n\r\nHunched up in one corner of the couch is Fran, still in her\r\ncoat and gloves, crying softly. Pacing up and down is\r\nSheldrake. His coat and hat are on a chair, as are several\r\nChristmas packages. On the coffee table are an unopened\r\nbottle of Scotch, a couple of untouched glasses, and a bowl\r\nof melting ice.",
    "SHELDRAKE",
    "(stops and faces Fran)\r\n            Come on, Fran -- don't be like that.\r\n            You just going to sit there and\r\n            keep bawling?\r\n                   (no answer)\r\n            You won't talk to me, you won't\r\n            tell me what's wrong --\r\n                   (a new approach)\r\n            Look, I know you think I'm stalling\r\n            you. But when you've been married\r\n            to a woman for twelve years, you\r\n            don't just sit down at the breakfast\r\n            table and say \"Pass the sugar --\r\n            and I want a divorce.\" It's not\r\n            that easy.\r\n                   (he resumes pacing;\r\n                   Fran continues crying)\r\n            Anyway, this is the wrong time. The\r\n            kids are home from school -- my in-\r\n            laws are visiting for the\r\n            holidays -- I can't bring it up now.\r\n                   (stops in front of her)\r\n            This isn't like you, Fran -- you\r\n            were always such a good sport --\r\n            such fun to be with --",
    "FRAN",
    "(through tears)\r\n            Yeah -- that's me. The Happy\r\n            Idiot -- a million laughs.",
    "SHELDRAKE",
    "Well, that's more like it. At least\r\n            you're speaking to me.",
    "FRAN",
    "Funny thing happened to me at the\r\n            office party today -- I ran into\r\n            your secretary -- Miss Olsen. You\r\n            know -- ring-a-ding-ding? I laughed\r\n            so much I like to died.",
    "SHELDRAKE",
    "Is that what's been bothering\r\n            you -- Miss Olsen? That's ancient\r\n            history.",
    "FRAN",
    "I was never very good at history.\r\n            Let me see -- there was Miss Olsen,\r\n            and then there was Miss Rossi --\r\n            no, she came before -- it was Miss\r\n            Koch who came after Miss Olsen --",
    "SHELDRAKE",
    "Now, Fran --",
    "FRAN",
    "And just think -- right now there's\r\n            some lucky girl in the building\r\n            who's going to come after me --",
    "SHELDRAKE",
    "Okay, okay, Fran. I deserve that.\r\n            But just ask yourself -- why does a\r\n            man run around with a lot of girls?\r\n            Because he's unhappy at home --\r\n            because he's lonely, that's why --\r\n            all that was before you, Fran --\r\n            I've stopped running.\r\n\r\nFran has taken a handkerchief out of her bag and is dabbing\r\nher eyes.",
    "FRAN",
    "How could I be so stupid? You'd\r\n            think I would have learned by\r\n            now -- when you're in love with a\r\n            married man, you shouldn't wear\r\n            mascara.",
    "SHELDRAKE",
    "It's Christmas Eve, Fran -- let's\r\n            not fight.",
    "FRAN",
    "Merry Christmas.\r\n\r\nShe hands him a flat, wrapped package.",
    "SHELDRAKE",
    "What is it?\r\n\r\nHe strips away the wrapping to reveal a long-playing record.\r\nThe cover reads: RICKSHAW BOY - Jimmy Lee Kiang with\r\nOrchestra.",
    "SHELDRAKE",
    "Oh. Our friend from the Chinese\r\n            restaurant. Thanks, Fran. We better\r\n            keep it here.",
    "FRAN",
    "Yeah, we better.",
    "SHELDRAKE",
    "I have a present for you. I didn't\r\n            quite know what to get you --\r\n            anyway it's a little awkward for\r\n            me, shopping --\r\n                   (he has taken out a\r\n                   money clip, detaches\r\n                   a bill)\r\n            -- so here's a hundred dollars --\r\n            go out and buy yourself something.\r\n\r\nHe holds the money out, but she doesn't move. Sheldrake\r\nslips the bill into her open bag.",
    "SHELDRAKE",
    "They have some nice alligator bags\r\n            at Bergdorf's --\r\n\r\nFran gets up slowly and starts peeling off her gloves.\r\nSheldrake looks at her, then glances nervously at his wrist\r\nwatch.",
    "SHELDRAKE",
    "Fran, it's a quarter to seven --\r\n            and I mustn't miss the train -- if\r\n            we hadn't wasted all that time -- I\r\n            have to get home and trim the\r\n            tree --\r\n\r\nFran has started to remove her coat.",
    "FRAN",
    "Okay.\r\n                   (shrugs the coat back on)\r\n            I just thought as long as it was\r\n            paid for --",
    "SHELDRAKE",
    "(an angry step toward her)\r\n            Don't ever talk like that, Fran!\r\n            Don't make yourself out to be cheap.",
    "FRAN",
    "A hundred dollars? I wouldn't call\r\n            that cheap. And you must be paying\r\n            somebody something for the use of\r\n            the apartment --",
    "SHELDRAKE",
    "(grabbing her arms)\r\n            Stop that, Fran.",
    "FRAN",
    "(quietly)\r\n            You'll miss your train, Jeff.\r\n\r\nSheldrake hurriedly puts on his hat and coat, gathers up his\r\npackages.",
    "SHELDRAKE",
    "Coming?",
    "FRAN",
    "You run along -- I want to fix my\r\n            face.",
    "SHELDRAKE",
    "(heading for the door)\r\n            Don't forget to kill the lights.\r\n            See you Monday.",
    "FRAN",
    "Sure. Monday and Thursday -- and\r\n            Monday again -- and Thursday\r\n            again --",
    "SHELDRAKE",
    "(that stops him in\r\n                   the half-open door)\r\n            It won't always be like this.\r\n                   (coming back)\r\n            I love you, Fran.\r\n\r\nHolding the packages to one side, he tries to kiss her on\r\nthe mouth.",
    "FRAN",
    "(turning her head)\r\n            Careful -- lipstick.\r\n\r\nHe kisses her on the cheek, hurries out of the apartment,\r\nclosing the door. Fran stands there for a while, blinking\r\nback tears, then takes the long-playing record out of its\r\nenvelope, crosses to the phonograph. She puts the record on,\r\nstarts the machine -- the music is JEALOUS LOVER. As it\r\nplays, Fran wanders aimlessly around the darkened room, her\r\nbody wracked by sobs. Finally she regains control of herself,\r\nand picking up her handbag, starts through the bedroom\r\ntoward the bathroom.\r\n\r\nIn the bathroom, Fran switches on the light, puts her bag on\r\nthe sink, turns on the faucet. Scooping up some water, she\r\nwashes the smeared mascara away, then turns the faucet off,\r\npicks up a towel As she is drying her face, she notices in\r\nthe pull-away shaving mirror the magnified reflection of a\r\nvial of pills on the medicine shelf. Fran reaches out for\r\nthe vial, turns it slowly around in her hand. The label\r\nreads: SECONAL - ONE AT BEDTIME AS NEEDED FOR SLEEP.\r\n\r\nFran studies the label for a second, then returns the vial\r\nto the shelf. She opens her handbag, takes out a lipstick.\r\nAs she does so, she sees the hundred dollar bill Sheldrake\r\nleft in the bag. Her eyes wander back to the vial on the\r\nmedicine shelf. Then very deliberately she picks up Bud's\r\nmouthwash glass, removes the two toothbrushes from it, turns\r\non the faucet, starts filling the glass with water.",
    "DISSOLVE TO:",
    "INT. CHEAP BAR - COLUMBUS AVENUE - NIGHT",
    "The joint is deserted now except for the Santa Claus, who is\r\nleaning against the bar, quite loaded, and Bud and Margie\r\nMacDougall, who are dancing to a slow blues coming from the\r\njuke box. Bud is still in his overcoat and bowler, and\r\nMargie is wearing her fur coat. The bartender is sweeping up\r\nthe place.",
    "BARTENDER",
    "(to Santa Claus)\r\n            Drink up, Pop. It's closing time.",
    "SANTA CLAUS",
    "But it's early, Charlie.",
    "BARTENDER",
    "Don't you know what night this is?",
    "SANTA CLAUS",
    "I know, Charlie. I know. I work for\r\n            the outfit.\r\n\r\nHe polishes off his drink, walks out unsteadily. The\r\nbartender approaches the dancers.",
    "BARTENDER",
    "Hey, knock it off, will you? Go home.\r\n\r\nBud and Margie ignore him, continue dancing -- or rather\r\nswaying limply cheek-to-cheek. The bartender crosses to the\r\njuke box, pulls the plug out. The music stops, but not Bud\r\nand Margie -- they continue dancing.",
    "BARTENDER",
    "O-U-T -- out!\r\n\r\nHe goes to the front of the bar, starts to extinguish the\r\nlights. Margie picks up her handbag from the bar, and Bud\r\ndowns the remains of his drink.",
    "MARGIE",
    "Where do we go -- my place or yours?",
    "BUD",
    "(peering at his watch)\r\n            Might as well go to mine --\r\n            everybody else does.\r\n\r\nHe leads her through the dark bar toward the entrance. The\r\nbartender holds the door open for them as they go out.",
    "DISSOLVE TO:",
    "EXT. BROWNSTONE HOUSE - NIGHT",
    "Bud and Margie come walking down the street. As they reach\r\nthe house, Bud starts up the steps, but Margie continues\r\nalong the sidewalk.",
    "MARGIE",
    "Poor Mickey -- when I think of him\r\n            all by himself in that jail in\r\n            Havana --\r\n                   (opening her handbag)\r\n            -- want to see his picture?",
    "BUD",
    "(from steps)\r\n            Not particularly.\r\n\r\nMargie, realizing her mistake, hurries back to join him.",
    "MARGIE",
    "He's so cute -- five-foot-two --\r\n            ninety-nine pounds...like a little\r\n            chihuahua.\r\n\r\nThey pass through the front door into the vestibule.",
    "INT. STAIRCASE - BROWNSTONE HOUSE - NIGHT",
    "Bud and Margie are mounting the stairs toward the apartment.",
    "MARGIE",
    "Can I ask you a personal question?",
    "BUD",
    "No.",
    "MARGIE",
    "You got a girl-friend?",
    "BUD",
    "She may be a girl -- but she's no\r\n            friend of mine.",
    "MARGIE",
    "Still stuck on her, huh.",
    "BUD",
    "Stuck on her! Obviously, you don't\r\n            know me very well.",
    "MARGIE",
    "I don't know you at all.",
    "BUD",
    "Permit me -- C.C. Baxter -- junior\r\n            executive, Arthur Murray graduate,\r\n            lover.",
    "MARGIE",
    "I'm Mrs. MacDougall -- Margie to you.\r\n\r\nBud has taken the key out of his pocket, opened the door to\r\nhis apartment.",
    "BUD",
    "This way, Mrs. MacDougall.\r\n\r\nHe ushers her in.",
    "INT. APARTMENT - NIGHT",
    "It is exactly the way we left it. There is no sign of Fran,\r\nexcept for the gloves she dropped on the coffee table\r\nearlier. Bud switches on the light, shuts the door.",
    "MARGIE",
    "(looking around)\r\n            Say, this is Snugsville.",
    "BUD",
    "(helping her out of\r\n                   her coat)\r\n            Mrs. MacDougall, I think it is only\r\n            fair to warn you that you are now\r\n            alone with a notorious sexpot.",
    "MARGIE",
    "(a gleam)\r\n            No kidding.",
    "BUD",
    "Ask anybody around here. As a\r\n            matter of fact, when it's time for\r\n            me to go -- and I may go just like\r\n            that --\r\n                   (snaps his fingers)\r\n            -- I have promised my body to the\r\n            Columbia Medical Center.",
    "MARGIE",
    "(shuddering deliciously)\r\n            Gee. Sort of gives you goose-bumps\r\n            just to think about it.",
    "BUD",
    "Well, they haven't got me yet, baby.\r\n            Dig up some ice from the kitchen\r\n            and let's not waste any time --\r\n            preliminary-wise.",
    "MARGIE",
    "I'm with you, lover.\r\n\r\nShe takes the bowl of melted ice Bud has handed her,\r\ndisappears into the kitchen. As Bud starts to remove his\r\ncoat, he becomes aware of a scratching noise from the\r\nphonograph. He crosses to it, sees that the needle is stuck\r\nin the last groove of a long-playing record.\r\n\r\nBud lifts the record off, examines it curiously, then puts\r\nit aside and substitutes the cha cha record. As the music\r\nstarts, he dances over to the coat-rack beside the door,\r\nhangs up his chesterfield and bowler. He turns back into the\r\nroom, still dancing, suddenly spots Fran's gloves on the\r\ncoffee table. He picks up the gloves, looks around for some\r\nconvenient place to get rid of them. Moving over to the\r\nbedroom door, he opens it, tosses the gloves toward the bed\r\ninside. He shuts the door, starts to turn away, freezes in a\r\ndelayed reaction to something he saw inside. He quickly\r\nopens the door again, looks.\r\n\r\nSprawled across the bed, on top of the bedspread, is Fran.\r\nThe light from the bathroom falls across her. She is fully\r\ndressed, still in her coat, and apparently asleep.\r\n\r\nBud steps into the bedroom, closing the door behind him,\r\nwalks over to Fran.",
    "BUD",
    "All right, Miss Kubelik -- get up.\r\n            It's past checking-out time, and\r\n            the hotel management would\r\n            appreciate it if you would get the\r\n            hell out of here.\r\n                   (Fran doesn't stir)\r\n            Look, Miss Kubelik, I used to like\r\n            you -- I used to like you a lot --\r\n            but it's all over between us -- so\r\n            beat it -- O-U-T -- out!\r\n                   (no reaction; he puts\r\n                   a hand on her\r\n                   shoulder, shakes her)\r\n            Come on -- wake up!\r\n\r\nShe doesn't respond. But something falls out of her hand,\r\nrolls across the bed. Bud picks it up, looks at it -- it is\r\nhis sleeping-pill vial, now uncapped and empty.",
    "BUD",
    "(a hoarse whisper)\r\n            Oh, my God.\r\n\r\nFor a second he is paralyzed. Then he drops the vial, grabs\r\nFran, lifts her into a sitting position on the bed, shakes\r\nher violently.",
    "BUD",
    "Miss Kubelik! Miss Kubelik!\r\n\r\nFran's head droops to one side, like a rag doll's. Bud lets\r\ngo of her, rushes out.\r\n\r\nIn the living room, the phonograph is still cha cha-ing away.\r\nBud dashes to the phone, picks it up. Then it occurs to him\r\nthat he doesn't know whom to call and he hangs up. Out of\r\nthe kitchen comes Margie, with a bowlful of ice cubes.",
    "MARGIE",
    "I broke a nail trying to get the\r\n            ice-tray out. You ought to buy\r\n            yourself a new refrigerator.\r\n\r\nBud, not listening, runs past her to the hall door and out.",
    "MARGIE",
    "(calling after him)\r\n            I didn't mean right now.",
    "INT. SECOND FLOOR LANDING - NIGHT",
    "Bud arrives at the door of the Dreyfuss apartment, starts\r\nringing the doorbell and pounding with his fist.",
    "BUD",
    "Dr. Dreyfuss! Hey, Doc!\r\n\r\nThe door opens, and Dr. Dreyfuss stands there sleepily,\r\npulling on his beaten bathrobe.",
    "BUD",
    "(words tumbling over\r\n                   each other)\r\n            There's a girl in my place -- she\r\n            took some sleeping pills -- you\r\n            better come quick -- I can't wake\r\n            her up.",
    "DR. DREYFUSS",
    "Let me get my bag.\r\n\r\nHe disappears from the doorway.",
    "BUD",
    "Hurry up, Doc.\r\n\r\nBud turns and runs back into his apartment.",
    "INT. APARTMENT - NIGHT",
    "Margie has settled herself comfortably on the couch, and is\r\nfixing the drinks. The cha cha music is still going. Bud\r\ncomes flying in, heads for the bedroom.",
    "MARGIE",
    "Hey -- over here, lover.\r\n\r\nBud stops in his tracks, suddenly aware of her.",
    "MARGIE",
    "What's all this running around?\r\n            You're going to wear yourself out.\r\n\r\nBud strides over to her purposefully, yanks her up to her\r\nfeet.",
    "MARGIE",
    "Not so rough, honey.",
    "BUD",
    "(taking the glass out\r\n                   of her hand)\r\n            Good night.",
    "MARGIE",
    "Good night?",
    "BUD",
    "(thrusting the fur\r\n                   coat at her)\r\n            The party's over.",
    "MARGIE",
    "What's the matter? Did I do\r\n            something wrong?",
    "BUD",
    "(easing her toward door)\r\n            It's an emergency -- see you some\r\n            other time.\r\n\r\nDr. Dreyfuss comes hurrying in, carrying his medical bag. He\r\nstops, bewildered by the sound of music and the sight of a\r\nwide-awake girl in the apartment.",
    "BUD",
    "Not this one --\r\n                   (pointing to the bedroom)\r\n            -- in there, Doc.\r\n\r\nDr. Dreyfuss proceeds into the bedroom.",
    "MARGIE",
    "Say, what's going on here, anyway?",
    "BUD",
    "Nothing.\r\n                   (propelling her\r\n                   toward the door)\r\n            Just clear out, will you?",
    "MARGIE",
    "(pointing back)\r\n            My shoes.\r\n\r\nBud reaches under the coffee table, where she left her\r\nshoes, retrieves them.",
    "MARGIE",
    "(bitterly)\r\n            Some lover you are. Some sexpot!\r\n\r\nBud shoves the shoes at her, takes a bill out of his wallet,\r\nhands it to her.",
    "BUD",
    "Here -- find yourself a phone booth\r\n            and call your husband in Havana.",
    "MARGIE",
    "You bet I will. And when I tell him\r\n            how you treated me, he'll push your\r\n            face in.\r\n                   (he shoves her\r\n                   through the open door)\r\n            You fink!\r\n\r\nBud slams the door shut, starts toward the bedroom. Halfway\r\nthere, he becomes aware that the cha cha record is still on.\r\nHe detours to the phonograph, switches it off, continues\r\ninto the bedroom.\r\n\r\nIn the bedroom, the overhead light is on, and Dr. Dreyfuss\r\nis working on the unconscious Fran. He has removed her coat,\r\nand is shining a flashlight into her eyes, examining her\r\npupils. Bud approaches the bed worriedly.",
    "BUD",
    "She going to be all right, Doc?",
    "DR. DREYFUSS",
    "How many pills were in that bottle?",
    "BUD",
    "It was half-full -- about a dozen\r\n            or so. You going to have to take\r\n            her to the hospital?\r\n\r\nDr. Dreyfuss ignores him. Out of his medical bag, he takes a\r\nstomach tube with a rubber funnel at the end. Then he starts\r\nto lift Fran off the bed.",
    "DR. DREYFUSS",
    "Help me, will you?\r\n\r\nBetween them, they get Fran into an upright position.",
    "DR. DREYFUSS",
    "Into the bathroom.\r\n\r\nThey half-carry, half-drag Fran's limp form toward the\r\nbathroom.",
    "BUD",
    "What are you going to do, Doc?",
    "DR. DREYFUSS",
    "Get that stuff out of her stomach --\r\n            if it isn't too late. You better\r\n            put some coffee on -- and pray.\r\n\r\nBud starts away as Dr. Dreyfuss takes Fran into the bathroom.\r\n\r\nBud loses no time getting into the kitchen. He fills an\r\naluminum kettle with water, strikes a match, lights the gas\r\nburner, puts the kettle on. Then he takes a jar of instant\r\ncoffee and a chipped coffee mug out of the cupboard, shakes\r\nan excessive portion of coffee into the mug, sticks a spoon\r\nin it. He watches the kettle for a moment, mops his brow\r\nwith a handkerchief, then starts back toward the bedroom.\r\n\r\nBud crosses the bedroom to the half-open door of the\r\nbathroom, looks in anxiously. From inside come the sounds of\r\na coughing spasm and running water. Bud turns away, undoes\r\nhis tie and collar, paces the bedroom floor. Something on\r\nthe night table attracts his attention -- resting against\r\nthe base of the lamp is a sealed envelope. Bud picks it\r\nup -- on it, in Fran's handwriting, is one word, JEFF. He\r\nturns the letter over in his hand, trying to decide what to\r\ndo with it.\r\n\r\nDr. Dreyfuss emerges from the bathroom, carrying a pale,\r\nstill unconscious Fran. Bud quickly conceals the suicide\r\nnote behind his back.",
    "DR. DREYFUSS",
    "Bring my bag.\r\n\r\nHe lugs Fran into the living room. Bud stashes the letter in\r\nhis back pocket, picks up the medical bag, follows them.\r\n\r\nIn the living room, Dr. Dreyfuss lowers Fran into a chair.\r\nHer chin falls to her chest. Dreyfuss takes the bag from\r\nBud, fishes out a hypodermic syringe, draws 2 c.c.'s from a\r\nbottle of picrotoxin.",
    "DR. DREYFUSS",
    "Roll up her right sleeve.\r\n\r\nBud does so. Dr. Dreyfuss hands the hypodermic to Bud,\r\nsearches for a spot for the injection.",
    "DR. DREYFUSS",
    "Nice veins.\r\n\r\nHe swabs the spot with alcohol, takes the hypodermic back\r\nfrom Bud.",
    "DR. DREYFUSS",
    "Want to tell me what happened?",
    "BUD",
    "I don't know -- I mean -- I wasn't\r\n            here -- you see -- we had some\r\n            words earlier -- nothing serious,\r\n            really -- what you might call a\r\n            lovers' quarrel --",
    "DR. DREYFUSS",
    "(making off-scene injection)\r\n            So you went right out and picked\r\n            yourself up another dame.",
    "BUD",
    "Something like that.",
    "DR. DREYFUSS",
    "You know, Baxter, you're a real\r\n            cutie-pie -- yes, you are.\r\n\r\nBud just stands there, taking it. Fran stirs slightly, and\r\nfrom her parched lips comes a low moan. Dr. Dreyfuss grabs\r\nher by the hair, lifts her head up.",
    "DR. DREYFUSS",
    "If you'd come home half an hour\r\n            later, you would have had quite a\r\n            Christmas present.\r\n\r\nWith his free hand, Dr. Dreyfuss slaps Fran viciously across\r\nthe face. Bud winces. Dreyfuss, still holding Fran by the\r\nhair, takes a box of ammonia ampules out of his bag. He\r\ncrushes one of the ampules in his hand, passes it under her\r\nnose. Fran tries to turn her head away. Dreyfuss slaps her\r\nagain, hard, crushes another ampule, repeats the process.\r\n\r\nBud is watching tensely. From the kitchen comes the whistle\r\nof the boiling kettle, but Bud pays no attention.",
    "DR. DREYFUSS",
    "Get the coffee.\r\n\r\nBud hurries into the kitchen. He turns off the gas, pours\r\nthe boiling water into the mug with the instant coffee,\r\nstirs it. From off, come the sounds of more slapping and\r\nsome moaning. Bud carries the coffee out.\r\n\r\nIn the living room, Dr. Dreyfuss is working another ammonia\r\nampule under Fran's nose. Her eyes start fluttering. Dreyfuss\r\ntakes the coffee mug from Bud, forces it between Fran's\r\nlips, pours coffee into her mouth. Fran resists\r\ninstinctively, half the coffee dribbling over her chin and\r\ndress, but Dr. Dreyfuss keeps at it.",
    "DR. DREYFUSS",
    "Let's get some air in here. Open\r\n            the windows.\r\n\r\nBud complies promptly -- pulls up the shades, opens the\r\nwindows wide.",
    "DR. DREYFUSS",
    "(putting the empty\r\n                   mug down)\r\n            What's her name?",
    "BUD",
    "Miss Kubelik -- Fran.",
    "DR. DREYFUSS",
    "(to Fran, slowly)\r\n            Fran, I'm a doctor. I'm here\r\n            because you took too many sleeping\r\n            pills. Do you understand what I'm\r\n            saying?\r\n                   (Fran mutters something)\r\n            Fran, I'm Dr. Dreyfuss -- I'm here\r\n            to help you. You took all those\r\n            sleeping pills -- remember?",
    "FRAN",
    "(mumbling groggily)\r\n            Sleeping pills.",
    "DR. DREYFUSS",
    "That's right, Fran. And I'm a doctor.",
    "FRAN",
    "Doctor.",
    "DR. DREYFUSS",
    "Dr. Dreyfuss.",
    "FRAN",
    "Dreyfuss.",
    "DR. DREYFUSS",
    "(to Bud)\r\n            Get more coffee.\r\n\r\nBud picks up the mug, leaves.",
    "DR. DREYFUSS",
    "(to Fran)\r\n            Tell me again -- what's my name?",
    "FRAN",
    "Dr. Dreyfuss.",
    "DR. DREYFUSS",
    "And what happened to you?",
    "FRAN",
    "I took sleeping pills.",
    "DR. DREYFUSS",
    "Do you know where you are, Fran?",
    "FRAN",
    "(looking around blankly)\r\n            No.",
    "DR. DREYFUSS",
    "Yes, you do. Now concentrate.",
    "FRAN",
    "I don't know.\r\n\r\nBud is coming back with the coffee.",
    "DR. DREYFUSS",
    "(pointing to Bud)\r\n            Do you know who this is?\r\n                   (Fran tries to focus)\r\n            Look at him.",
    "FRAN",
    "Mr. Baxter -- nineteenth floor.",
    "BUD",
    "Hello, Miss Kubelik.",
    "DR. DREYFUSS",
    "(to Bud)\r\n            Mister -- Miss -- such politeness!",
    "BUD",
    "(to Dr. Dreyfuss, discreetly)\r\n            Well -- we work in the same\r\n            building -- and we try to keep it\r\n            quiet --",
    "FRAN",
    "(to Bud, puzzled)\r\n            What are you doing here?\r\n\r\nBud throws Dr. Dreyfuss a look, as if to say that Fran's\r\nmind still wasn't functioning properly.",
    "BUD",
    "(to Fran)\r\n            Don't you remember? We were at the\r\n            office party together --",
    "FRAN",
    "Oh, yes -- office party -- Miss\r\n            Olsen --",
    "BUD",
    "That's right.\r\n                   (to Dr. Dreyfuss;\r\n                   improvising rapidly)\r\n            I told you we had a fight -- that's\r\n            what it was about -- Miss Olsen --\r\n            you know that other girl you saw --",
    "FRAN",
    "(still trying to\r\n                   figure out Bud's presence)\r\n            I don't understand --",
    "BUD",
    "It's not important, Fran -- the\r\n            main thing is that I got here in\r\n            time -- and you're going to be all\r\n            right --\r\n                   (to Dr. Dreyfuss)\r\n            -- isn't she, Doc?",
    "FRAN",
    "(closing her eyes)\r\n            I'm so tired --",
    "DR. DREYFUSS",
    "Here -- drink this.\r\n\r\nHe forces her to swallow some coffee.",
    "FRAN",
    "(pushing the mug away)\r\n            Please -- just let me sleep.",
    "DR. DREYFUSS",
    "You can't sleep.\r\n                   (shaking her)\r\n            Come on, Fran -- open your eyes.\r\n                   (to Bud)\r\n            Let's get her walking. We've got to\r\n            keep her awake for the next couple\r\n            of hours.\r\n\r\nThey lift her from the chair, and each draping one of her\r\narms over his shoulder, they start to walk her up and down\r\nthe room.",
    "DR. DREYFUSS",
    "(urging Fran on)\r\n            Now walk, Fran. One, two, three,\r\n            four -- one, two, three, four --\r\n            that's the idea -- left, right,\r\n            left, right -- now we turn -- one,\r\n            two, three, four --\r\n\r\nAt first, Fran's feet just drag along the floor between them.\r\nBut gradually, as Dr. Dreyfuss' voice continues droning\r\nhypnotically, she falls into the rhythm of it, repeating the\r\nwords after him and putting her weight on her feet.",
    "DR. DREYFUSS",
    "Left, right, left, right -- walk,\r\n            walk, walk -- one, two, three,\r\n            four -- turn -- left, right, left,\r\n            right -- now you got it --",
    "DISSOLVE TO:",
    "INT. THE APARTMENT - DAWN",
    "Through the bedroom window comes the first faint light of\r\ndawn. Fran has been put to bed by an exhausted Dr. Dreyfuss.\r\nShe is in her slip, and Dreyfuss is just drawing the blanket\r\nover her. Her eyes are closed, and she is moaning fitfully.\r\nWatching from the doorway is Bud, in shirtsleeves now, weary\r\nand disheveled.",
    "DR. DREYFUSS",
    "She'll sleep on and off for the\r\n            next twenty-four hours. Of course,\r\n            she'll have a dandy hangover when\r\n            she wakes up --",
    "BUD",
    "Just as long as she's okay.",
    "DR. DREYFUSS",
    "(massaging his calves)\r\n            These cases are harder on the\r\n            doctor than on the patient. I ought\r\n            to charge you by the mile.\r\n\r\nThey have now moved out into the living room, where the\r\noverhead light and the Christmas tree bulbs are still on.",
    "DR. DREYFUSS",
    "Any of that coffee left?",
    "BUD",
    "Sure.\r\n\r\nHe goes into the kitchen. Dr. Dreyfuss takes a small notebook\r\nwith a fountain pen clipped to it out of his bag, sinks down\r\non the couch.",
    "DR. DREYFUSS",
    "How do you spell her last name?",
    "BUD",
    "(from kitchen)\r\n            Kubelik -- with two k's.",
    "DR. DREYFUSS",
    "What's her address?\r\n                   (no answer from Bud)\r\n            Where does she live?\r\n\r\nBud appears from the kitchen, stirring the coffee powder in\r\na cup of hot water.",
    "BUD",
    "(apprehensive)\r\n            Why do you want to know, Doc? You\r\n            don't have to report this, do you?",
    "DR. DREYFUSS",
    "It's regulations.",
    "BUD",
    "(setting the coffee down)\r\n            She didn't mean it, Doc -- it was\r\n            an accident -- she had a little too\r\n            much to drink and -- she didn't\r\n            know what she was doing -- there\r\n            was no suicide note or anything --\r\n            believe me, Doc, I'm not thinking\r\n            about myself --",
    "DR. DREYFUSS",
    "(sipping the hot coffee)\r\n            Aren't you?",
    "BUD",
    "It's just that she's got a family --\r\n            and there's the people in the\r\n            office -- look, Doc, can't you\r\n            forget you're a doctor -- let's\r\n            just say you're here as a neighbor --",
    "DR. DREYFUSS",
    "(a long look at Bud)\r\n            Well, as a doctor, I guess I can't\r\n            prove it wasn't an accident.\r\n                   (closes notebook)\r\n            But as your neighbor, I'd like to\r\n            kick your keester clear around the\r\n            block.\r\n                   (indicating coffee)\r\n            Mind if I cool this off?\r\n\r\nHe uncaps the bottle of Scotch, pours a large slug into his\r\ncoffee.",
    "BUD",
    "Help yourself.",
    "DR. DREYFUSS",
    "(taking a big gulp of\r\n                   the spiked coffee)\r\n            I don't know what you did to that\r\n            girl in there -- and don't tell\r\n            me -- but it was bound to happen,\r\n            the way you carry on. Live now, pay\r\n            later. Diner's Club!\r\n                   (another swig)\r\n            Why don't you grow up, Baxter? Be a\r\n            mensch! You know what that means?",
    "BUD",
    "I'm not sure.",
    "DR. DREYFUSS",
    "A mansch -- a human being! So you\r\n            got off easy this time -- so you\r\n            were lucky --",
    "BUD",
    "Yeah, wasn't I?",
    "DR. DREYFUSS",
    "(finishing coffee)\r\n            But you're not out of the woods\r\n            yet, Baxter -- because most of them\r\n            try it again!\r\n                   (picks up bag, starts\r\n                   toward door)\r\n            You know where I am if you need me.\r\n\r\nHe walks out, closing the door after him. Bud dejectedly\r\nturns off the overhead light, kicks out the plug of the\r\nChristmas tree lights, trudges into the bedroom.\r\n\r\nFran is fast asleep. Bud picks up her dress, gets a hanger,\r\ndrapes the dress over it, hangs it from the door. An early\r\nmorning chill has invaded the room, and Bud switches an the\r\nelectric blanket to keep Fran warm. Then he slumps into a\r\nchair beside the bed, looks at Fran compassionately. The\r\nlight on the dial of the electric blanket glows in the\r\ngrayish room. Bud just sits there, watching Fran.",
    "FADE OUT:",
    "FADE IN:",
    "INT. STAIRCASE - BROWNSTONE HOUSE - DAY",
    "Mrs. Lieberman, followed by her dog, is climbing the stairs\r\nto Bud's apartment, puffing asthmatically. She seems quite\r\nangry as she arrives at the door and rings the bell. There\r\nis no answer. She starts knocking impatiently.",
    "MRS. LIEBERMAN",
    "Mr. Baxter. Open up already!\r\n\r\nFinally the door opens a crack, and Bud peers out. He looks\r\nlike a man who has slept in his clothes -- rumpled, bleary-\r\neyed, unshaven.",
    "BUD",
    "Oh -- Mrs. Lieberman.",
    "MRS. LIEBERMAN",
    "So who did you think it was -- Kris\r\n            Kringle? What was going on here\r\n            last night?",
    "BUD",
    "Last night?",
    "MRS. LIEBERMAN",
    "All that marching -- tramp, tramp,\r\n            tramp -- you were having army\r\n            maneuvers maybe?",
    "BUD",
    "I'm sorry, Mrs. Lieberman -- and\r\n            I'll never invite those people again.",
    "MRS. LIEBERMAN",
    "What you get from renting to\r\n            bachelors. All night I didn't sleep\r\n            ten minutes -- and I'm sure you\r\n            woke up Dr. Dreyfuss.",
    "BUD",
    "Don't worry about Dr. Dreyfuss -- I\r\n            happen to know he was out on a case.",
    "MRS. LIEBERMAN",
    "I'm warning you, Mr. Baxter -- this\r\n            is a respectable house, not a\r\n            honky-tonky.\r\n                   (to the dog)\r\n            Come on, Oscar.\r\n\r\nBud watches her start down the stairs with the dog, withdraws\r\ninto the apartment.",
    "INT. THE APARTMENT - DAY",
    "Bud closes the door, crosses toward the bedroom, looks\r\ninside. Fran is asleep under the electric blanket, breathing\r\nevenly. He tries to shut the bedroom door, but it won't\r\nclose completely because Fran's dress, on a hanger. is\r\nhooked over the top. He goes to the phone, picks it up,\r\ndials the operator.",
    "BUD",
    "(his voice low)\r\n            Operator, I want White Plains, New\r\n            York -- Mr. J. D. Sheldrake --\r\n                   (an added thought)\r\n            -- make it person to person.",
    "INT. LIVING ROOM - SHELDRAKE HOUSE - DAY",
    "The decor is split-level Early American. There is a huge\r\nChristmas tree and a jumble of presents, open gift boxes,\r\nand discarded wrappings.\r\n\r\nSheldrake and his two sons, TOMMY and JEFF JR., are squatting\r\non the floor, testing a Cape Canaveral set the kids got for\r\nChristmas. Sheldrake is in a brand new dressing gown, with a\r\nmanufacturer's tag still dangling from it, and the boys are\r\nin pajamas and astronaut's helmets. As for the Cape Canaveral\r\nset, it is a miniature layout of block-houses, launching\r\npads, and assorted space-missiles. Tommy has his finger on\r\nthe button controlling one of the rockets.",
    "SHELDRAKE",
    "(counting down)\r\n            7-6-5-4-3-2-1 -- let her rip!\r\n\r\nTommy presses the button, and a spring sends the rocket\r\ntoward the ceiling. Just then, the phone in the entrance\r\nhall starts ringing.",
    "JEFF JR.",
    "I'll get it.\r\n\r\nHe hurries to the phone.",
    "TOMMY",
    "Hey, Dad -- why don't we put a fly\r\n            in the nose cone and see if we can\r\n            bring it back alive?",
    "SHELDRAKE",
    "It's a thought.",
    "TOMMY",
    "Maybe we should send up two flies --\r\n            and see if they'll propagate in\r\n            orbit.",
    "SHELDRAKE",
    "See if they'll what?",
    "TOMMY",
    "Propagate -- you know, multiply --\r\n            baby flies?",
    "SHELDRAKE",
    "Oh -- oh!",
    "JEFF JR.",
    "(coming back from the phone)\r\n            It's for you, Dad. A Mr. Baxter.",
    "SHELDRAKE",
    "(getting up)\r\n            Baxter?",
    "JEFF JR.",
    "Person to person.\r\n\r\nSheldrake heads quickly for the phone.",
    "TOMMY",
    "(to Jeff Jr.)\r\n            Come on -- help me round up some\r\n            flies.\r\n\r\nIn the entrance hall, Sheldrake picks up the phone, turns\r\nhis back toward the living room, speaks in a low voice.",
    "SHELDRAKE",
    "Hello? -- yes -- what's on your\r\n            mind, Baxter?",
    "BUD - ON PHONE",
    "BUD",
    "I hate to disturb you, but something\r\n            came up -- it's rather important --\r\n            and I think it would be a good idea\r\n            if you could see me -- at the\r\n            apartment -- as soon as possible.",
    "SHELDRAKE - ON PHONE",
    "SHELDRAKE",
    "You're not making sense, Baxter.\r\n            What's this all about?",
    "BUD - ON PHONE",
    "BUD",
    "I didn't want to tell you over the\r\n            phone but that certain party -- you\r\n            know who I mean -- I found her here\r\n            last night -- she had taken an\r\n            overdose of sleeping pills.",
    "SHELDRAKE - ON PHONE",
    "SHELDRAKE",
    "What?\r\n\r\nFrom the stairway beyond him comes:",
    "MRS. SHELDRAKE'S VOICE",
    "What is it, Jeff? Who's on the phone?\r\n\r\nSheldrake turns from the phone. Halfway down the stairs is\r\nMrs. Sheldrake, in a quilted house-robe.",
    "SHELDRAKE",
    "(a nice recovery)\r\n            One of our employees had an\r\n            accident -- I don't know why they\r\n            bother me with these things on\r\n            Christmas Day.\r\n                   (into phone)\r\n            Yes, Baxter -- just how serious is\r\n            it?\r\n\r\nOut of the corner of his eye, he watches Mrs. Sheldrake come\r\ndown the stairs, pass behind him on the way to the living\r\nroom.",
    "BUD - ON PHONE",
    "BUD",
    "Well, it was touch and go there for\r\n            a while -- but she's sleeping it\r\n            off now.\r\n\r\nHe glances through the half-open door toward the sleeping\r\nFran.",
    "BUD",
    "I thought maybe you'd like to be\r\n            here when she wakes up.",
    "SHELDRAKE - ON PHONE",
    "SHELDRAKE",
    "That's impossible.\r\n                   (an apprehensive look\r\n                   toward the living room)\r\n            You'll have to handle this situation\r\n            yourself -- as a matter of fact,\r\n            I'm counting on you --",
    "INT. THE APARTMENT - DAY",
    "BUD",
    "(into phone)\r\n            Yes, sir -- I understand.\r\n                   (taking Fran's letter\r\n                   out of his pocket)\r\n            She left a note -- you want me to\r\n            open it and read it to you?\r\n                   (a beat)\r\n            Well, it was just a suggestion --\r\n            no, you don't have to worry about\r\n            that, Mr. Sheldrake -- I kept your\r\n            name out of it so there'll be no\r\n            trouble, police-wise or newspaper-\r\n            wise --\r\n\r\nAs Bud continues talking on the phone, Fran, in the bedroom,\r\nopens her eyes, looks around vaguely, trying to figure out\r\nwhere she is. She sits up in bed, winces, holds her head in\r\nher hands -- she has a fierce hangover.",
    "BUD",
    "(into phone)\r\n            -- you see, the doctor, he's a\r\n            friend of mine -- we were very\r\n            lucky in that respect -- actually,\r\n            he thinks she's my girl -- no, he\r\n            just jumped to the conclusion --\r\n            around here, I'm known as quite a\r\n            ladies' man --\r\n\r\nIn the bedroom Fran, becoming aware of Bud's voice, crawls\r\nout of bed and holding on to the furniture, moves unsteadily\r\ntoward the living room door.",
    "BUD",
    "(into phone)\r\n            -- of course, we're not out of the\r\n            woods yet -- sometimes they try it\r\n            again -- yes sir, I'll do my\r\n            best -- it looks like it'll be a\r\n            couple of days before she's fully\r\n            recovered, and I may have a little\r\n            problem with the landlady --\r\n\r\nBehind him, Fran appears in the bedroom doorway, barefooted\r\nand in her slip. She leans groggily against the door post,\r\ntrying to focus on Bud and to concentrate on what he's saying.",
    "BUD",
    "(into phone)\r\n            -- all right, Mr. Sheldrake, I'll\r\n            keep her in my apartment as long as\r\n            I can -- any sort of message you\r\n            want me to give her? -- well, I'll\r\n            think of something -- goodbye, Mr.\r\n            Sheldrake.\r\n\r\nHe hangs up the phone slowly.",
    "FRAN",
    "(weakly)\r\n            I'm sorry.\r\n\r\nBud turns around, sees her standing there on rubbery legs.",
    "FRAN",
    "I'm sorry, Mr. Baxter.",
    "BUD",
    "Miss Kubelik --\r\n                   (hurries toward her)\r\n            -- you shouldn't be out of bed.",
    "FRAN",
    "I didn't know -- I had no idea this\r\n            was your apartment --",
    "BUD",
    "(putting his arm\r\n                   around her)\r\n            Let me help you.\r\n\r\nHe leads her back into the bedroom.",
    "FRAN",
    "I'm so ashamed. Why didn't you just\r\n            let me die?",
    "BUD",
    "What kind of talk is that?\r\n                   (he lowers her onto\r\n                   the bed)\r\n            So you got a little over-\r\n            emotional -- but you're fine now.",
    "FRAN",
    "(a groan)\r\n            My head -- it feels like a big wad\r\n            of chewing gum. What time is it?",
    "BUD",
    "Two o'clock.",
    "FRAN",
    "(struggling to her feet)\r\n            Where's my dress? I have to go home.\r\n\r\nHer knees buckle. Bud catches her.",
    "BUD",
    "You're in no condition to go\r\n            anywhere -- except back to bed.",
    "FRAN",
    "You don't want me here --",
    "BUD",
    "Sure I do. It's always nice to have\r\n            company for Christmas.\r\n\r\nHe tries to put her back to bed. Fran resists.",
    "BUD",
    "Miss Kubelik, I'm stronger than you\r\n            are --",
    "FRAN",
    "I just want to go brush my teeth --",
    "BUD",
    "Oh -- of course. I think there's a\r\n            new toothbrush somewhere.\r\n\r\nHe crosses to the bathroom, takes a plaid robe off the hook\r\non the back of the door, hands it to Fran.",
    "BUD",
    "Here -- put this on.\r\n\r\nIn the bathroom, he finds an unused toothbrush in a plastic\r\ncontainer. His eyes fall on his safety razor. With a glance\r\ntoward the bedroom, he unscrews the razor, removes the\r\nblade, drops it in his shirt pocket. Then he empties the\r\nblades from the dispenser, puts those in his pocket. Now he\r\nnotices a bottle of iodine on the medicine shelf, stashes\r\nthat in another pocket, just as Fran appears in the doorway\r\nwearing the robe.",
    "BUD",
    "(handing her the toothbrush)\r\n            Here. How about some breakfast?",
    "FRAN",
    "No -- I don't want anything.",
    "BUD",
    "I'll fix you some coffee.\r\n\r\nHe crosses the bedroom, heading for the kitchen, stops.",
    "BUD",
    "Oh -- we're all out of coffee --\r\n            you had quite a lot of it last\r\n            night --\r\n\r\nHe thinks for a moment, hurries toward the hall door.",
    "INT. SECOND FLOOR LANDING - DAY",
    "Bud comes out of his apartment, leaving the door half open,\r\nheads for the Dreyfuss apartment. He rings the bell, peers\r\ndown over the banister to make sure Mrs. Lieberman isn't\r\nsnooping around. Mrs. Dreyfuss opens the door.",
    "BUD",
    "Mrs. Dreyfuss, can I borrow some\r\n            coffee -- and maybe an orange and a\r\n            couple of eggs?",
    "MRS. DREYFUSS",
    "(contemptuously)\r\n            Eggs he asks me for. Oranges. What\r\n            you need is a good horse-whipping.",
    "BUD",
    "Ma'am?",
    "MRS. DREYFUSS",
    "From me the doctor has no secrets.\r\n            Poor girl -- how could you do a\r\n            thing like that?",
    "BUD",
    "I didn't really do anything --\r\n            honest -- I mean, you take a girl\r\n            out a couple of times a week --\r\n            just for laughs -- and right away\r\n            she thinks you're serious --\r\n            marriage-wise.",
    "MRS. DREYFUSS",
    "Big shot! For you, I wouldn't lift\r\n            a finger -- but for her, I'll fix a\r\n            little something to eat.\r\n\r\nShe slams the door in his face, Bud starts back to his\r\napartment.",
    "INT. THE APARTMENT - DAY",
    "Fran enters shakily from the bedroom, looks around for the\r\nphone, locates it, picks it up. As she starts dialing, Bud\r\ncomes in from the hall.",
    "BUD",
    "Who are you calling, Miss Kubelik?",
    "FRAN",
    "My sister -- she'll want to know\r\n            what happened to me.",
    "BUD",
    "(alarmed)\r\n            Wait a minute -- let's talk this\r\n            over first.\r\n                   (hurries up to her,\r\n                   takes the receiver away)\r\n            Just what are you going to tell her?",
    "FRAN",
    "Well, I haven't figured it out,\r\n            exactly.",
    "BUD",
    "You better figure it out -- exactly.\r\n            Suppose she asks you why you didn't\r\n            come home last night?",
    "FRAN",
    "I'll tell her I spent the night\r\n            with a friend.",
    "BUD",
    "Who?",
    "FRAN",
    "Someone from the office.",
    "BUD",
    "And where are you now?",
    "FRAN",
    "In his apartment.",
    "BUD",
    "His apartment?",
    "FRAN",
    "I mean -- her apartment.",
    "BUD",
    "What's your friend's name?",
    "FRAN",
    "Baxter.",
    "BUD",
    "What's her first name?",
    "FRAN",
    "Miss.\r\n                   (she is impressed\r\n                   with her own cleverness)",
    "BUD",
    "When are you coming home?",
    "FRAN",
    "As soon as I can walk.",
    "BUD",
    "Something wrong with your legs?",
    "FRAN",
    "No -- it's my stomach.",
    "BUD",
    "Your stomach?",
    "FRAN",
    "They had to pump it out.",
    "BUD",
    "(hanging up the phone)\r\n            Miss Kubelik, I don't think you\r\n            ought to call anybody -- not till\r\n            that chewing gum is out of your\r\n            head.\r\n                   (leads her into bedroom)",
    "FRAN",
    "But they'll be worried about me --\r\n            my brother-in-law may be calling\r\n            the police --",
    "BUD",
    "That's why we have to be careful --\r\n            we don't want to involve anybody --\r\n            after all, Mr. Sheldrake is a\r\n            married man --",
    "FRAN",
    "Thanks for reminding me.\r\n\r\nShe pulls away from him, starts to get into bed.",
    "BUD",
    "(contritely)\r\n            I didn't mean it that way -- I was\r\n            just talking to him on the phone --\r\n            he's very concerned about you.",
    "FRAN",
    "He doesn't give a damn about me.",
    "BUD",
    "Oh, you're wrong. He told me --",
    "FRAN",
    "He's a liar. But that's not the\r\n            worst part of it -- the worst part\r\n            is -- I still love him.\r\n\r\nThe doorbell rings.",
    "BUD",
    "Must be Mrs. Dreyfuss --\r\n                   (starts into living room)\r\n            -- remember the doctor -- from last\r\n            night -- that's his wife.\r\n\r\nHe opens the hall door. Mrs. Dreyfuss brushes past him with\r\na tray full of food.",
    "MRS. DREYFUSS",
    "So where is the victim?\r\n                   (Bud indicates the bedroom)\r\n            Max the Knife!\r\n\r\nShe sweeps into the bedroom, Bud tagging along.",
    "MRS. DREYFUSS",
    "(to Fran)\r\n            Nu, little lady, how are we feeling\r\n            today?",
    "FRAN",
    "I don't know -- kind of dizzy.",
    "MRS. DREYFUSS",
    "Here. The best thing for dizzy is a\r\n            little noodle soup with chicken --\r\n            white meat -- and a glass tea.\r\n\r\nShe sets the tray down on Fran's lap.",
    "FRAN",
    "Thank you. I'm really not hungry.",
    "MRS. DREYFUSS",
    "Go ahead! Eat! Enjoy!\r\n\r\nShe hands her the soup spoon, turns to Bud.",
    "MRS. DREYFUSS",
    "You wouldn't have such a thing as a\r\n            napkin, would you?",
    "BUD",
    "Well, I have some paper towels --",
    "MRS. DREYFUSS",
    "Beatnik! Go to my kitchen -- third\r\n            drawer, under the good silver,\r\n            there is napkins.",
    "BUD",
    "Yes, Mrs. Dreyfuss.\r\nHe starts out with a worried backward glance toward the two.\r\nFran is just sitting there, the spoon in her hand, not\r\ntouching the soup.",
    "MRS. DREYFUSS",
    "So what are you waiting for -- a\r\n            singing commercial?",
    "FRAN",
    "I can't eat.\r\n\r\nMrs. Dreyfuss takes the spoon from her, starts to feed her.",
    "MRS. DREYFUSS",
    "You must eat -- and you must get\r\n            healthy -- and you must forget him.\r\n            Such a fine boy he seemed when he\r\n            first moved in here -- clean and\r\n            cut -- a regular Ivy Leaguer. Turns\r\n            out he is King Farouk. Mit the\r\n            drinking -- mit the cha cha -- mit\r\n            the no napkins. A girl like you,\r\n            for the rest of your life you want\r\n            to cry in your noodle soup? Who\r\n            needs it! You listen to me, you\r\n            find yourself a nice, substantial\r\n            man -- a widower maybe -- and\r\n            settle down -- instead of nashing\r\n            all those sleeping pills -- for\r\n            what, for whom? -- for some Good\r\n            Time Charlie?\r\n                   (sees Bud approaching\r\n                   with napkin)\r\n            Sssh!",
    "BUD",
    "(gaily)\r\n            One napkin, coming up.\r\n                   (hands it to Fran)\r\n            I wish we had some champagne to\r\n            wrap it around.",
    "MRS. DREYFUSS",
    "(to Fran)\r\n            What did I tell you?",
    "BUD",
    "(uncomfortable)\r\n            Look, Mrs. Dreyfuss, you don't have\r\n            to wait around. I'll wash the\r\n            dishes and --",
    "MRS. DREYFUSS",
    "You wash 'em, you break 'em. I'll\r\n            come back for them later.\r\n                   (to Fran)\r\n            If he makes trouble, give me a yell.\r\n\r\nShe exits.",
    "FRAN",
    "She doesn't seem to like you very\r\n            much.",
    "BUD",
    "Oh, I don't mind. As a matter of\r\n            fact, I'm sort of flattered -- that\r\n            anybody should think a girl like\r\n            you -- would do a thing like\r\n            this -- over a guy like me.",
    "FRAN",
    "(glancing at night table)\r\n            Oh. Did you find something here --\r\n            an envelope -- ?",
    "BUD",
    "Yes, I've got it.\r\n                   (takes envelope out\r\n                   of back pocket)\r\n            Don't you think we'd better destroy\r\n            it? So it won't fall into the wrong\r\n            hands -- ?",
    "FRAN",
    "Open it.\r\n\r\nBud tears open the envelope, takes out Sheldrake's hundred\r\ndollars.",
    "BUD",
    "There's nothing here but a hundred\r\n            dollar bill.",
    "FRAN",
    "That's right. Will you see that Mr.\r\n            Sheldrake gets it?",
    "BUD",
    "(shrugging)\r\n            Sure.\r\n\r\nHe puts the money in his pocket.",
    "FRAN",
    "(holding out tray)\r\n            Here -- take this, will you?\r\n\r\nBud relieves her of the tray, sets it down.",
    "BUD",
    "You want me to move the television\r\n            set in here?\r\n                   (Fran shakes her head)\r\n            You play gin rummy?",
    "FRAN",
    "I'm not very good at it.",
    "BUD",
    "I am. Let me get the cards.",
    "FRAN",
    "You don't have to entertain me.\r\n\r\nBud opens the bureau drawer, takes out a deck of cards, a\r\nscore pad, and a pencil.",
    "BUD",
    "Nothing I'd like better -- you know\r\n            togetherness. Guess what I did last\r\n            Christmas. Had an early dinner at\r\n            the automat, then went to the zoo,\r\n            then I came home and cleaned up\r\n            after Mr. Eichelberger -- he had a\r\n            little eggnog party here. I'm way\r\n            ahead this year.\r\n\r\nHe pulls a chair up to the bed, starts to shuffle the cards.",
    "BUD",
    "Three across, spades double, high\r\n            deals.\r\n                   (they cut)\r\n            Eight -- ten.\r\n                   (he starts to deal)",
    "FRAN",
    "(pensively)\r\n            I think I'm going to give it all up.",
    "BUD",
    "Give what up?",
    "FRAN",
    "Why do people have to love people,\r\n            anyway?",
    "BUD",
    "Yeah -- I know what you mean.\r\n                   (flips over down card)\r\n            Queen.",
    "FRAN",
    "I don't want it.",
    "BUD",
    "Pick a card.\r\n\r\nShe does, and they start playing.",
    "FRAN",
    "What do you call it when somebody\r\n            keeps getting smashed up in\r\n            automobile accidents?",
    "BUD",
    "A bad insurance risk?",
    "FRAN",
    "(nodding)\r\n            That's me with men. I've been\r\n            jinxed from the word go -- first\r\n            time I was ever kissed was in a\r\n            cemetery.",
    "BUD",
    "A cemetery?",
    "FRAN",
    "I was fifteen -- we used to go\r\n            there to smoke. His name was\r\n            George -- he threw me over for a\r\n            drum majorette.",
    "BUD",
    "Gin.\r\n\r\nHe spreads his hand. Fran lays her cards down, and Bud adds\r\nthem up.",
    "BUD",
    "Thirty-six and twenty-five --\r\n            that's sixty-one and two boxes.\r\n                   (enters score on pad)",
    "FRAN",
    "I just have this talent for falling\r\n            in love with the wrong guy in the\r\n            wrong place at the wrong time.",
    "BUD",
    "(shuffling)\r\n            How many guys were there?",
    "FRAN",
    "(holding up four fingers)\r\n            Three. The last one was manager of\r\n            a finance company, back home in\r\n            Pittsburgh -- they found a little\r\n            shortage in his accounts, but he\r\n            asked me to wait for him -- he'll\r\n            be out in 1965.",
    "BUD",
    "(pushing the deck\r\n                   toward her)\r\n            Cut.",
    "FRAN",
    "(she does, and he\r\n                   starts dealing)\r\n            So I came to New York and moved in\r\n            with my sister and her husband --\r\n            he drives a cab. They sent me to\r\n            secretarial school, and I applied\r\n            for a job with Consolidated - but I\r\n            flunked the typing test --",
    "BUD",
    "Too slow?",
    "FRAN",
    "Oh. I can type up a storm, but I\r\n            can't spell. So they gave me a pair\r\n            of white gloves and stuck me in an\r\n            elevator -- that's how I met\r\n            Jeff --\r\n                   (her eyes mist up,\r\n                   and she puts her\r\n                   cards down)\r\n            Oh, God, I'm so fouled up. What am\r\n            I going to do now?",
    "BUD",
    "You better win a hand -- you're on\r\n            a blitz.",
    "FRAN",
    "Was he really upset when you told\r\n            him?",
    "BUD",
    "Mr. Sheldrake? Oh, yes. Very.",
    "FRAN",
    "Maybe he does love me -- only he\r\n            doesn't have the nerve to tell his\r\n            wife.",
    "BUD",
    "I'm sure that's the explanation.",
    "FRAN",
    "You really think so?",
    "BUD",
    "No doubt about it.",
    "FRAN",
    "(a thoughtful beat, then)\r\n            Can I have that pad and the pencil?",
    "BUD",
    "(handing her score\r\n                   pad and pencil)\r\n            What for?",
    "FRAN",
    "I'm going to write a letter to Mrs.\r\n            Sheldrake.",
    "BUD",
    "You are?",
    "FRAN",
    "As one woman to another -- I'm sure\r\n            she'll understand --",
    "BUD",
    "Miss Kubelik, I don't think that's\r\n            such a good idea.\r\n\r\nHe gently takes the pad and pencil away from her.",
    "FRAN",
    "Why not?",
    "BUD",
    "Well, for one thing, you can't\r\n            spell. And secondly -- if you did\r\n            something like that -- you'd hate\r\n            yourself.",
    "FRAN",
    "(fighting back tears)\r\n            I don't like myself very much anyway.",
    "BUD",
    "Pick up your cards and let's go.",
    "FRAN",
    "Do I have to?",
    "BUD",
    "You bet. I got a terrific hand.\r\n\r\nFran, her eyes drooping sleepily, picks up her cards, makes\r\na discard.",
    "BUD",
    "You sure you want to throw that card?",
    "FRAN",
    "Sure.",
    "BUD",
    "Gin.\r\n\r\nHe removes the cards from her hand, starts to add them up.",
    "BUD",
    "Fifty-two and twenty-five -- that's\r\n            seventy-seven -- spades is double --\r\n            a hundred and fifty-four -- and\r\n            four boxes -- you're blitzed in two\r\n            games.\r\n\r\nHe enters the score on the pad. As he starts to shuffle\r\nagain, he notices that Fran has slid down on the pillow, and\r\nthat her eyes are closed -- she is asleep.\r\n\r\nBud rises, adjusts the blanket over her. He stands there\r\nlooking at her for a moment, runs his hand over his chin.\r\nRealizing he needs a shave, he crosses to the bathroom.\r\n\r\nIn the bathroom, Bud washes his face, squirts some shaving\r\ncream into his hand, starts to apply it.",
    "EXT. BROWNSTONE HOUSE - DAY",
    "A Volkswagen draws up to the curb in front of the house.\r\nKirkeby gets out on the street side, Sylvia squeezes herself\r\nout through the other door. Kirkeby raises the front hood of\r\nthe Volkswagen, reaches into the luggage compartment, takes\r\nout a cardboard bucket with a bottle of champagne on ice.\r\nTogether, he and Sylvia start up the steps of the house,\r\nSylvia already cha cha-ing in anticipation.",
    "INT. APARTMENT - DAY",
    "In the bathroom, Bud has just finished lathering his face\r\nwhen the doorbell rings. He starts into the bedroom.",
    "BUD",
    "(muttering to himself)\r\n            All right -- all right, Mrs.\r\n            Dreyfuss.\r\n\r\nHe glances at the sleeping Fran, picks up the tray, carries\r\nit into the living room, pulling the bedroom door closed\r\nbehind him. But it doesn't shut completely, because of\r\nFran's dress hooked over the top.\r\n\r\nBud crosses to the hall door, opens it. Outside are Kirkeby,\r\nwith the champagne bucket, and Sylvia.",
    "KIRKEBY",
    "Hi, Baxter.",
    "BUD",
    "(blocking the door)\r\n            What do you want?",
    "KIRKEBY",
    "What do I -- ?\r\n                   (to Sylvia)\r\n            Just a minute.\r\n\r\nHe pushes his way into the apartment past Bud.",
    "BUD",
    "You can't come in.",
    "KIRKEBY",
    "(closing the door\r\n                   behind him)\r\n            What's the matter with you, Buddy-\r\n            boy? I made a reservation for four\r\n            o'clock, remember?\r\n\r\nHe heads for the coffee table, sets the champagne down. Bud\r\nshoots a quick glance toward the bedroom door, gets rid of\r\nthe tray.",
    "BUD",
    "Look, you can't stay here. Just\r\n            take your champagne and go.",
    "KIRKEBY",
    "Baxter, I don't want to pull rank\r\n            on you -- but I told the lady it\r\n            was all set -- you want to make a\r\n            liar out of me?",
    "BUD",
    "Are you going to leave, Mr. Kirkeby,\r\n            or do I have to throw you out?\r\n\r\nAs Bud spins him around, Kirkeby notices the dress on the\r\nbedroom door.",
    "KIRKEBY",
    "Buddy-boy, why didn't you say so?\r\n                   (indicating dress)\r\n            You got yourself a little playmate,\r\n            huh?",
    "BUD",
    "Now will you get out?",
    "INT. SECOND FLOOR LANDING - DAY",
    "Outside the door of Bud's apartment, Sylvia is cha cha-ing\r\nimpatiently. Up the stairs comes Dr. Dreyfuss, in his\r\novercoat and carrying his medical bag.",
    "SYLVIA",
    "(knocking on the door)\r\n            Hey, come on, what are we waiting\r\n            for? Open up, will you?\r\n\r\nShe continues cha-cha-ing. Dr. Dreyfuss has unlocked the\r\ndoor to his apartment, and is watching Sylvia, appalled by\r\nthe fact that Baxter seems to be at it again. He starts\r\ninside.",
    "DR. DREYFUSS",
    "(calling)\r\n            Mildred --  !\r\n\r\nHe shuts the door behind him.",
    "SYLVIA",
    "(knocking on Baxter's door)\r\n            What's holding things up?",
    "INT. APARTMENT - DAY",
    "Kirkeby looks toward the door in response to Sylvia's\r\nknocking.",
    "KIRKEBY",
    "Say, why don't we have ourselves a\r\n            party -- the four of us?",
    "BUD",
    "No!\r\n\r\nHe forces Kirkeby toward the hall door. Kirkeby, glancing\r\npast him through the partly-open door of the bedroom,\r\ncatches sight of Fran asleep in bed.",
    "KIRKEBY",
    "(grinning smugly)\r\n            Well, I don't blame you. So you hit\r\n            the jackpot, eh kid -- I mean,\r\n            Kubelik-wise?\r\n                   (Bud opens the door,\r\n                   gestures him out)\r\n            Don't worry. I won't say a word to\r\n            anybody.",
    "INT. SECOND FLOOR LANDING - DAY",
    "Kirkeby comes backing out the door of Bud's apartment, minus\r\nthe champagne bucket.",
    "KIRKEBY",
    "Stay with it, Buddy-boy!\r\n                   (Bud shuts the door\r\n                   on him)\r\n            Come on, Sylvia.",
    "SYLVIA",
    "What gives?",
    "KIRKEBY",
    "A little mixup in signals. Let's go.",
    "SYLVIA",
    "Go where?",
    "KIRKEBY",
    "(leading her toward stairs)\r\n            What's your mother doing this\r\n            afternoon?",
    "SYLVIA",
    "She's home -- stuffing a turkey.",
    "KIRKEBY",
    "Why don't we send her to a movie --\r\n            like Ben-Hur?",
    "SYLVIA",
    "That's fine. But what are we going\r\n            to do about grandma and Uncle\r\n            Herman and Aunt Sophie and my two\r\n            nieces --",
    "INT. APARTMENT - DAY",
    "Bud comes into the bedroom. As he heads for the bathroom,\r\nFran stirs slightly, opens her eyes.",
    "FRAN",
    "Who was that?",
    "BUD",
    "Just somebody delivering a bottle\r\n            of champagne. Like some?",
    "FRAN",
    "(shaking her head)\r\n            Would you mind opening the window?\r\n\r\nShe turns off the electric blanket as Bud crosses to the\r\nwindow, pushes it up. Then a thought strikes him, and he\r\nlooks at Fran suspiciously.",
    "BUD",
    "Now don't go getting any ideas,\r\n            Miss Kubelik.",
    "FRAN",
    "I just want some fresh air.",
    "BUD",
    "It's only one story down -- the\r\n            best you can do is break a leg.",
    "FRAN",
    "So they'll shoot me -- like a horse.",
    "BUD",
    "(approaching the bed)\r\n            Please, Miss Kubelik, you got to\r\n            promise me you won't do anything\r\n            foolish.",
    "FRAN",
    "Who'd care?",
    "BUD",
    "I would.",
    "FRAN",
    "(sleepily)\r\n            Why can't I ever fall in love with\r\n            somebody nice like you?",
    "BUD",
    "(ruefully)\r\n            Yeah. Well -- that's the way it\r\n            crumbles, cookie-wise. Go to sleep.\r\n\r\nFran closes her eyes. Bud returns to the bathroom, picks up\r\nhis razor, starts to shave. But something seems to be wrong\r\nwith the razor -- and unscrewing it, he realizes that there\r\nis no blade. Sheepishly, he takes out the blade he hid in\r\nhis shirt pocket, inserts it in his razor, screws it shut.\r\nThen he resumes shaving.",
    "FADE OUT:",
    "FADE IN:",
    "INT. SHELDRAKE'S ANTEROOM - DAY",
    "It is the morning after Christmas, and Miss Olsen and the\r\nother girls are just settling down to work. Sheldrake, in\r\nhat and coat, approaches from the elevators, comes through\r\nthe glass doors.",
    "SECRETARIES",
    "(ad lib)\r\n            Good morning, Mr. Sheldrake.",
    "SHELDRAKE",
    "(ignoring them)\r\n            Miss Olsen, will you come into my\r\n            office, please?\r\n\r\nHe strides into the inner office. Miss Olsen picks up her\r\nstenographic pad, follows him in.",
    "INT. SHELDRAKE'S OFFICE - DAY",
    "Sheldrake is removing his hat and coat as Miss Olsen comes\r\nin, shuts the door behind her.",
    "MISS OLSEN",
    "Did you have a nice Christmas?",
    "SHELDRAKE",
    "Lovely. You were a big help.",
    "MISS OLSEN",
    "Me?",
    "SHELDRAKE",
    "Thank you for giving that little\r\n            pep talk to Miss Kubelik at the\r\n            office party.",
    "MISS OLSEN",
    "(dropping her\r\n                   business-like mask)\r\n            I'm sorry, Jeff. You know I could\r\n            never hold my liquor --",
    "SHELDRAKE",
    "But I thought you could hold your\r\n            tongue.",
    "MISS OLSEN",
    "It won't happen again.",
    "SHELDRAKE",
    "You bet it won't. I'll arrange for\r\n            you to get a month's severance\r\n            pay --\r\n                   (she looks at him, uncomprehending)\r\n            That's right, Miss Olsen. I'm\r\n            letting you go.",
    "MISS OLSEN",
    "(quietly)\r\n            You let me go four years ago, Jeff.\r\n            Only you were cruel enough to make\r\n            me sit out there and watch the new\r\n            models pass by.",
    "SHELDRAKE",
    "I'd appreciate it if you'd be out\r\n            of here as soon as you can.",
    "MISS OLSEN",
    "(formal again)\r\n            Yes, Mr. Sheldrake.\r\n\r\nShe turns and walks out of the office, shutting the door.\r\nSheldrake looks after her for a moment, then goes to his\r\ndesk, picks up the phone, dials the operator.",
    "SHELDRAKE",
    "(into phone)\r\n            This is Mr. Sheldrake. I'd like Mr.\r\n            Baxter's home telephone number --\r\n            that's C.C. Baxter, in Ordinary\r\n            Premium Accounting --",
    "INT. SHELDRAKE'S ANTEROOM - DAY",
    "Miss Olsen has put on her coat, and is going through her\r\ndesk drawers, cleaning out her personal belongings -- nail\r\npolish, emery boards, an extra pair of glasses, etc. As she\r\nstows them away in her handbag, one of the buttons on the\r\ntelephone lights up. Miss Olsen hesitates for a second, then\r\nwith a quick look around, she pushes the button down,\r\ncarefully picks up the receiver, listens in.",
    "INT. SHELDRAKE'S OFFICE - DAY",
    "Sheldrake is dialing the last two digits of a telephone\r\nnumber. After a moment, someone answers.",
    "SHELDRAKE",
    "Hello, Baxter? Jeff Sheldrake. Can\r\n            you talk?",
    "INT. THE APARTMENT - DAY",
    "Bud, wearing slacks, a shirt open at the neck, and a cardigan\r\nsweater, is at the phone. A pillow and a blanket on the\r\nliving room couch indicate where he spent the night.",
    "BUD",
    "(looking off)\r\n            Yes, she's in the shower -- she's\r\n            coming along fine, considering.",
    "SHELDRAKE - ON PHONE",
    "SHELDRAKE",
    "Good. Is there anything you need --\r\n            money -- ?",
    "BUD - ON PHONE",
    "BUD",
    "No, thank you, Mr. Sheldrake. As a\r\n            matter of fact, I've got some money\r\n            for you -- a hundred dollars --",
    "SHELDRAKE - ON PHONE",
    "SHELDRAKE",
    "Oh.\r\n                   (a beat)\r\n            Well, if there's anything I can do\r\n            for you --",
    "BUD - ON PHONE",
    "BUD",
    "For me? I don't think so. But I was\r\n            hoping maybe you could do something\r\n            for her --",
    "SHELDRAKE - ON PHONE",
    "SHELDRAKE",
    "Like what? Put yourself in my\r\n            place, Baxter -- how can I help\r\n            her -- my hands are tied --",
    "INT. APARTMENT - DAY",
    "Fran now appears in the bedroom, wearing the plaid robe, and\r\ntoweling her damp hair.",
    "BUD",
    "(into phone)\r\n            Well, at least you can talk to\r\n            her -- let me put her on -- and\r\n            please be gentle --\r\n\r\nHe puts the receiver down, crosses toward the bedroom door.",
    "BUD",
    "There's a call for you --",
    "FRAN",
    "(approaching)\r\n            For me?",
    "BUD",
    "-- Mr. Sheldrake.",
    "FRAN",
    "I don't want to talk to him.",
    "BUD",
    "I think you should. I have to run\r\n            down to the grocery anyway -- all\r\n            that's left around here is one\r\n            frozen pizza --\r\n                   (takes raincoat and\r\n                   old hat from hanger)\r\n            I'll be right back -- okay?\r\n\r\nFran nods, watches him go out. Then she glances toward the\r\nphone, which is off the hook. Reluctantly she advances\r\ntoward it, picks it up.",
    "FRAN",
    "(into phone)\r\n            Hello, Jeff.\r\n                   (a long beat)\r\n            Yes, I'm all right.",
    "SHELDRAKE - ON PHONE",
    "SHELDRAKE",
    "Fran, why did you do it? It's so\r\n            childish -- and it never solves\r\n            anything -- I ought to be very\r\n            angry with you, scaring me like\r\n            that -- but let's forget the whole\r\n            thing -- pretend it never\r\n            happened -- what do you say, Fran?\r\n                   (no answer)\r\n            Fran --",
    "INT. SHELDRAKE'S ANTEROOM",
    "Miss Olsen, glued to the phone, is listening intently.",
    "SHELDRAKE - ON PHONE",
    "SHELDRAKE",
    "Are you there, Fran?",
    "FRAN - ON PHONE",
    "FRAN",
    "Of course I'm not here -- because\r\n            the whole thing never happened -- I\r\n            never took those pills -- I never\r\n            loved you -- we never even met --\r\n            isn't that the way you want it?",
    "SHELDRAKE - ON PHONE",
    "SHELDRAKE",
    "There you go again -- you know I\r\n            didn't mean it that way, Fran. Just\r\n            get well -- do what the nurse tells\r\n            you -- I mean Baxter -- and I'll\r\n            see you as soon as I can. Bye, Fran.\r\n                   (he hangs up)",
    "INT. SHELDRAKE'S ANTEROOM - DAY",
    "Miss Olsen hangs up the phone, sits there for a moment,\r\nweighing what she has overheard. Then she makes a decision,\r\npicks up the phone again, dials a number. As she waits for\r\nan answer, she glances toward Sheldrake's office.",
    "MISS OLSEN",
    "(into phone)\r\n            Hello, Mrs. Sheldrake? This is Miss\r\n            Olsen -- fine, thank you -- Mrs.\r\n            Sheldrake, I was wondering if we\r\n            could have lunch together? -- well,\r\n            I don't know how important it is,\r\n            but I think you might find it\r\n            educational -- it concerns your\r\n            husband -- all right, one o'clock,\r\n            at Longchamp's, Madison and 59th.\r\n\r\nShe looks up as the door to the inner office opens and\r\nSheldrake comes out. He stops when he sees that Miss Olsen\r\nis still there.",
    "MISS OLSEN",
    "(hanging up phone)\r\n            Don't worry, I'm on my way.\r\n                   (she rises)\r\n            I was just making a personal call.\r\n\r\nShe opens her handbag, takes out a coin, puts it down on the\r\ndesk.",
    "MISS OLSEN",
    "Here's a dime.\r\n\r\nShe marches out through the glass doors toward the elevators\r\nas Sheldrake stands there, watching her.",
    "DISSOLVE TO:",
    "EXT. BROWNSTONE HOUSE - DAY",
    "Bud comes down the street, carrying a large brown paper bag\r\noverflowing with groceries. He goes up the steps of the\r\nhouse and through the front door.",
    "INT. STAIRCASE AND SECOND FLOOR LANDING - DAY",
    "As Bud starts up the stairs, with the groceries, Mrs.\r\nLieberman comes hurrying down toward him.",
    "MRS. LIEBERMAN",
    "(breathlessly)\r\n            Oh, Mr. Baxter -- I'm glad you're\r\n            here -- I was just going to get the\r\n            passkey.",
    "BUD",
    "What for?",
    "MRS. LIEBERMAN",
    "I thought I smelled gas coming from\r\n            your apartment.",
    "BUD",
    "Gas?\r\n\r\nHe races up the stairs two at a time, fumbling frantically\r\nfor his key. Reaching the door of his apartment, he unlocks\r\nit, dashes in.",
    "INT. THE APARTMENT - DAY",
    "Bud comes bursting through the door. The living room is\r\nempty, and the bedclothes have been removed from the couch.",
    "BUD",
    "(calling)\r\n            Miss Kubelik!\r\n\r\nHe dumps the bag of groceries on a table, rushes into the\r\nkitchen. The burner has been turned on under the kettle, but\r\nthere is no flame, and gas is hissing from the vents. Bud\r\nsnaps it off, starts out again.",
    "BUD",
    "Miss Kubelik!\r\n\r\nMeanwhile Fran has appeared from the bathroom, and is\r\napproaching the bedroom door. She is still in her robe, and\r\nis holding a double sock-stretcher with one of Bud's socks\r\non it. Bud, rounding the corner from the kitchen at full\r\nspeed, collides with Fran in the bedroom doorway. He grabs\r\nher arms with obvious relief.",
    "BUD",
    "Are you all right?",
    "FRAN",
    "Sure.\r\n                   (sniffs)\r\n            What's that funny smell?",
    "BUD",
    "Gas.\r\n                   (indicating kitchen)\r\n            Didn't you turn it on?",
    "FRAN",
    "Yes. I was boiling some water to\r\n            get the coffee stains out of my\r\n            dress.",
    "BUD",
    "(accusingly)\r\n            You turned it on -- but you didn't\r\n            light it.",
    "FRAN",
    "Are you supposed to?",
    "BUD",
    "In this house, you're supposed to.",
    "FRAN",
    "Oh.\r\n\r\nBud starts to take off his hat and coat, notices the sock-\r\nstretcher in her hand.",
    "BUD",
    "What are you doing with that?",
    "FRAN",
    "I was washing my stockings, so I\r\n            decided I might as well do your\r\n            socks.",
    "BUD",
    "Thank you.",
    "FRAN",
    "It's very curious -- I could only\r\n            find three and a half pair.",
    "BUD",
    "Well, things are a little\r\n            disorganized around here.\r\n\r\nHe carries the bag of groceries into the kitchen, Fran\r\ntrailing after him. During the following, he removes the\r\ncontents of the bag -- bread, eggs, bacon, spaghetti, ground\r\nround, frankfurters, and assorted canned goods -- sets them\r\nout on the drainboard.",
    "FRAN",
    "I'd say. What's a tennis racquet\r\n            doing in the kitchen?\r\n\r\nShe produces the racquet from behind the stove.",
    "BUD",
    "Tennis racquet? Oh, I remember -- I\r\n            was cooking myself an Italian\r\n            dinner.\r\n                   (Fran looks at him oddly)\r\n            I used it to strain the spaghetti.",
    "FRAN",
    "(thinking it over)\r\n            Why not?",
    "BUD",
    "As a matter of fact, I'm a pretty\r\n            good cook -- but I'm a lousy\r\n            housekeeper.",
    "FRAN",
    "Yes, you are,\r\n                   (indicating the\r\n                   living room)\r\n            When I was straightening up the\r\n            couch, you know what I found? Six\r\n            hairpins, a lipstick, a pair of\r\n            false eyelashes, and a swizzle\r\n            stick from the Stork Club.",
    "BUD",
    "(shrugging)\r\n            It's just that I'm the kind of guy\r\n            who can't say no -- I don't mean to\r\n            girls -- I mean --",
    "FRAN",
    "You mean to someone like Mr.\r\n            Sheldrake.",
    "BUD",
    "I guess so.",
    "FRAN",
    "I know so. He's a taker.",
    "BUD",
    "A what?",
    "FRAN",
    "Some people take, some people get\r\n            took -- and they know they're\r\n            getting took -- and there's nothing\r\n            they can do about it.",
    "BUD",
    "I wouldn't say that --\r\n                   (trying to change the subject)\r\n            What would you like to have for\r\n            diner? There's onion soup and\r\n            canned asparagus --",
    "FRAN",
    "I really ought to be getting home.\r\n            My family will be flipping by now.\r\n\r\nShe starts into the living room. Bud follows her.",
    "BUD",
    "You can't leave yet. The doctor\r\n            says it takes forty-eight hours to\r\n            get the stuff out of your system.",
    "FRAN",
    "(wistfully)\r\n            I wonder how long it takes to get\r\n            someone you're stuck on out of your\r\n            system? If they'd only invent some\r\n            kind of a pump for that --\r\n\r\nShe sits on the arm of a chair.",
    "BUD",
    "I know how you feel, Miss Kubelik.\r\n            You think it's the end of the\r\n            world -- but it's not, really. I\r\n            went through exactly the same thing\r\n            myself.",
    "FRAN",
    "You did?",
    "BUD",
    "Well, maybe not exactly -- I tried\r\n            to do it with a gun.",
    "FRAN",
    "Over a girl?",
    "BUD",
    "Worse than that -- she was the wife\r\n            of my best friend -- and I was mad\r\n            for her. But I knew it was\r\n            hopeless -- so I decided to end it\r\n            all. I went to a pawnshop and\r\n            bought a forty-five automatic and\r\n            drove up to Eden Park -- do you\r\n            know Cincinnati?",
    "FRAN",
    "No, I don't.",
    "BUD",
    "Anyway, I parked the car and loaded\r\n            the gun -- well, you read in the\r\n            papers all the time that people\r\n            shoot themselves, but believe me,\r\n            it's not that easy -- I mean, how\r\n            do you do it? -- here, or here, or\r\n            here --\r\n                   (with cocked finger,\r\n                   he points to his\r\n                   temple, mouth and chest)\r\n            -- you know where I finally shot\r\n            myself?",
    "FRAN",
    "Where?",
    "BUD",
    "(indicating kneecap)\r\n            Here.",
    "FRAN",
    "In the knee?",
    "BUD",
    "Uh-huh. While I was sitting there,\r\n            trying to make my mind up, a cop\r\n            stuck his head in the car, because\r\n            I was illegally parked -- so I\r\n            started to hide the gun under the\r\n            seat and it went off -- pow!",
    "FRAN",
    "(laughing)\r\n            That's terrible.",
    "BUD",
    "Yeah. Took me a year before I could\r\n            bend my knee -- but I got over the\r\n            girl in three weeks. She still\r\n            lives in Cincinnati, has four kids,\r\n            gained twenty pounds -- she sends\r\n            me a fruit cake every Christmas.",
    "FRAN",
    "(suddenly suspicious)\r\n            Are you just making that up to make\r\n            me feel better?",
    "BUD",
    "Of course not. Here's the fruit\r\n            cake.\r\n                   (shows it to her\r\n                   under Christmas tree)\r\n            And you want to see my knee?\r\n                   (starts to raise\r\n                   pant-leg)",
    "FRAN",
    "No, thanks. The fellows in the\r\n            office may get the wrong idea how I\r\n            found out.",
    "BUD",
    "So let 'em. Look, I'm going to cook\r\n            dinner for us. We'll have the fruit\r\n            cake for dessert. You just sit\r\n            there and rest. You've done enough\r\n            for one day.",
    "FRAN",
    "(smiling)\r\n            Yes, nurse.\r\n\r\nBud starts happily into the kitchen.",
    "DISSOLVE TO:",
    "INT. LOBBY INSURANCE BUILDING - DAY",
    "It is mid-afternoon, and traffic is light. A Yellow Cab has\r\npulled up in front of the entrance, and the driver, a\r\nstockily-built young man in a leather jacket and cap, gets\r\nout and comes through the revolving doors into the lobby.\r\nHis name is KARL MATUSCHKA, and he is Fran's brother-in-law.\r\nAs he cases the elevators, the starter comes up to him.",
    "ELEVATOR STARTER",
    "Can I help you?",
    "MATUSCHKA",
    "I'm looking for one of the elevator\r\n            girls -- Miss Kubelik.",
    "ELEVATOR STARTER",
    "So am I. She didn't report this\r\n            morning.",
    "MATUSCHKA",
    "She didn't. Where can I get some\r\n            information -- who's in charge here?",
    "ELEVATOR STARTER",
    "That comes under General Office\r\n            Administration. See Mr. Dobisch,\r\n            twenty-first floor.",
    "MATUSCHKA",
    "Thanks.\r\n\r\nHe steps into an elevator, the doors of which are just\r\nclosing.",
    "INT. DOBISCH'S OFFICE - DAY",
    "Dobisch is sitting behind his desk, lighting a cigar.\r\nKirkeby, who has dropped in for a little visit, is perched\r\non the edge of the desk.",
    "KIRKEBY",
    "-- so yesterday afternoon I take\r\n            Sylvia up to the apartment, and\r\n            guess who he's got stashed away in\r\n            the bedroom?",
    "DOBISCH",
    "Who?",
    "KIRKEBY",
    "Kubelik.",
    "DOBISCH",
    "No kidding. Buddy-boy and Kubelik\r\n            having themselves a little toot!",
    "KIRKEBY",
    "Toot? It's more like a lost weekend.\r\n            Neither of them showed up for work\r\n            today.",
    "DOBISCH",
    "A.W.O.L.?",
    "KIRKEBY",
    "What gripes me is the two of them\r\n            were guzzling my champagne while\r\n            Sylvia and I wound up at the\r\n            Guggenheim Museum.\r\n\r\nThe glass door opens and Matuschka comes in.",
    "MATUSCHKA",
    "Mr. Dobisch?",
    "DOBISCH",
    "Yeah.",
    "MATUSCHKA",
    "My name is Karl Matuschka -- my\r\n            sister-in-law, she runs one of the\r\n            elevators here -- Fran Kubelik.",
    "KIRKEBY",
    "(exchanging a glance\r\n                   with Dobisch)\r\n            Miss Kubelik?",
    "MATUSCHKA",
    "You know her?",
    "DOBISCH",
    "Of course. There may be a lot of\r\n            employees here -- but we're one big\r\n            happy family.",
    "MATUSCHKA",
    "Well, she lives with us -- and my\r\n            wife, she's getting a little\r\n            nervous -- on account of Fran\r\n            hasn't been home for two days.",
    "KIRKEBY",
    "(another look at Dobisch)\r\n            That so.",
    "MATUSCHKA",
    "Anyway, we was wondering if somebody\r\n            in the office would know what\r\n            happened to her.",
    "DOBISCH",
    "I see.\r\n                   (to Kirkeby)\r\n            What do you think, Al? Can we help\r\n            the man?",
    "KIRKEBY",
    "(after a pregnant pause)\r\n            Why not? We don't owe Buddy-boy\r\n            anything.",
    "DOBISCH",
    "Yeah. What's Buddy-boy done for us\r\n            lately?",
    "MATUSCHKA",
    "(scowling)\r\n            Who is Buddy-boy?",
    "DISSOLVE TO:",
    "INT. THE APARTMENT - EVENING",
    "Buddy-boy is bending over a hot stove, preparing an Italian\r\ndinner. He takes a saucepan of spaghetti off the fire, and\r\npicking up the tennis racquet with the other hand, pours the\r\nspaghetti on top of the racquet strings. Then he turns on\r\nthe faucet, runs water over the spaghetti. With the combined\r\ntechnique of Brillat-Savarin and Pancho Gonzales, he gently\r\nagitates the racquet, letting the water drain off the\r\nspaghetti. As he works, he hums a theme from Tschaikowsky's\r\nCapriccio Italien.\r\n\r\nFran walks in, still in her robe.",
    "FRAN",
    "Are we dressing for dinner?",
    "BUD",
    "No -- just come as you are.",
    "FRAN",
    "(watching him)\r\n            Say, you're pretty good with that\r\n            racquet.",
    "BUD",
    "You ought to see my backhand.\r\n                   (dumping spaghetti\r\n                   into platter)\r\n            And wait till I serve the meatballs.\r\n                   (demonstrates)",
    "FRAN",
    "Shall I light the candles?",
    "BUD",
    "It's a must -- gracious-living-wise.\r\n\r\nAs Fran starts into the living room, Bud begins to ladle\r\nmeat sauce onto the spaghetti, humming operatically.\r\n\r\nIn the living room, the small table has been set for two,\r\nand prominent on it is the champagne bottle that Mr. Kirkeby\r\nleft behind, still in its cardboard bucket, but freshly iced.\r\nAs Fran lights the candles, she notices the napkins on the\r\ntable, peels a price-tag off the corner of one of them.",
    "FRAN",
    "I see you bought some napkins.",
    "BUD",
    "Might as well go all the way.\r\n\r\nHe carries the platter of spaghetti and meat sauce in from\r\nthe kitchen, sets it on the table, sprinkles some cheese on\r\nit. Then he crosses to the coffee table, where a full\r\nmartini pitcher stands in readiness, fills a couple of\r\nglasses. Fran seats herself at the table.",
    "BUD",
    "You know, I used to live like\r\n            Robinson Crusoe -- shipwrecked\r\n            among eight million people. Then\r\n            one day I saw a footprint in the\r\n            sand -- and there you were --\r\n                   (hands her martini)\r\n            It's a wonderful thing -- dinner\r\n            for two.",
    "FRAN",
    "You usually eat alone?",
    "BUD",
    "Oh, no. Sometimes I have dinner\r\n            with Ed Sullivan, sometimes with\r\n            Dinah Shore or Perry Como -- the\r\n            other night I had dinner with Mae\r\n            West -- of course, she was much\r\n            younger then.\r\n                   (toasting)\r\n            Cheers.",
    "FRAN",
    "Cheers.\r\n\r\nThey drink.",
    "BUD",
    "You know what we're going to do\r\n            after dinner?",
    "FRAN",
    "The dishes?",
    "BUD",
    "I mean, after that?",
    "FRAN",
    "What?",
    "BUD",
    "You don't have to if you don't want\r\n            to --",
    "FRAN",
    "I don't?",
    "BUD",
    "We're going to finish that gin game.",
    "FRAN",
    "Oh.",
    "BUD",
    "So I want you to keep a clear head.\r\n\r\nThe door bell rings. Carrying his martini glass, Bud crosses\r\nto the door, starts to open it.",
    "BUD",
    "Because I don't want to take\r\n            advantage of you -- the way I did\r\n            yesterday in bed.\r\n\r\nBy now the door is open, and Bud is speaking to Fran over\r\nhis shoulder. He turns, finds himself face to face with Karl\r\nMatuschka, who is standing grimly in the doorway.",
    "MATUSCHKA",
    "Baxter?",
    "BUD",
    "Yes?\r\n\r\nMatuschka shoves him roughly aside, strides past him toward\r\nFran, who has risen to her feet.",
    "MATUSCHKA",
    "What's with you, Fran -- did you\r\n            forget where you live?",
    "FRAN",
    "(to Bud)\r\n            This is my brother-in-law, Karl\r\n            Matuschka.",
    "BUD",
    "(friendly)\r\n            How do you do, Mr. Matuschka?",
    "MATUSCHKA",
    "(pushing Bud away; to Fran)\r\n            Okay, get your clothes on. I got\r\n            the cab downstairs.",
    "BUD",
    "Now, wait a minute. I know what\r\n            you're thinking -- but it's not as\r\n            bad as it looks --",
    "MATUSCHKA",
    "(shoving him away)\r\n            It's none of my business what you\r\n            do, Fran -- you're over twenty-\r\n            one -- but your sister happens to\r\n            think you're a lady.",
    "BUD",
    "All we were going to do is eat and\r\n            wash the dishes --",
    "MATUSCHKA",
    "(grabbing him)\r\n            Look, Buddy-boy -- if there wasn't\r\n            a lady present, I'd clobber you.",
    "FRAN",
    "(separating them)\r\n            All right, Karl -- I'll get dressed.\r\n\r\nShe exits into the bedroom, removing her dress from the\r\ndoor, and closing it. Matuschka leans against the wall\r\nbeside the hall door, eyeing Bud truculently. Bud raises a\r\nfinger to remonstrate with him -- then breaks into a nervous,\r\ningratiating smile.",
    "BUD",
    "Care for a martini? Champagne?\r\n                   (Matuschka continues\r\n                   glaring at him)\r\n            How about a little spaghetti with\r\n            meat sauce? Made it myself.\r\n                   (Matuschka just scowls)\r\n            Your sister-in-law sure is\r\n            terrific --\r\n                   (realizes his mistake;\r\n                   switching abruptly)\r\n            Must be murder driving a cab in New\r\n            York -- I mean, with all that\r\n            cross-town traffic --\r\n\r\nHe gestures with the martini glass, spilling the contents\r\nover his shirtfront. Through the partly open hall door, Dr.\r\nDreyfuss sticks his head in.",
    "DR. DREYFUSS",
    "Hi, Baxter.\r\n\r\nHe steps into the apartment, passing Matuschka without\r\nseeing him.",
    "DR. DREYFUSS",
    "How's the patient?",
    "BUD",
    "(quickly)\r\n            Oh, I'm fine, Doc.",
    "DR. DREYFUSS",
    "Not you -- Miss Kubelik.",
    "MATUSCHKA",
    "(stepping forward)\r\n            What's the matter with Miss Kubelik?",
    "BUD",
    "Oh, this is Mr. Matuschka -- he's\r\n            Miss Kubelik's -- he's got a cab\r\n            downstairs --",
    "MATUSCHKA",
    "(to Dreyfuss)\r\n            Fran been sick or something?\r\n\r\nDr. Dreyfuss looks at Bud.",
    "BUD",
    "No, no -- just had a little accident.",
    "MATUSCHKA",
    "(to Dreyfuss)\r\n            What does he mean, accident?",
    "DR. DREYFUSS",
    "Well, these things happen all the\r\n            time --",
    "MATUSCHKA",
    "What things?\r\n                   (grabbing Dreyfuss)\r\n            Say, what kind of doctor are you,\r\n            anyway?",
    "BUD",
    "(hastily)\r\n            Oh, not that kind. He just gave her\r\n            a shot and pumped her stomach out --\r\n\r\nBehind them, the bedroom door has opened, and Fran comes\r\nout, wearing her coat over her dress.",
    "MATUSCHKA",
    "What for?",
    "FRAN",
    "(coming up)\r\n            Because I took some sleeping pills.\r\n            But I'm all right now -- so let's go.",
    "MATUSCHKA",
    "Why did you take sleeping pills?",
    "BUD",
    "(promptly)\r\n            On account of me.",
    "MATUSCHKA",
    "(whirling on him)\r\n            You?",
    "BUD",
    "Who else?\r\n\r\nMatuschka lashes out with a left to Bud's jaw, and while he\r\nis off balance, catches him with a right to the eye. Bud\r\nfalls back against the Christmas tree, which topples with a\r\ncrash. Fran pulls Matuschka away from him.",
    "FRAN",
    "Leave him alone, Karl.\r\n\r\nShe kneels beside Bud.",
    "FRAN",
    "(tenderly)\r\n            You fool -- you damn fool.",
    "MATUSCHKA",
    "Come on, Fran.",
    "FRAN",
    "Goodbye, Mr. Baxter.\r\n\r\nShe kisses him on the cheek, rises, starts toward the door.",
    "FRAN",
    "Goodbye, doctor.\r\n\r\nShe follows Matuschka out. Bud looks after her, starry-eyed.",
    "DR. DREYFUSS",
    "I don't want to gloat, but just\r\n            between us, you had that coming to\r\n            you.\r\n                   (tilts Bud's chin up,\r\n                   examines his eye)\r\n            Tch, tch, tch. Are you going to\r\n            have a shiner tomorrow. Let me get\r\n            my bag.\r\n                   (he starts out)",
    "BUD",
    "(calling after him)\r\n            Don't bother, Doc. It doesn't hurt\r\n            a bit.\r\n\r\nHe is on Cloud Nine.",
    "FADE OUT:",
    "FADE IN:",
    "INT. NINETEENTH FLOOR - DAY",
    "Bud is coming from the elevators toward his office. He is\r\nwearing his chesterfield, bowler, and a pair of dark glasses.\r\nHe opens the office door, starts in.",
    "INT. BUD'S OFFICE - DAY",
    "Bud crosses directly to the phone, removes his glasses\r\nrevealing a swollen left eye. He dials a number.",
    "BUD",
    "(into phone)\r\n            Mr. Sheldrake's office? This is C.C.\r\n            Baxter. Would you please tell Mr.\r\n            Sheldrake I'd like to come up and\r\n            see him? It's rather important.\r\n            Will you call me back, please?\r\n\r\nHe hangs up, takes off his hat and coat, deposits them on\r\nthe clothes- tree. Then he paces around the office,\r\nrehearsing a speech out loud.",
    "BUD",
    "Mr. Sheldrake, I've got good news\r\n            for you. All your troubles are over.\r\n            I'm going to take Miss Kubelik off\r\n            your hands.\r\n                   (nods to himself with satisfaction)\r\n            The plain fact is, Mr. Sheldrake,\r\n            that I love her. I haven't told her\r\n            yet, but I thought you should be\r\n            the first to know. After all, you\r\n            don't really want her, and I do,\r\n            and although it may sound\r\n            presumptuous, she needs somebody\r\n            like me. So I think it would be the\r\n            thing all around --\r\n                   (the phone rings and\r\n                   he picks it up)\r\n            -- solution-wise.\r\n                   (into phone)\r\n            Yes? I'll be right up.\r\n\r\nHe hangs up, crosses to the door, opens it.",
    "BUD",
    "(to himself)\r\n            Mr. Sheldrake, I've got good news\r\n            for you --\r\n\r\nPutting on his dark glasses, he heads for the elevators,\r\nstill talking to himself.",
    "INT. NINETEENTH FLOOR - DAY",
    "Kirkeby and Dobisch are just stepping out of an elevator\r\nwhen Bud approaches. They grin smugly when they see that he\r\nis wearing dark glasses.",
    "KIRKEBY",
    "Hi, Buddy-boy. What happened to you?",
    "DOBISCH",
    "Hit by a swinging door? Or maybe a\r\n            Yellow Cab?\r\n\r\nBud pays no attention, walks right past them into the\r\nelevator, still muttering to himself. The doors close.",
    "KIRKEBY",
    "(as they move away\r\n                   from the elevators)\r\n            That guy really must've belted him.",
    "DOBISCH",
    "Yeah, he's punchy. Talking to\r\n            himself.",
    "INT. TWENTY-SEVENTH FLOOR FOYER - DAY",
    "The elevator doors open.",
    "ELEVATOR OPERATOR",
    "Twenty-seven.\r\n\r\nBud steps out. As he heads for Sheldrake's office, he\r\ncontinues rehearsing his speech.",
    "BUD",
    "You see, Mr. Sheldrake, those two\r\n            days she spent in the apartment --\r\n            it made me realize how lonely I'd\r\n            been before. But thanks to you, I'm\r\n            in a financial position to marry\r\n            her -- if I can ever square things\r\n            with her family.\r\n\r\nHe opens the door to Sheldrake's anteroom.",
    "INT. SHELDRAKE'S OFFICE - DAY",
    "Sheldrake is pacing in front of his desk. A couple of\r\nsuitcases are standing in a corner of the room. The intercom\r\nbuzzes, and Sheldrake presses the lever down.",
    "SECRETARY'S VOICE",
    "Mr. Baxter is here.",
    "SHELDRAKE",
    "Send him in.\r\n\r\nA beat, then the door opens, and Bud marches in determinedly.",
    "BUD",
    "Mr. Sheldrake, I've got good news\r\n            for you --",
    "SHELDRAKE",
    "And I've got good news for you,\r\n            Baxter. All your troubles are over.",
    "BUD",
    "(reacting to the echo)\r\n            Sir?",
    "SHELDRAKE",
    "I know how worried you were about\r\n            Miss Kubelik -- well, stop\r\n            worrying -- I'm going to take her\r\n            off your hands.",
    "BUD",
    "(stunned)\r\n            You're going to take her off my\r\n            hands?",
    "SHELDRAKE",
    "That's right.\r\n                   (indicating suitcases)\r\n            I've moved out of my house -- I'm\r\n            going to be staying in town, at the\r\n            Athletic Club.",
    "BUD",
    "You left your wife?",
    "SHELDRAKE",
    "Well, if you must know -- I fired\r\n            my secretary, my secretary got to\r\n            my wife, and my wife fired me.\r\n            Ain't that a kick in the head?",
    "BUD",
    "Yeah --",
    "SHELDRAKE",
    "Now what was your news, Baxter?",
    "BUD",
    "(recovering with difficulty)\r\n            It's about Miss Kubelik -- she's\r\n            all right again -- so she went back\r\n            home.",
    "SHELDRAKE",
    "Swell. And don't think I've\r\n            forgotten what you did for me.\r\n                   (opens door to\r\n                   adjoining office)\r\n            This way, Baxter.\r\n\r\nBud advances slowly toward the door.",
    "INT. ADJOINING OFFICE - DAY",
    "It is a slightly smaller and less lavish edition of Sheldrake\r\ns office. Sheldrake ushers Bud through the door, points to\r\nthe chair behind the desk.",
    "SHELDRAKE",
    "Sit down. Try it on for size.\r\n\r\nBud obeys like an automaton, lowers himself into the chair.",
    "SHELDRAKE",
    "You like?\r\n                   (indicating office)\r\n            It's all yours.",
    "BUD",
    "Mine?",
    "SHELDRAKE",
    "My assistant, Roy Thompson, has\r\n            been shifted to the Denver office,\r\n            and you're taking his place.\r\n                   (no reaction from Bud)\r\n            What's the matter, Baxter? You\r\n            don't seem very excited.",
    "BUD",
    "Well, it's just that so many things\r\n            have been happening so fast -- I'm\r\n            very pleased -- especially for Miss\r\n            Kubelik. Now that I've gotten to\r\n            know her better, I think she's the\r\n            kind of girl that definitely ought\r\n            to be married to somebody --",
    "SHELDRAKE",
    "Oh, sure, sure. But first the\r\n            property settlement has to be\r\n            worked out -- then it takes six\r\n            weeks in Reno -- meanwhile, I'm\r\n            going to enjoy being a bachelor for\r\n            a while.\r\n                   (starts back toward\r\n                   his own office)\r\n            Oh, by the way, you can now have\r\n            lunch in the executive dining\r\n            room --",
    "BUD",
    "Yes, sir.\r\n\r\nHe removes his dark glasses reflectively.",
    "SHELDRAKE",
    "That's just one of the privileges\r\n            that goes with this job. You also\r\n            get a nice little expense account,\r\n            the use of the executive washroom --\r\n                   (breaks off, peers at\r\n                   Bud's face)\r\n            Say, what happened to you, Baxter?",
    "BUD",
    "I got kicked in the head, too.",
    "SHELDRAKE",
    "Oh?\r\n\r\nWith a shrug, he exits into his own office, closing the door\r\nbehind him. Bud sits there, unconsciously bending the\r\nglasses in his hand until they suddenly snap in two. Bud\r\nglances down at the two broken halves, as though surprised\r\nby his own violence, tosses them on the desk.",
    "DISSOLVE TO:",
    "INT. LOBBY INSURANCE BUILDING - EVENING",
    "We are close on the building directory. Listed under\r\nPERSONNEL is J.D. SHELDRAKE, Director, and just below that a man's\r\nhand is inserting the name C.C. BAXTER in the slot marked Asst.\r\nDirector. The lettering is complete except for the final R.\r\n\r\nCamera pulls back to reveal the sign painter we saw earlier,\r\nworking on the directory. Watching him is Bud. He is wearing\r\nhis chesterfield and bowler, and still has a slight welt\r\nunder his left eye. It is after six o'clock, and there is\r\nvery little activity in the lobby.\r\n\r\nFran, wearing her coat over street clothes, approaches from\r\nthe direction of the elevators, stops when she sees Bud.",
    "FRAN",
    "Good evening, Mr. Baxter.\r\n\r\nBud turns to her in surprise, removes his bowler.",
    "BUD",
    "Oh, Miss Kubelik. How do you feel?",
    "FRAN",
    "Fine. How's your eye?",
    "BUD",
    "Fine.\r\n\r\nThere is a moment of constraint between them.",
    "FRAN",
    "How's everything at the apartment?",
    "BUD",
    "Nothing's changed. You know, we\r\n            never finished that gin game --",
    "FRAN",
    "I know.\r\n                   (a beat)\r\n            I suppose you heard about Mr.\r\n            Sheldrake --?",
    "BUD",
    "You mean, leaving his wife? Yeah.\r\n            I'm very happy for you.",
    "FRAN",
    "I never thought he'd do it.",
    "BUD",
    "I told you all along. You see, you\r\n            were wrong about Mr. Sheldrake.",
    "FRAN",
    "I guess so.",
    "BUD",
    "For that matter, you were wrong\r\n            about me, too. What you said about\r\n            those who take and those who get\r\n            took? Well, Mr. Sheldrake wasn't\r\n            using me -- I was using him. See?\r\n                   (indicating his name\r\n                   on directory)\r\n            Last month I was at desk 861 on the\r\n            nineteenth floor -- now I'm on the\r\n            twenty-seventh floor, paneled\r\n            office, three windows -- so it all\r\n            worked out fine -- we're both\r\n            getting what we want.",
    "FRAN",
    "Yes.\r\n                   (looks at her watch)\r\n            You walking to the subway?",
    "BUD",
    "No, thank you.\r\n                   (fumbling)\r\n            I -- well, to tell you the truth --\r\n                   (glancing around lobby)\r\n            -- I have this heavy date for\r\n            tonight --\r\n\r\nHe points off toward the newsstand. Standing there is a\r\ntall, attractive brunette, obviously waiting for someone.\r\nFran looks off in the indicated direction.",
    "FRAN",
    "Oh.",
    "BUD",
    "Aren't you meeting Mr. Sheldrake?",
    "FRAN",
    "No. You know how people talk. So I\r\n            decided it would be better if we\r\n            didn't see each other till\r\n            everything is settled, divorce-wise.",
    "BUD",
    "That's very wise.",
    "FRAN",
    "Good night, Mr. Baxter.",
    "BUD",
    "Good night, Miss Kubelik.\r\n\r\nFran walks toward the revolving doors. Bud watches her for a\r\nmoment, then strides briskly across the lobby toward the\r\nnewsstand. He goes right past the waiting brunette, stops in\r\nfront of a rack of pocket books, examines the merchandise. A\r\nman now comes out of a phone booth, joins the waiting\r\nbrunette, and they go off together. Bud picks out a couple\r\nof paperbacks, pays the clerk behind the counter. Stuffing a\r\nbook into each coat pocket, he moves slowly toward the\r\nrevolving doors.",
    "DISSOLVE TO:",
    "INT. SHELDRAKE'S OFFICE - DAY",
    "Sheldrake is swiveled around sideways behind his desk, with\r\na bootblack kneeling in front of him, shining his shoes.\r\nReaching for the intercom, Sheldrake presses down one of the\r\nlevers.",
    "SHELDRAKE",
    "Baxter -- would you mind stepping\r\n            in her for a minute?",
    "BAXTER'S VOICE",
    "Yes, Mr. Sheldrake.\r\n\r\nThe bootblack finishes the second shoe with a flourish,\r\ngathers up his equipment. Sheldrake tosses him a half dollar.",
    "BOOTBLACK",
    "Much obliged.\r\n\r\nHe exits into the anteroom as the door of the adjoining\r\noffice opens and Bud comes in, carrying several charts.\r\nThere is no trace left of his black eye.",
    "BUD",
    "(putting charts on desk)\r\n            Here's the breakdown of figures on\r\n            personnel turnover. Thirty-seven\r\n            percent of our female employees\r\n            leave to get married, twenty-two\r\n            percent quit because --",
    "SHELDRAKE",
    "(breaking in)\r\n            You're working too hard, Baxter.\r\n            It's New Year's Eve -- relax.",
    "BUD",
    "Yes, sir.",
    "SHELDRAKE",
    "I suppose you'll be on the town\r\n            tonight -- celebrating?",
    "BUD",
    "Naturally.",
    "SHELDRAKE",
    "Me, too. I'm taking Miss Kubelik\r\n            out -- I finally talked her into\r\n            it --",
    "BUD",
    "I see.",
    "SHELDRAKE",
    "The only thing is I'm staying at\r\n            the Athletic Club -- and it's\r\n            strictly stag so if you don't\r\n            mind --",
    "BUD",
    "Don't mind what?",
    "SHELDRAKE",
    "You know that other key to your\r\n            apartment -- well, when we had that\r\n            little scare about Miss Kubelik, I\r\n            thought I'd better get rid of it\r\n            quick -- so I threw it out the\r\n            window of the commuter train.",
    "BUD",
    "Very clever.",
    "SHELDRAKE",
    "Now I'll have to borrow your key.",
    "BUD",
    "Sorry, Mr. Sheldrake.",
    "SHELDRAKE",
    "What do you mean, sorry?",
    "BUD",
    "You're not going to bring anybody\r\n            up to my apartment.",
    "SHELDRAKE",
    "I'm not just bringing anybody --\r\n            I'm bringing Miss Kubelik.",
    "BUD",
    "Especially not Miss Kubelik.",
    "SHELDRAKE",
    "How's that again?",
    "BUD",
    "(flatly)\r\n            No key!",
    "SHELDRAKE",
    "Baxter, I picked you for my team\r\n            because I thought you were a bright\r\n            young man. You realize what you're\r\n            doing? Not to me -- but to yourself.\r\n            Normally it takes years to work\r\n            your way up to the twenty-seventh\r\n            floor -- but it takes only thirty\r\n            seconds to be out on the street\r\n            again. You dig?",
    "BUD",
    "(nodding slowly)\r\n            I dig.",
    "SHELDRAKE",
    "So what's it going to be?\r\n\r\nWithout taking his eyes off Sheldrake, Bud reaches into his\r\npocket, fishes out a key, drops it on the desk.",
    "SHELDRAKE",
    "Now you're being bright?",
    "BUD",
    "Thank you, sir.\r\n\r\nHe turns abruptly, starts back into his own office.",
    "INT. BUD'S NEW OFFICE - DAY",
    "Bud comes in, shutting the door behind him, stands rooted to\r\nthe spot for a moment. Then he takes some pencils out of his\r\nbreast pocket and drops them into a container on the desk,\r\ncloses his account book, slams a couple of open file drawers\r\nshut.\r\n\r\nAs he crosses to the clothes closet, the connecting door\r\nopens and Sheldrake comes in, key in hand.",
    "SHELDRAKE",
    "Say, Baxter -- you gave me the\r\n            wrong key.",
    "BUD",
    "No I didn't.",
    "SHELDRAKE",
    "(holding it out)\r\n            But this is the key to the executive\r\n            washroom.",
    "BUD",
    "That's right, Mr. Sheldrake. I\r\n            won't be needing it -- because I'm\r\n            all washed up around here.\r\n\r\nHe has taken his chesterfield and bowler out of the closet,\r\nand is putting the coat on.",
    "SHELDRAKE",
    "What's gotten into you, Baxter?",
    "BUD",
    "Just following doctor's orders.\r\n            I've decided to become a mensch.\r\n            You know what that means? A human\r\n            being.",
    "SHELDRAKE",
    "Now hold on, Baxter --",
    "BUD",
    "Save it. The old payola won't work\r\n            any more. Goodbye, Mr. Sheldrake.\r\n\r\nHe opens the door to the anteroom, starts out.",
    "INT. SHELDRAKE'S ANTEROOM - DAY",
    "Bud comes out of his office, carrying his bowler, strides\r\npast the secretaries and through the glass doors to the\r\nfoyer. An elevator is just unloading, and beside it a\r\nhandyman is cleaning out one of the cigarette receptacles.\r\nBud crosses to the elevator, and as he passes the handyman,\r\nhe jams his bowler on the man's head -- surrendering his\r\ncrown, so to speak. The elevator doors close. The handyman\r\nstraightens up, looks around in bewilderment.",
    "DISSOLVE TO:",
    "INT. THE APARTMENT - NIGHT",
    "Bud is in the process of packing. In the middle of the\r\nliving room are several large cardboard cartons filled with\r\nhis possessions. The art posters are off the walls, the\r\nbric-a-brac has been removed from the shelves, and Bud is\r\nstowing away the last of his books and records. He crosses\r\nto the fireplace, opens one of the drawers in the cabinet\r\nabove it, takes out a forty-five automatic. He holds the gun\r\nin the palm of his hand, studies it appraisingly.\r\n\r\nThe doorbell rings. Bud snaps out of his reverie, drops the\r\ngun into one of the cartons, goes to the door and opens it.\r\nStanding outside is Dr. Dreyfuss, with a plastic ice bucket\r\nin his hand.",
    "DR. DREYFUSS",
    "Say, Baxter -- we're having a\r\n            little party and we ran out of\r\n            ice -- so I was wondering --",
    "BUD",
    "Sure, Doc.",
    "DR. DREYFUSS",
    "(stepping inside)\r\n            How come you're alone on New Year's\r\n            Eve?",
    "BUD",
    "Well, I have things to do --",
    "DR. DREYFUSS",
    "(noticing cartons)\r\n            What's this -- you packing?",
    "BUD",
    "Yeah -- I'm giving up the apartment.\r\n\r\nHe goes into the kitchen, opens the refrigerator, starts to\r\npry out the ice-cube trays.",
    "DR. DREYFUSS",
    "Where are you moving to?",
    "BUD",
    "I don't know. All I know is I got\r\n            to get out of this place.",
    "DR. DREYFUSS",
    "Sorry to lose you, Baxter.",
    "BUD",
    "Me? Oh, you mean my body. Don't\r\n            worry, Doc -- it'll go to the\r\n            University -- I'll put it in\r\n            writing --\r\n\r\nHe dumps the ice-cubes, still in their trays, into the\r\nbucket Dr. Dreyfuss is holding. Then he pulls Kirkeby's\r\nunopened bottle of champagne out of the refrigerator.",
    "BUD",
    "Can you use a bottle of champagne?",
    "DR. DREYFUSS",
    "Booze we don't need. Why don't you\r\n            join us, Baxter? We got two brain\r\n            surgeons, an ear, nose and throat\r\n            specialist, a proctologist, and\r\n            three nurses from Bellevue.",
    "BUD",
    "No, thanks -- I don't feel like it.\r\n            Look, Doc -- in case I don't see\r\n            you again -- how much do I owe you\r\n            for taking care of that girl?",
    "DR. DREYFUSS",
    "Forget it -- I didn't do it as a\r\n            doctor -- I did it as a neighbor.\r\n                   (stopping in doorway)\r\n            By the way, whatever happened to her?",
    "BUD",
    "(airily)\r\n            You know me with girls. Easy come,\r\n            easy go. Goodbye, Doc.",
    "DR. DREYFUSS",
    "Happy New Year.\r\n\r\nBud closes the door, returns to the kitchen, brings out a\r\nbox of glassware and the tennis racquet. As he starts to\r\ndeposit the racquet in a carton, he notices a strand of\r\nspaghetti clinging to the strings. He removes it gently,\r\nstands there twirling the limp spaghetti absently around his\r\nfinger.",
    "CUT TO:",
    "INT. CHINESE RESTAURANT - NIGHT",
    "It is five minutes before midnight, New Year's Eve. Sitting\r\nalone in the last booth is Fran, a paper hat on her head, a\r\npensive look on her face. There are two champagne glasses on\r\nthe table, and the usual noisemakers, but the chair opposite\r\nher is empty. Above the general hubbub, the Chinese pianist\r\ncan be heard playing. After a moment, Fran glances off.\r\n\r\nThreading his way through the merrymakers crowding the bar\r\nand overflowing from the booths is Sheldrake. He is in\r\ndinner clothes, topped by a paper hat. Reaching the last\r\nbooth, he drops into the chair facing Fran.",
    "SHELDRAKE",
    "Sorry it took me so long on the\r\n            phone. But we're all set.",
    "FRAN",
    "All set for what?",
    "SHELDRAKE",
    "I rented a car -- it's going to be\r\n            here at one o'clock -- we're\r\n            driving to Atlantic City.",
    "FRAN",
    "Atlantic City?",
    "SHELDRAKE",
    "I know it's a drag -- but you can't\r\n            find a hotel room in town -- not on\r\n            New Year's Eve.",
    "FRAN",
    "(a long look at Sheldrake)\r\n            Ring out the old year, ring in the\r\n            new. Ring-a-ding-ding.",
    "SHELDRAKE",
    "I didn't plan it this way, Fran --\r\n            actually, it's all Baxter's fault.",
    "FRAN",
    "Baxter?",
    "SHELDRAKE",
    "He wouldn't give me the key to the\r\n            apartment.",
    "FRAN",
    "He wouldn't.",
    "SHELDRAKE",
    "Just walked out on me -- quit --\r\n            threw that big fat job right in my\r\n            face.",
    "FRAN",
    "(a faint smile)\r\n            The nerve.",
    "SHELDRAKE",
    "That little punk -- after all I did\r\n            for him! He said I couldn't bring\r\n            anybody to his apartment --\r\n            especially not Miss Kubelik. What's\r\n            he got against you, anyway?",
    "FRAN",
    "(a faraway look in\r\n                   her eye)\r\n            I don't know. I guess that's the\r\n            way it crumbles -- cookie-wise.",
    "SHELDRAKE",
    "What are you talking about?",
    "FRAN",
    "I'd spell it out for you -- only I\r\n            can't spell.\r\n\r\nThe piano player is consulting the watch on his upraised\r\nleft arm. He drops the arm in a signal, and the lights go\r\nout. At the same time, he strikes up AULD LANG SYNE.\r\n\r\nAll over the dimly lit room, couples get to their feet,\r\nembracing and joining in the song.\r\n\r\nIn the last booth, Sheldrake leans across the table, kisses\r\nFran.",
    "SHELDRAKE",
    "Happy New Year, Fran.\r\n\r\nFran's expression is preoccupied. Sheldrake faces in the\r\ndirection of the pianist, and holding his glass aloft, sings\r\nalong with the others.\r\n\r\nAs AULD LANG SYNE comes to an end, the place explodes\r\nnoisily -- there is a din of horns, ratchets, and shouted\r\ngreetings. The lights come up again.\r\n\r\nIn the last booth, Sheldrake turns back toward Fran -- but\r\nshe is no longer there. Her paper hat lies abandoned on her\r\nvacated chair.",
    "SHELDRAKE",
    "Fran --\r\n                   (looking around)\r\n            -- where are you, Fran?\r\n\r\nHe rises, cranes his neck, trying to spot her in the crowd.",
    "DISSOLVE TO:",
    "EXT. BROWNSTONE HOUSE - NIGHT",
    "Fran, a coat thrown over the dress she was wearing at the\r\nRickshaw, comes down the street almost at a run. There is a\r\nhappy, expectant look on her face. She hurries up the steps\r\nof the house and through the front door.",
    "INT. STAIRCASE AND SECOND FLOOR LANDING - NIGHT",
    "Fran mounts the stairs eagerly. As she reaches the landing\r\nand heads for Bud's apartment, there is a loud, sharp report\r\nfrom inside.\r\n\r\nFran freezes momentarily, then rushes to the door.",
    "FRAN",
    "Mr. Baxter!\r\n                   (pounding on door)\r\n            Mr. Baxter! Mr. Baxter!\r\n\r\nThe door opens and there stands Bud, the bottle of champagne\r\nhe has just uncorked still foaming over in his hand. He\r\nstares at Fran unbelievingly.",
    "FRAN",
    "(sagging with relief)\r\n            Are you all right?",
    "BUD",
    "I'm fine.",
    "FRAN",
    "Are you sure? How's your knee?",
    "BUD",
    "I'm fine all over.",
    "FRAN",
    "Mind if I come in?",
    "BUD",
    "(still stunned)\r\n            Of course not.",
    "INT. THE APARTMENT - NIGHT",
    "Fran comes in and Bud shuts the door. The room is the same\r\nas we left it, except for an empty champagne glass standing\r\non the coffee table.",
    "BUD",
    "Let me get another glass.\r\n\r\nHe goes to one of the cartons, takes out a champagne glass\r\nwrapped in newspaper, starts to unwrap it.",
    "FRAN",
    "(looking around)\r\n            Where are you going?",
    "BUD",
    "Who knows? Another neighborhood --\r\n            another town -- another job -- I'm\r\n            on my own.",
    "FRAN",
    "That's funny -- so am I.\r\n                   (Bud, pouring\r\n                   champagne, looks up\r\n                   at her)\r\n            What did you do with the cards?",
    "BUD",
    "(indicating carton)\r\n            In there.\r\n\r\nFran takes the deck of cards and the gin rummy score pad out\r\nof the carton, settles herself on the couch, starts to\r\nshuffle the cards expertly.",
    "BUD",
    "What about Mr. Sheldrake?",
    "FRAN",
    "I'm going to send him a fruit cake\r\n            every Christmas.\r\n\r\nBud sinks down happily on the couch, and Fran holds out the\r\ndeck to him.",
    "FRAN",
    "Cut.\r\n\r\nBud cuts a card, but doesn't look at it.",
    "BUD",
    "I love you, Miss Kubelik.",
    "FRAN",
    "(cutting a card)\r\n            Seven --\r\n                   (looking at Bud's card)\r\n            -- queen.\r\n\r\nShe hands the deck to Bud.",
    "BUD",
    "Did you hear what I said, Miss\r\n            Kubelik? I absolutely adore you.",
    "FRAN",
    "(smiling)\r\n            Shut up and deal!\r\n\r\nBud begins to deal, never taking his eyes off her. Fran\r\nremoves her coat, starts picking up her cards and arranging\r\nthem. Bud, a look of pure joy on his face, deals -- and\r\ndeals -- and keeps dealing.\r\n\r\nAnd that's about it. Story-wise.",
    "FADE OUT.",
    "THE END"
  ]
}
]
